{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "United, US Airways; $74 U.S. Airfares; More", "body": "\n\nUnited, US Airways; $74 U.S. Airfares; More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 3, 2007\n\n\n\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n \n\nIN THIS ISSUE: U.S., CARIBBEAN, LATIN AMERICA & EUROPE DEALS\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAustin, TX Baton Rouge, LA Chicago, IL Cincinnati, OH Cleveland, OH Columbus, OH Corpus Christi, TX Dallas/Ft. Worth, TX Detroit, MI El Paso, TX Fort Wayne, IN Houston, TX Indianapolis, IN Kansas City, MO Lexington, KY Lincoln, NE Louisville, KY Madison, WI Memphis, TN Milwaukee, WI Minneapolis, MN Nashville, TN New Orleans, LA Oklahoma City, OK Omaha, NE St. Louis, MO San Antonio, TX Toledo, OH Tulsa, OK Wichita, KS Click here for more city airfare deals.\n\n\n\n\n\n\nfrom $103 RTTravelocity\n\nUnited: Unadvertised Sale Fares United Airlines Bargain Airfares Hundreds of cities, all over the U.S.; includes taxes, fees\n\n\n\n\n\n\n\n\nfrom $89 RTKayak\n\nUS Airways Deals of the Week \nUS Airways Spring Airfare Savings Check out these low fares on popular routes; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $186 /personPriceline\n\nVegas Getaways: Save Up to $325! Las Vegas Air/Hotel Packages Choose from multi-star hotel/casinos, including Ballys, The Venetian, Planet Hollywood, MGM Grand, more. \n\n\n\n\n\n\n\n\nCheapCaribbean From $299/Person  $300 Off Puerto Rico Packages \nExclusive: Travel between June 1 and Nov 15 and save $300 on 4-night (or more) air/hotel packages. \n\n\n\n\n\n\n\n\nfrom $184 RTPriceline\n\nMidwest Airlines Deals of the Week Midwest Airlines Spring Airfare Sale Last days to lock in savings to/from Denver, Atlanta, Boston, Vegas, L.A., more. \n\n\n\n\n\n\n\n\nClick-and-Compare FaresFrom Cheapflights\n\nAirfare Deals to Orlando Orlando Spring Airfare Savings Compare low airfares to this Florida favorite from your local airport.\n\n\n\n\n\n\n\n\nfrom $74 RTPriceline\n\nU.S. Summer Airfare Deals \nAirfare Bargains: Top Summer DestinationsBook now for savings — and seats; includes all taxes, fees.\n\n\n\n\n\n\n\n\n\nfrom $94 RTPriceline\n\nFlights Under $150 Roundtrip, Including Taxes \nU.S. Airfares for Under $150 \n  Major airlines, nationwide flights and super airfare savings\n\n\n\n\n\n\n\n\nfrom $124 RTOrbitz\n\nColorado Airfare Deals of the Week Colorado Spring Airfare Savings Jet off to your favorite cities in the Centennial State; includes all taxes, fees.\n\n\n\n\n\n\n\n\nCarRentals.com: Up to 40% Off! \nU.S. Car Rentals From $8.95/Day \n  Compare discounts from top car rental firms for savings \n  all over the U.S. Includes Cleveland, L.A., Miami, Tampa, \n  Atlanta, Houston and many other favorite cities.\n\n\n\n\n\n\n\n\nClick-and-Compare FaresFrom Cheapflights\n\nAirfare Deals to San Francisco San Francisco Airfare Savings Compare low airfares to the Bay Area from your local airport.\n\n\n\n\n\n\n\n\nfrom $44 OWTravelocity\n\nAirTran: Deep Discount Deals AirTran Spring Airfare Sale Dozens of city and beach destinations on sale; purchase by May 8.\n\n\n\n\n\n\n\n\nfrom $115 RTKayak\n\nFlorida Airfare Deals of the Week Florida Airfare Discounts Sunsational savings to top cities including Orlando, Tampa, Ft. Lauderdale and Miami; includes taxes, fees\n\n\n\n\n\n\n\n\nClick-and-Compare FaresFrom Cheapflights\n\nAirfare Deals to San Diego San Diego Spring Airfare Savings Compare low airfares to SoCal from your local airport.\n\n\n\n\n\n\n\n\nfrom $525 /personLatin Destinations\n\nCentral America Vacation Deals of the Week \nCentral America Air/Hotel Packages Big savings on multi-night packages to Belize, Honduras, Costa Rica and Panama. Includes airfare; hotel accommodations and taxes; food, transfers and more.\n\n\n\n\n\n\n\n\nSave Up to 60%Hotwire\n\nTop Hotel Specials of the Week 4-Star Hotels at 2-Star Prices! Save up to 66% on top hotels all over the U.S.\n\n\n\n\n\n\n\n\nfrom $97 RTKayak\n\njetBlue Bargains jetBlue Airfare Roundup We've found this week's top bargain airfares; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $450 /personBeach Destinations\n\nDominican Republic \u0097 Air & Hotel Deal Punta Cana 4-Night All-Inclusive Getaway Relax at the 4-star Barcelo Punta Cana Beach Resort. Includes airfare, 4-nights accommodations; hotel taxes and gratuities; all meals and drinks; entertainment, more.\n\n\n\n\nMore Europe Deals\n\n\n\n\n\nfrom $649 /person1800FlyEurope\n\nItaly Getaway Deals of the Week Italy Spring Fly-Drive Packages Enjoy Italy at your own pace. Includes round-trip international airfare; airport and fuel surcharges; 3-day economy car rental (with unlimited mileage) and theft insurance.\n\n\n\n\n\n\n\n\nfrom $875 /personEuropean Destinations\n\nGreece: Create Your Own Vacation Package  \n'Best of Greece' Air/Hotel Packages \nExplore Athens, Mykonos, Paros, Santorini, Crete and Rhodes. Multi-night packages include international round-trip airfare; hotel accommodations and taxes; local ferries and/or inter-city domestic airfares and some meals.\n\n\n\n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 Southwest Airlines sale offers flights from $49 one-way \u0095 Skybus celebrates new service with $10 flights \u0095 American Airlines slashes airfares on Caribbean destinations \u0095 bmi sweepstakes offers free trip to Wimbledon Championship in July \u0095 American Airlines offers flyers weekly cell-phone text alerts on fare sales \u0095 US Airways says it will meet late fliers at gate with boarding passes \u0095 Northwest Airlines WorldPerks promo lets flyers exchange 10,000 miles for discount airfares \u0095 Government says 4th quarter 2006 airfares rose to highest levels since 2000 \u0095 Northwest Airlines debuts 'gift registry' for WorldPerks' members and their friends and familiesThe 'Lighter' Side of Travel \u0095 Survey Says Majority of Italian Restaurants Abroad Are Lousy! \u0095 World's Most Expensive Bowling Alley Opens in Las Vegas \u0095 Gun-Toting Celebs Try to Smuggle Firearms Onto Flights Trip Planning & Destinations \u0095 Jamestown (VA) Celebrates Its 400th Anniversary With Month-Long Series of Events \u0095 Red Sox Share Their Favorite Fenway Eateries \u0095 Big Names Star in Broadway's Spring Shows \u0095 Flowers and Fun Headline at Epcot's International Flower & Garden Festival \u0095 Chow Down in the U.S.' Best Restaurant Cities \u0095 Vegas' Vibrant Club Scene Showcases Exotic Nightclubs and Lounges \u0095 Shop Around to Save on Summer Car Rentals \u0095 San Francisco Wine Bar Woos With Sample Flights \u0095 Little-Known Promo Opens the 'Back Door' to Elite FF Status\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\nMay 5: It's party time at Cinco de Mayo celebrations all over the U.S. Coming Soon: Charleston (SC), May 25\u0096June 10: Spoleto Festival USA Las Vegas (NV), May 31: The Epicurean Affair at the Flamingo includes tastings from over 100 restaurants served up in unique environments. Los Angeles (CA), May 26\u009628: UCLA Jazz Reggae Festival Mystic Seaport (CT), May 26\u009628: Lobster Days New York City, May 25\u009627: Lower East Side Festival of the Arts Sacramento (CA), May 19: West Coast Brew Fest features unlimited tastings for over 100 microbrew beers.San Diego (CA), May 20: Sicilian Festival San Francisco (CA), May 16\u009627: San Francisco International Arts Festival; May 20: Bay to Breakers Foot Race Santa Maria (CA), May 18\u009620: Motorcycle Madness Saratoga Springs (NY), May 26\u009627: Saratoga Festival and Dressage, one of the top equine events in the U.S. Seattle (WA), May 25\u009628: Northwest Folklife Festival Stowe (VT), May 26\u009627: Vermont Chocolate Show International Events: France Cannes, May 16\u009627: Cannes Film Festival Monaco, May 24\u009630: Formula One Monaco Grand Prix\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Want the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\n\nFind the best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\n\n\nFlights | \nPrivacy Policy | \nContact us\n\n\n\n\nWould you like to \nUnsubscribe? \n\n\n\nTerms and Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \ncompany selling the tickets.\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}