{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Google Alerts <googlealerts-noreply@google.com>", "subject": "Google Alert - bush", "body": "\nGoogle Blogs Alert for: bush\n\n\nBush hating or persecution? Or is he just plain despicable?\n\nBush also accuses the Democrats of larding them up with “pork.” That’s just as diversionary as Mr. Bush’s attempts to convince Americans that Congress is withholding money from the troops. The bills include roughly $20 billion in extra ...\n\n\nNorwegianity - http://www.norwegianity.com/\n\n\n\nBush in the Swill of Scandal\n\nBy Left Turn(Left Turn)\n\nThe dual themes of honesty and bipartisanship struck a chord with many voters and helped propel Bush to the White House in one of the nation's closest-ever elections. Americans re-elected him in 2004 after he characterized himself as ...\n\n\nJo Swift - http://joswift.blogspot.com/index.html\n\n\n\nOur Troops Are Bush’s Hostages\n\nBy mahabarbara@gmail.com (Barbara O'Brien)\n\nOr you can see it for what it really is: a hostage situation, in which a beleaguered President Bush, barricaded in the White House, is threatening dire consequences for innocent bystanders — the troops — if his demands aren’t met. ...\n\n\nThe Mahablog - http://www.mahablog.com\n\n\n\nReid: Bush in a State of Denial\n\nBy BarbinMD\n\nWhile this may not spur debate with the White House and the Republican faithful, it does lay out what the debate should be about; That this is Bush's war, Bush's failure, and that it is Bush's responsibility to work with Congress.\n\n\nDaily Kos - http://www.dailykos.com\n\n\n\nWorkPlace: Bush Poised to Veto Long Sought Labor Reform\n\nBy Joshua Holland, AlterNet\n\nFor years, companies have been keeping workers from exercising their legal rights to organize and exacerbating America's income and wealth inequality. A new bill could help reverse that trend, but does it stand a chance against Bush's ...\n\n\nAlterNet.org - http://www.alternet.org/\n\n\n This as-it-happens Google Alert is brought to you by Google.\n \nRemove this alert.\n  Create another alert.\nManage your alerts.\n\n"}