{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS News Early Show <cbsnews___early_show_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Hannah Storm: Counting Our Blessings", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n       May 9, \n      2007\n\n\nHi, everybody,\n\nIts a glorious spring day \n      here in New York City. We are \n      finally experiencing the warm weather we've all been \n      waiting for. And, while we had a great time today, we are counting our blessings for \n      the folks in other parts of the country who have been experiencing \n      severe weather conditions like the wildfires in Southern \n      California and the floods in \n      Missouri. \n      \n \nA \n      couple of days ago, I interviewed a \n      man and his daughter who had hidden in their basement during a tornado in \n      Kansas and the man told me how proud he was of his daughter \n      because she was not worried about  her own well-being but for that of a neighbor and her \n      young baby. After the storm destroyed their town, they managed to get \n      to their neighbor's house and \n      dig the woman and her little baby out of the rubble. And today, \n      the woman who was rescued was on our show and the thing that we \n      were all laughing at was that the baby was so cute and he kept on \n      grabbing the microphone.  \n \nAlso \n      today, you'll definitely want to check \n      out Sharyl Attkisson's exclusive \n      interview with Sen. Lindsey Graham. Sen. Graham journeyed with \n      Sen. John McCain to Baghdad a couple of weeks ago and what he kept \n      out of the public eye was that after Sen. McCain left,  he \n      stayed on and served in uniform \n      as Colonel Graham for eight days. Prior to his political career, Sen. \n      Graham served in the Air Force, and in the \n      Guard and Reserves for 25 years. Aside from lending a helping hand to our \n      troops, Sen. Graham learned a much more personal lesson. After spending \n      the day with Navy Commander Philip Murphy-Sweet, who helped build the \n      brand new Green Zone courthouse, Murphy-Sweet was killed the following day by an \n      IED. Murphy-Sweet leaves behind a wife and three young children. Sen. \n      Graham said “ (this was) just a random chance in life that I spent the \n      last day with him. He was killed within 24 hours of when I met him. And I \n      guess the story goes for me that nothing good in Iraq happens without a \n      sacrifice.”  This is an interview that you’ll definitely want to see. \n      \n \nOn a much lighter note, our \n      man about the house Danny Lipford was in Las Vegas checking \n      out some \n      really cool new products for your home and bath. The one I really \n      liked was the Sweep-Away Cabinet Vacuum. \n       You can store it under your sink and it acts as a central \n      vacuum. We would certainly get a lot of use out of it in my \n      house!\n \nFinally, I hope you guys are \n      enjoying \"CSI\" week on The Early \n      Show.  We’ve been having a great time hanging with the \n      stars of the shows and their guest \n      stars like former tennis great John McEnroe, who plays himself on tonight's \"CSI: NY.\" And Joey \n      Lawrence, whom most remember from his days on “Blossom” \n      and “Dancing with the Stars,” takes \n      on a different role as a serial killer and nemesis of Gary Sinise’s character. Lawrence is also starring on Broadway as Billy Flynn \n      in Chicago. Joey told me today that he had \n      to learn all his dialogue in \n      just 10 days! We’ll have more behind the scenes of \"CSI\" tomorrow on the show. \n      \n \nAlso \n      tomorrow, Tori Ritchie and I are back in the \n      kitchen at Williams-Sonoma where we’ll show you how to make a \n      Mother's Day brunch; financial guru Ray Martin tells us about how the \"working tax\" affects dual-income families and writer \n      Mitch Albom will reveal the person whose memories of mom will win them a \n      Royal Caribbean cruise.\n \nTake \n      Care,\n \n      \nHannah StormEarlyShow@cbs.com \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}