{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Alma Owens\" <neddrtrentfreemandoq@drtrentfreeman.com>", "subject": "Watch your body change with Anatrim", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\n\nAnatrim – The very up-to-date and most attracting flesh loss product available – As could be seen on CNN.\n\n\nCan you hold in your memory all the times when you told yourself you would do anything for being delivered from this quickly growing pounds of fat? Luckily, now no big sacrifice is demanded. With Anatrim, the ground-breaking weight-reducing mixture, you can get naturally health mode of life and become really slimmer. Just look at what people state!\n\n\n\n\"I hate to acknowledge it but I was an awful food addict. \n\n\nI greedily swallowed up all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis fatal passion passed away after I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I turned to the happiest person on the planet 29 pounds in 2.2 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nAmely S., San Diego\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nIt’s difficult to fancy how I hated being derided at school. \n\n\n\n\nI detested my plumpness and I abhorred myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horrible nightmare! The greatest respect to you, my friends.\"\n\n\n\n\n\nDave Klark, San Diego\n\n\n\n\n\n\"Do you know what? My marriage was saved thanks to Anatrim! I fell down into the circle, depression – more eating – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOnce my friend pointed to your web page and I ordered up Anatrim at once. \n\n\nThe final result was splendid, my appetite came to acceptable level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And the bedroom became cool also!\"\n\n\n\n\n\nCharley\n\n\n\n\n There are lots of thanks left by happy people taking Anatrim. Don’t you wanna join the tens of thousands of slim men and women and take this natural appetite reducing energy raising product now!\n\n\nDon’t lose your chance!\n\n\n\n\n"}