{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: The Farking News", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nPictures \n      Of Murdered ABC Journalists RemovedOn Friday, we mentioned \n      that two Iraqi ABC News journalists had been murdered in Baghdad. Along \n      with the news, we posted a picture of the two men that had been released \n      by ABC News. Late Friday evening, a producer informed us via email that \n      the picture had been pulled both from our post and from the story about \n      the murders on CBSNews.com. According to the email, the families of the \n      dead men had informed ABC News that they were receiving death threats, \n      presumably because it was now known that the men had worked for an \n      American media outlet. [+ Read More]\n\nFark's \n      Drew Curtis On How \"News\" Isn't News\"You want to know the ones I \n      really dislike? Jesus' face appears on something. I think we can safely \n      say that the vast majority of these sightings are not the result of the \n      interest of a higher power in baked goods or highway overpasses, but \n      instead are instigated by people looking for free advertising to sell \n      things on eBay. I once read an entire article about a couple of trees \n      falling into the shape of a cross in someone's backyard. Yeah, two trees \n      fell on each other and it made an X. Stop the presses, it must be \n      Jesus.\" [+ Read More]\n\nMixed \n      Signals from Media on MuslimsThere is a new Pew Research \n      Center poll of Muslims in America out today. What are the findings? Your \n      answer to that question depends on where you're reading about it. This is \n      one of those times in hyperpoliticized 21st century America when the less \n      catchy the headline, the more responsible the journalism. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nKatie \n      Couric On Last Night's 'Full Disclosure'\n \nIs \n      CBS News' Unpaid Internship Fair?\n \nMaking CBS News \n      Look More Like America\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}