{"category": "spam", "to_address": "<theorize@plg.uwaterloo.ca>", "from_address": "\"Sherrie Ortega\" <irnhulqujjns@alesundkunstskole.com>", "subject": "Work offer form company.", "body": "\n\n\n\n\n\n\n\nOur company is pleased to offer you the position of  the financial specialist\nCompany’s activity:\nOur company was established in 1995 and is  one of the leading companies in the field of consulting service and audit by  now.\nOur company invests our clients’ money in  the shares of various international companies.\nWe have branches in 3 countries, including  the most important ones in Western Europe (Great Britain, France, Finland).\nEvery employee of our company gets the work  he can perform at home.\nThat’s the main advantage of working at  our company.\nEvery year the number of our employees  increases throughout the world.\nWe take care of every employee of our  company and see to his or her carrier growth.\nOur  company's motto is friendly attitude and understanding.\nThe revenues of our company are steadily  growing, and, according to the growing revenues of the company, the wages of  every employee are growing too.\nVacant position of “financial consultant”:\nThe specialist is responsible for in-line  processing of the private remittances cash flow. We offer high income and carrier  growth depending on the profit performances.\nWhen you start working at our company you  will be able to earn 7000 euros a month + 5% from every amount of money you  process.\nWorking as a financial consultant you get: \n- Contract (based on favorable cooperation  terms)\n- Freedom in your work scheduling\n- Carrier growth and the growth of wages\n- Opportunity to combine it with your main  work\n- Opportunity to work at home if you have Internet\n- High wages of 7000 euros a month + 5% (later  on you can earn up to 30 000 a month).\nRequirements for the candidate:\n- Full  age \n- Proficiency in PC, Internet, E-mail on  the advanced user level\n- Capability to work 3 hours a day\n- Capability to schedule and organize his  or her work.\nYou can start your professional growth at  the company as a financial specialist. If you venture  to do it, you’ll get the perspective of quick carrier growth and long shillings.  Many employees of our company started their work as financial specialists.\n\n\nRemember that when you start working at  our company you become an important link and a part of our crew…\nThe company is always happy to make  advances to every employee.\nThe main rule is work.\nThe more you work at our company – the  sooner you will be noticed and promoted…\n\nTo get work at our company you should fill  in the form with your personal data.\nForm: www.tscfinance.biz \nAfter you fill in the form with your  personal data the operator of our company will contact you within 10 hours hereafter  by e-mail or the phone given in your form.\nAttention:\nBe careful when filling in the form.\n\nOur company is growing steadily and has a demand  of new employees every year. We are always happy to get knew specialists.\nCompany management\n\n\n"}