{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: A VmWare alternative", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nThanks for that. I did forget to mention that I tried to have the\ncdrom as the second drive from an iso, but I didn't try booting from\nit. I actually wanted to see first how a windows/dos boot floppy would do,\nthus the floppy boot, but I might bite the bullet, and try booting a\ndebian install iso directly. Also, my purpose in keeping wineyes\nrunning was to have access to the qemu monitor, though it sounds like\nyou're saying that won't be accessible, which is too bad. \n\nI may try it again, though it probably won't be soon. Thanks also for\nyour offer of answering additional questions, I may take you up on\nthat if I need to when I try this again.\n\nGreg\n\n\nOn Thu, Jun 21, 2007 at 01:25:26PM -0700, Zachary Kline wrote:\n> Hiya,\n>     I'll be glad to show you how I run Qemu under Windows.  I warn you that \n> Window-Eyes will be of no help whatsoever in reading the Qemu console \n> window.  In fact, I suggest either creating a custom set file for it and \n> using the Hotkeys option in the general menu to turn them off, or just \n> unloading WE entirely.  That, of course, isn't very convenient.  If you turn \n> off hotkeys in qemu alone you'll get response when alt+tab is pressed to get \n> you out of that window.  Anyway, here's what I do:\n> To start with, I haven't installed Qemu into c:\\program files.  I just did \n> C:\\qemu,, with the bios in the same place.  So to get that option I do -L ., \n> which like under Unix stands for current directory.\n> A sample command line is:\n> qemu -serial com3 -boot d -net tap,ifname=\"tap\" -net \n> nic,model=rtl8139 -soundhw ens1370 -hda debian.img -cdrom debian.iso -L .\n> This is what I used to get Debian installed, with the Dectalk express \n> connected to a USB-to-serial converter which acted as COM3 under Windows. \n> It will work as ttyS0 under Linux, of course.\n> The boot d option is just to specify booting from the ISO image.  I \n> personally haven't done much with floppy images or actual drives.\n> Once Qemu runs, you'll possibly get a Windows properties dialogue asking \n> about whichever COM port you used.  Just hit enter to close it and you'll be \n> in a Qemu console window.  Type the command to get speakup up and running, \n> in the case of a Debian install it would be:\n> speakup speakup_synth=dectlk speakup_ser=0\n> From that point, assuming you unloaded WE or created a set file properly, \n> things will just run as normal.  You can alt+tab out of the Qemu window at \n> any time.\n> Hope this helps some.\n> Thanks,\n> Zack.\n> PS: If not, please feel free to ask me anything you'd like.\n> \n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGeuQp7s9z/XlyUyARAh3DAJ9nyqurzSP5FEyZpmvagW1JN11bZwCfbcsF\nhUXeI0oUm/5xoGkrcoH2bNo=\n=qGLd\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}