{"category": "spam", "to_address": "<gnitpick@speedy.uwaterloo.ca>", "from_address": "\"Whitaker V. Tibbie\" <ufve@greenhorse.com>", "subject": "Management skills include being a strong team player, demonstrated product management skills and the ability to generate new product ideas.", "body": "\n\n\n\n\n\n\n\nSalary commensurate with experience and \nability.\nIn which States are you a registered \nPE?\nWhat is the earliest date you are \navailable?\nBachelors Degree in Computer Science or Electrical \nEngineering or equivalent experience.\nPlease describe what types of schemes and relays \nused?\nUsing a scale of 1- 10, where 10 is the most \ncompetent, rate you skills using AutoCAD and MS Office. comJobtitle: Substation \nEngineer-Substation Elect. Please describe your experience with microwave, fiber, \nand radio telecommunications for EMS systems. AutoCAD and Microsoft Project skills \nare a plus.\nCandidate will be responsible for guiding \narchitecture and design of new and existing software and hardware \nproducts.\nDescribe your experience with  substation \ncomponents such as, relays, circuit breakers, transformers, etc.\nComprehensive benefits package and paid relocation \navailable.\nThis position requires 4-6 yrs experience in \nutility substation design. Describe your experience in making presentations. Be \nfamiliar with condition assessments, trouble shooting, etc.\nShould have PE designation and be a US \ncitizen.\nFortune 50 multifaceted company , is seeking an \nElectrical Engineer with experience in the Power Industry. A minimum of 7 years \nexperience in design, installation, and maintenance of electrical power and control \nequipment is needed. This position also requires that the candidate have experience \nwith electrical control system design, upgrades and trouble shooting.\nThis is a three (3) month, possibly longer, \ncontract position. Work will involve all aspects of the project including design, \ndevelopment of specifications and BOMS, and construction documentation and print \ndevelopment.\nYou will develop concept designs, detailed designs, \nand the preparation of plans and specifications for proposed plant electrical \nmodifications and construction projects. What is the extent of your experience with \nTurbo Machinery control systems.\n"}