{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Steve Langasek  wrote: [...]\n> Further, it's up to *Debian* to decide what uses of the logo reflect badly\n> on it and consequently should be disallowed because we don't wish to be\n> associated with them.  Your above statement includes an implicit value\n> judgement about which sorts of activities Debian will or will not wish to be\n> associated with, which may not be at all representative of the views of the\n> project members at large.\n\nTwo things wrong with that:\n\nFirstly, much of this thread seems to be taken up by people saying that the\nproject can't disallow things which we don't think reflect badly on debian\nbut other people generally do.  Why is this different?\n\nSecondly, if any debian developers think sweatshop-sewn shirts of cotton\nsubsidised by one of the world's richest countries reflect well on the\nproject, then that would be very disappointing and not common views\namong the wider population.  When surveyed, people know that this is\nwhat they should do - for example, 8 out of 10 people say retailers\nshould stock more products which help people in developing countries\nimprove their standard of living (Shopping with Attitude survey, 2006)\n- although they're deterred by the high prices at present.  But official\ndebian shirts are a premium product and ethical sourcing shouldn't make\nas big a difference, proportionately.\n\nAlso, few of the recent value judgements about licensing have been\npassed before the project members at large, even when there has been an\nobjection, so why should this one, if there's no objection?\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}