{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Let The Ashcroft Soar", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nAshcroft \n      Rising From the Ashes?In late 2006, I sat in Court TV's \n      green room in Washington D.C., waiting to dispense my quote-unquote wisdom \n      to the nation. Across the small-ish room from me sat John Ashcroft, \n      chilling with a newspaper and a glass of water. Green rooms are famous gab \n      centers, with hopped-up TV guests networking and swapping gossip, but not \n      this time. [+ Read More]\n\nTwo \n      Hospitals, Two Strategies For Handling \"60 Minutes\"On \n      Sunday, \"60 Minutes\" aired a segment called \"Dumped On Skid Row,\" about \n      the practice of hospitals depositing homeless people with severe problems \n      on the streets of Los Angeles. Unsurprisingly, the two hospitals \n      spotlighted did not come off well. But while one, Kaiser Permanente, did \n      not make anyone available to \"60 Minutes\" to defend its conduct, the \n      other, Hollywood Presbyterian, agreed to have someone speak in front of \n      the camera. [+ Read More]\n\nMeet \n      The \"Press\"It's the invasion of the fake \n      journalists! Well, maybe not quite an invasion. But we've got two \n      interesting examples of non-journalists impersonating members of the \n      fourth estate today. The first comes, like so many fascinating things (and \n      Alex Trebek), from Canada. [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nO&A? \n      Out. POTUS? In.\n \nOmbudsmania!\n \nJohn \n      Edwards And The Case Of The \"Breck Girl\" Comment\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}