{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker PM, Tuesday, May 29, 2007", "body": "\n\n\nCNN.com - CNN Political Ticker\n\n\n\n\n\n\n\n\n\n\nFor the latest, breaking political news, check for updates\nthroughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker All politics, all the\ntime.\n\nToday on the Ticker \n\n\nObama unveils\nnew health care plan\n\nWASHINGTON (CNN) -- Illinois Sen.\nBarack Obama unveiled a new health care plan aimed at providing\naffordable health insurance for every American, by having the\ngovernment and businesses contribute to covering the costs,\nObama said in a speech in Iowa Tuesday.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/obama-unveils-new-health-care-plan.html\n\n***\n\nClinton calls for 'shared prosperity'\n\nWASHINGTON\n(CNN) -- New York Sen. Hillary Clinton outlined a broad\neconomic plan in a speech in New Hampshire on Tuesday aimed at\nstrengthening the middle class by calling for shared prosperity\nand more affordable health care and education.\n\nFull\nstory:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/clinton-calls-for-shared-prosperity.html\n\n***\n\nBush to lawmakers: Courage!\n\nATLANTA, Georgia\n(CNN) -- Senator Saxby Chambliss, R-Georgia, may not find his\nhome state the most comfortable place to be Tuesday. A week\nafter being booed at his own state party convention as he\ndefended the immigration deal, Chambliss was at President\nBush's side as he tried to sell the plan in his remarks at the\nFederal Law Enforcement Center in Brunswick, Georgia.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/bush-to-lawmakers-courage.html\n\n***\n\nIn\nthe Stanley Cup, a Roots sweater versus Anaheim chiles\n\nWASHINGTON (CNN) -- More than the Stanley Cup is at stake\nin this year's National Hockey League finals.\n\nCalifornia Governor Arnold Schwarzenegger and Canadian\nPremier of Ontario Dalton McGuinty placed a friendly bet on the\nfate of their two teams, the Anaheim Mighty Ducks and the\nOttawa Senators.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/in-stanley-cup-roots-sweater-versus.html\n\n***\n\nWhat would Romney do with the presidential salary?\n\nDOVER, New Hampshire (CNN) -- If elected president,\nformer Gov. Mitt Romney, the wealthiest of the presidential\ncandidates, said he would probably take the presidential\nsalary, but that he'd \"donate at least that amount or more to\ncharity.\"\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/what-would-romney-do-with-presidential.html\n\n***\n\nSome W.H. hopefuls skip reading key Iraq report\n\nWASHINGTON (CNN) -- A new biography's suggestion that Sen.\nHillary Rodham Clinton didn't personally read a key\nintelligence report before her 2002 vote to authorize war in\nIraq has raised eyebrows, but Clinton was not alone.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/clinton-other-senators-skipped-reading.html\n\n***\n\nRestaurant patron criticizes Romney over Mormon faith\n\nDOVER, New Hampshire (AP) -- Mitt Romney's visit to\nNew Hampshire started on a sour note Tuesday when a restaurant\npatron declared he would not vote for the Republican\npresidential contender because of his faith.\n\nFull\nstory:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/restaurant-patron-criticizes-romney.html\n\n***\n\nRomney talks immigration\n\nDOVER, New Hampshire\n(CNN) -- At a campaign stop Tuesday, former Massachusetts Gov.\nMitt Romney, who has been critical of the compromise on how to\naddress illegal immigration, addressed this hot button issue\nand noted that he opposes a round up of illegal immigrants.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/romney-talks-immigration.html\n\n***\n\nNew\npictures document Sen. Johnson's recovery\n\nWASHINGTON\n(CNN) -- Sen. Tim Johnson, D-South Dakota, posted new pictures\non his website Tuesday showing him working from home while\nrecovering from a debilitating brain hemorrhage he suffered in\nDecember.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/new-pictures-document-sen-johnsons.html\n\n***\n\nLos Angeles mayor to endorse Clinton's presidential bid\n\nNEW YORK (AP) -- Democrat Hillary Rodham Clinton has\nwon the endorsement of Los Angeles Mayor Antonio Villaraigosa,\na rising star in national Democratic politics and one of the\nnation's top Hispanic elected officials.\n\nFull story:\nhttp://www.cnn.com/POLITICS/blogs/politicalticker/2007/05/los-angeles-mayor-to-endorse-clintons.html\n\n\n\n\n\nFor the latest breaking political news click here.\nBookmark the CNN Political Ticker here.\nFor news tips, political nuggets, feedback and suggestions, please drop us a line at politicalticker@cnn.com\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}