{"category": "ham", "to_address": "\"Andrew Coopers\" <avcooper@flax9.uwaterloo.ca>", "from_address": "<newsdesk@broadcast.shareholder.com>", "subject": "SatCon Receives $750,000 Contract to Develop Advanced ''Predictive'' Controller", "body": "\n\n\n\n\n\n\n\n\nSatCon Receives $750,000 Contract to Develop Advanced ''Predictive'' Controller\n\nBOSTON, May 09, 2007 (BUSINESS WIRE) --  SatCon Technology Corporation(R) (Nasdaq CM: SATC), a developer and supplier of power management and system architecture solutions for the alternative energy and distributed power markets, today announced that it has been awarded a Phase II contract from the Air Force Research Laboratory (AFRL) to develop a \"Predictive Controller for Power Supply Prognostication.\" The total value of the contract is $750,000 with the work being accomplished over the next 18 months. The development and incorporation of this technology into SatCon's successful line of commercial grade inverters, used for fuel cell and photovoltaic applications, could provide an additional competitive advantage for the company. \"With the ever-increasing expansion of electrical solutions, there has been increased interest in being able to predict failure of electrical components and systems,\" said Dr. Leo Casey, SatCon's Chief Technology Officer. \"Performing prognostics within the system as it operates will help to predict the remaining useful life of its components and thus avoid system failures. This improves the safety of the system, but also reduces operational costs by eliminating what may be unnecessary scheduled maintenance and downtime. It can also be used to turn on redundant components to prevent catastrophic failure in live critical systems. Prognostics ability has significant benefits for such systems in aerospace applications prompting AFRL's decision to fund this work. It is also important for environments such as electric and hybrid-electric automobiles and large power generation plants such as solar and wind power farms where down time can have significant implications to the grid or the end users of the generated power.\" About SatCon Technology Corporation SatCon Technology Corporation is a developer and manufacturer of electronics and generators/motors for the Renewable Energy, Hybrid-Electric Vehicle, Grid Support, High Reliability Electronics and Advanced Power Technology markets. For further information, please visit the SatCon website at www.satcon.com. (SATC-G) Statements made in this document that are not historical facts or which apply prospectively are forward-looking statements that involve risks and uncertainties. These forward-looking statements are identified by the use of terms and phrases such as \"will,\" \"intends,\" \"believes,\" \"expects,\" \"plans,\" \"anticipates\" and similar expressions. Investors should not rely on forward looking statements because they are subject to a variety of risks and uncertainties and other factors that could cause actual results to differ materially from the Company's expectation. Additional information concerning risk factors is contained from time to time in the Company's SEC filings. The Company expressly disclaims any obligation to update the information contained in this release. SOURCE: SatCon Technology Corporation(R) SatCon Technology Corporation(R)\nDan Gladkowski, 617-897-2411\nVP, Administration\n\n\n\n\n\n\n\n\n\n\n You are subscribed to SatCon Technology Corporation Investor Relations'' e-mail alerts as \navcooper@speedy.uwaterloo.ca.\n\n To update your e-mail and alert preferences, please click here.\n To unsubscribe, please click here.\n\n SatCon Technology Corporation \n 27 Drydock Ave. 6th Floor, South Boston, MA 02127\n Service provided by Shareholder.com \n\n\n\n\n\n"}