{"category": "ham", "to_address": "\"Samuel Klein\" <meta.sj@gmail.com>,\n   \"Eben Eliason\" <eben.eliason@gmail.com>", "from_address": "Alan Kay <alan.kay@squeakland.org>", "subject": "[sugar] Doc now posted (was Re:  Spreadsheets/ Slideshows)", "body": "\n\nHi SJ --\nYes, you may certainly make the document public. I will try to add the\nremaining \"50 pages\" sometime in late June and early July, but\nI tried to make the existing 50 pages stand on its own. \nThe document is now linked from the etoys page in the wiki (Thanks to\nWalter for doing this):\nSee\n\nhttp://wiki.laptop.org/go/Etoys\nand\n\nhttp://www.laptop.org/OLPCEtoys.pdf\nP.S. I still think that what I've been advocating since early last\nyear -- an OLPC version of something like Etoys/Scratch/Logo that is\ndeeply integrated with OLPC media -- is a really good idea. There is\nnothing sacred about Etoys. It only has two main things going for it (a)\nit has been tested with many thousands of children around the world over\nthe last 10 years, and (b) its range of applications for children's\nauthoring using \"math and media\".\nThe weakness of Etoys is that it is primarily aimed at 4-5-6 graders (and\ndoes well with this age group). It has been used successfully in Japan\nwith 6 and 7 year olds despite the UI not being the best fit for them.\nAnd it has been used with older children as well (they need a few more\nfeatures from the underlying Squeak and a somewhat different UI -- some\nof which we are doing this summer).\nOTOH, the presentation facilities are pretty useful -- especially for\ndynamic presentations of actual work. I've been using them exclusively\nfor all my talks since about 1998.\nBut quite a bit could be done better on all fronts. For the OLPC XO,\nespecially wrt to integration both across and down (so that there is a\n\"Model T\" version of all the media in children's script, and\nall media objects can be mixed).\nSince Python was chosen as the underlying programmatic representation for\nthe XO, I tried to convince the Python community last year to take a shot\nat making an Etoys-like environment, but as far as I can tell there have\nbeen no takers. I think Ivan has some interest in this as well. So I\nagree with the nature of Eben's desires. \nThe key word is integration, and, as you well know, this is a lot harder\n- both in design and integration - to pull off gracefully than it it\nseems at first glance. I would be very happy to see an environment that\nis as comprehensive as (or more ideally, much better than) Etoys --\nespecially if it can be placed at a more fundamental level than as a\nseparate Activity. (That was actually my original hope for\nSugar.)\nCheers,\nAlan\n\nAt 12:24 PM 6/2/2007, Samuel Klein wrote:\nEben, this might be a great\nopportunity to spend some time with the\netoys team working out how you could realize what you have in mind\nwith existing tools.  As Alan notes, it is designed to do very\nmuch\nwhat you are writing about -- as well as  doing some excellent sugar\n&\n1200x900 emulation ;-)\nI'd like to spend a day this coming week working through Alan's\n50-of-100 notes, and the use cases you have in mind.  (Alan, can\nwe\nmake the document public?)\nAs for presentations and slides, Etoys remains for the time being\nour\nsupported method for importing .ppt -- Rebecca, have you tried this?\nWere you asking for something more specific?\nSJ\nps - That might also be a good opportunity to think about what a\ngeneric bundle looks like.\nOn 6/2/07, Alan Kay <alan.kay@squeakland.org> wrote:\nYou might want to check out what\nEtoys actually does and is. (Hint:\nit covers your desiderata beIow pretty well.)\nI suggest perusing the document that I made up for the OLPC\ncountries\nmeeting a few weeks ago. Nia Lewis will probably have a copy.\nCheers,\nAlan\nAt 07:50 AM 6/2/2007, Eben Eliason wrote:\n>Ever since this project began, I've had this idea in my head\nregarding\n>what a \"slideshow\" might mean on the OLPC machine. \nI'd really like to\n>see an activity called \"Collage\" which is something like a\nmodern\n>descendent of Hypercard.  It should take the idea of embedding\nmedia\n>further, of course allowing images, sounds, video and text, but\n>perhaps also supporting live logo turtles, live editable text\nboxes\n>and other interactive forms.  Ideally, there would be an\ninterface\n>which made it pluggable so that any activity could embed its\nformats\n>and provide hooks for interacting with it.\n>\n>Bringing it all together, it should support a basic logo-like\n>scripting language.  This could allow simple actions like\n\"next page\",\n>but could also be allowed to pull text from the live text boxes\nvia\n>some identifiers, animate the embedded objects, track some basic\nmouse\n>and keyboard events, and interact with hooks provided by the\nplugins.\n>\n>A child could create a single page, or a simple slideshow, but\nby\n>taking full advantage of the nature of the scripting which pulls\n>things together, they can create non-linear books, interactive\n>animations, science reports with embedded interactive\nexperiments,\n>games, and more.\n>\n>As fun as this would be for kids, I also see this as being a\nfantastic\n>format for teachers to create lesson plans in:  provide\nsome\n>instructions with text and images, embed a video about the\ntopic,\n>script up a little physics simulation that the kids can\nexperiment\n>with, embed an abiword table widget which automatically records\nthe\n>results of the experiment, and place some questions with textboxes\nat\n>the end so the kids can answer them and then turn in their\n\"lab.\"\n>Heck, you could even automatically check the answers when they\nare\n>done, or interactively assist them when they answer incorrectly,\n>nudging them along or referencing the results table again.\n>\n>- Eben\n>\n>\n>On 6/2/07, Rebecca Gettys <rebecca.gettys@comcast.net>\nwrote:\n> > Hi All,\n> > I think that sideshows CAN be very sueful in the class room,\nand they\n> > have actually taught be to pay attention to detail. You need\nnotes to do\n> > anything really, and they do have their applications with\nother\n> > students. Just a thought.\n> > ~Rebecca\n> > _______________________________________________\n> > Devel mailing list\n> > Devel@lists.laptop.org\n> >\n\nhttp://lists.laptop.org/listinfo/devel\n> >\n>_______________________________________________\n>Sugar mailing list\n>Sugar@lists.laptop.org\n>\nhttp://lists.laptop.org/listinfo/sugar\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\n\nhttp://lists.laptop.org/listinfo/sugar\n\n\n"}