{"category": "spam", "to_address": null, "from_address": "\"Surf Lottery Organisation\" <walter@surflottery.gov.org>", "subject": "Attn Lucky Winner..", "body": "\n\n\nFROM THE DESK OF THE DIRECTOR PRIZE AWARD DEPT\nRef Number: PW 9590 ES 9414\nBatch Number: 573881545-NL/2005\nTicket Number: PP 3502 /8707-01\nAmount Won: $2,500,000.00.\n\nAttn Lucky Winner,\n\nWINNING NOTIFICATION FOR CATEGORY \"A\" WINNER ONLY\n\nWe are pleased to inform you of the result of the last final annual\ndraw of our Lottery International Programs.\n\nThe online cyber lotto draws was conducted from an exclusive list of\n25,000,000 e-mail addresses of individual and corporate bodies picked\nbyan advanced automated random computer search from the internet. No\nticketswere sold.\n\nCONGRATULATIONS!!!\n\nAfter this automated computer ballot, your e-mail address emerged as a\nwinner in the category \"A\" with the following numbers attached Ref\nNumber: PW 9590 ES 9414,Batch Number: 73881545-NL/2006 and Ticket Number: PP\n3502/8707-01 You are therefore to receive a cash prize of $2,500,000.00.\n(Two Million Five Hundred Thousand United States Dollars) from the total\npayout CONGRATULATIONS!!!. Your prize award has been insured with your e-mail\naddress and will be transferred to you upon meeting our requirements,\nstatutory obligations, verifications, validations and satisfactory\nreport.\n\nTo file in for the processing of your prize winnings, you are advised\nto contact our Certified and Accredited claims agent for category \"A\"\nwinners with the information below:\n*************************************\nMr. Jacob Viz.\nE-Mail: viz.agent@yahoo.de\nTel:+31 616 937 546\nFax:+31 84 731 5655\n*************************************\nYou are advice to provide him with the following\ninformation:\nNames:\nTelephone/Fax number:\nNationality:\nAge:\n\nNOTE: All winnings must be claimed not later than 14 days, thereafter\nunclaimed funds would be included in the next stake. Remember to quote\nyour reference information in all correspondence.\n\nYou are to keep all lotto information confidential, especially your\nreference and ticket numbers. (This is important as a case of double\nclaims will not be entertained).Members of the affiliate agencies are\nautomatically not allowed to participate in this program.\nFurthermore, should there be any change of address do inform our agent\nas\nsoon as possible.\n\nCongratulations once more from our members of staff and thank you for\nbeing part of our promotional program.\n\nYours Faithfully,\nWalter Jones.\nLottery Coordinator.\n\n"}