{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Lifestyle Newsletter June 14, 2007", "body": "June 14, 2007 \nRSS | lifestyle\nThis Week's Highlights:\nHow Organic Food WorksHow Minor League Baseball Works\nHow Tabloids WorkHow Swearing Works\nHow Karate Works This Month in History: June\n - Historical events in June include the first recorded lunar eclipse in North \nAmerica, Amelia Earhart's transatlantic flight, the debut of the \"Garfield\" \ncomic strip and the Watergate break-in. Learn more historical June trivia.   This week's trivia question:What famous Kurt Vonnegut book was subject to a Supreme Court obscenity case?  \nClick here    \n \nHow Organic Food Works\n - Organic farming was among the fastest growing segments of U.S. agriculture during the 1990s. The value of retail sales of organic food was estimated to be more than $20 billion in 2005. For many people, buying organic food is a way of eating healthy and supporting humane treatment of livestock. Find out the difference between organic and conventional farming, why organic food is more expensive and why organic food is important.     \nThis week's video:How Karate Works\n - Karate is an incredible art form, built on the concept of merging body and mind into a defensive tool. In this video from HowStuffWorks, watch how karatekas use their incredible skill to break wood and cinder blocks with their hands and feet. \n     Also at HowStuffWorks:\n \nHow Minor League Baseball Works\n- Spring is quickly fading into summer, which means baseball season is\nhere. But it's not just the big leaguers out there plying their trade.\nEvery summer thousands of young men take the field for minor league\nbaseball teams around the country, hoping to one day make it to the Big\nShow. In this article, learn how minor league baseball works as we take\na look at the Triple-A Durham Bulls.  \nHow Tabloids Work - From celebrity scandals to the truly bizarre, tabloid newspapers seem to cover stories that are outside the realm of serious journalism. Sometimes it seems like the stories are completely made up. Find out where tabloids get their stories, how tabloids evolved and what effect their popularity has had on newspapers and television shows. \n \nHow Swearing Works - We all know what \"bad words\" are. Unlike most other language rules, we learn about swearwords and how to use them without any real study or classroom instruction. Even very young children know which words are naughty. In this article, learn what makes some words bad, why people use swear words and how the brain affects swearing. \n \n   Coming Soon:How Surfing Works\nThis Month in History- July   \n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please unsubscribe here\n or change your preferences using our profile manager.To view this email as a web page, click here.\nHowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}