{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter May 14, 2007", "body": "\nhowstuffworksÂ® | science & technology May 14, 2007\nRSS\n  \n How Dreams Work\n  \nOur dreams combine verbal, visual and emotional stimuli into a sometimes broken, nonsensical but often entertaining story line. Many theories have been created to explain dreams, but they still represent a fascinating, mystifying subject to most people. Learn about dreams, theories of dreams and the meanings of common dreams.\n \nAlso at HowStuffWorks\n \n\nHow DNA Works - DNA is one of the building blocks of life, found in every\none of our cells and dictating what they become. Find out about the discovery\nof DNA, its structure, how it mutates and more.\n \n\nHow Sharks Work - Sharks are some of the most fearsome creatures on Earth.\nTheyâ\\u20ac™re also some of the oldest -- older even than the dinosaurs. In this\narticle, learn about the world of sharks, the oceanâ\\u20ac™s greatest hunters.\n \n\nAre there more floods now than there used to be? - Doesnâ\\u20ac™t it seem like flooding is a major problem these days?\nAlmost every rainy season we see images of cars submerged in water and people\nrowing through towns in small boats. Find out if there really has been an\nincrease in floods.\n   \nThis Week's Video\n How GPS Works - The Global Positioning System (GPS) lets you track your position with amazing accuracy almost anywhere in the world. It may be the most important innovation in navigation since the compass.  In this \nvideo from HowStuffWorks,\ndiscover how GPS works.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. Â© 2007, HowStuffWorks, Inc. All Rights Reserved"}