{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "945a 6/11 Update: Astros gear up for spacewalk", "body": "\n\n\n\n\n945a 6/11 Update: Astros gear up for spacewalk\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 38\nPosted: 9:17 AM, 6/11/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-34 (06/10/07): Atlantis docks with space station\n   SR-35 (06/10/07): Hatches open; shuttle crew welcomed aboard\n   SR-36 (06/10/07): Flight director thrilled with smooth rendezvous; pitch maneuver finds no obvious signs of damage to shuttle's heat shield\n   SR-37 (06/10/07): Shannon leaning toward spacewalk repair of protruding blanket\n   SR-38 (06/11/07): Astronauts gear up for spacewalk, solar array install\n\n=================================\n\n9:17 AM, 6/11/07, Update: Astronauts gear up for spacewalk, solar array install\n\nThe Atlantis astronauts are gearing up to attach a 36,000-pound solar array truss segment to the international space station today. Once the stowed arrays are in place, astronauts Jim Reilly and Danny Olivas plan to stage a six-and-a-half-hour spacewalk to make critical electrical connections and remove a variety of launch locks and restraints to prepare the new solar blankets for extension Tuesday.\n\nReilly and Olivas spent the night sealed up in the space station's Quest airlock module as part of a new \"camp out\" procedure. The airlock's pressure was lowered from 14.2 pounds per square inch to 10.2 psi to help the spacewalkers purge nitrogen from their blood and prevent the bends when working in their 5-psi spacesuits.\n\n\"Flight day four is really the big day where station is going to take on a new look,\" said Kelly Beck, lead space station flight director. \"When the crew wakes up on flight day four, they're going to begin their robotics and EVA preparation activities. The airlock will be repressurized, that'll allow JR and Danny to get out, do their morning routine, grab some breakfast, go back inside and then they'll be assisted ... to get them suited up. In the meantime, while they're getting ready for their spacewalk, Bru (shuttle pilot Lee Archambault) and Suni (station astronaut Sunita Williams) will be performing their robotic operations to install the truss.\"\n\nThe $367 million S3/S4 truss segment was pulled out of Atlantis' cargo bay shortly after docking Sunday and \"parked\" overnight on the end of the space station's arm. This morning, working inside the Destiny laboratory module, Archambault and Williams will use the Canadian arm to move S3/S4 up to the right end of the station's main power truss, a segment known as S1 (an originally planned S2 segment is no longer in the station architecture).\n\n\"On the morning of flight day 4 we’re going to start our space station robotic arm operations by performing an automated maneuver, takes about 40 or so minutes, to put it in a pre-install position which is approximately a meter and a half from the S1 truss,\" Archambault said. \"In between that meter and a half and actually installing it, we’re going to pause for a few moments at around 45 centimeters, to allow our Space Vision System to go ahead and give me a an updated depiction of my exact position with respect to the S1 truss, and be able to install this thing within a one or two centimeter tolerance.\"\n\nThe Space Vision System uses television cameras and powerful software to measure the precise locations of large black dots attached to the truss elements. The SVS software computes the relative positions of the dots to give the arm operator very precise distance and orientation information. Temperature effects can cause distortions of up to five inches and misalignments of 1 to 2 degrees. The SVS helps compensate for any such effects.\n\nOnce S1 and S3 are in close proximity, a large claw on the S1 truss will rotate around a capture bar on the S3 segment to pull the two together. Four motorized bolts on S1 then will drive into attachment fittings on S3, firmly locking the two truss elements together.\n\nAt that point, Reilly and Olivas, now suited up in the Quest airlock, will float out into space and begin the first of two critical spacewalks to hook up and activate S3/S4.\n\nFor identification, Reilly's call sign is EV-1 and his suit features red stripes around the legs. Olivas is EV-2 and his suit has no markings. Here is an updated timeline of today's activities (in EDT and mission elapsed time):\n\n------------------\n\nAbbreviations:\nEV1: Jim Reilly\nEV2: Danny Olivas\nSSRMS: Space station remote manipulator system robot arm\nS1: Current right side solar array truss segment\nS3: New right side truss segment with rotary joint\nS4: New solar arrays (panels 1A and 3A)\nMDM: Multiplexer-demultiplexer computer\nSABB: Solar array blanket box\nSABGA: Solar array beta gimbal assembly (changes pitch of solar array panel)\nSARJ: Solar alpha rotary joint (rotates outboard solar arrays)\nDLA: Drive lock assembly (SARJ drive motor)\nAJIS struts: Alpha joint interface structure (internal braces)\n\n------------------\n\nDAY/EDT........DD...HH...MM...EVENT\n\nMon 09:08 AM...02...13...30...STS crew wakeup\nMon 09:38 AM...02...14...00...EV1/EV2 wakeup\nMon 10:00 AM...02...14...22...NASA Video File on NTV\nMon 10:13 AM...02...14...35...MCC: S3 activation begins\nMon 10:18 AM...02...14...40...EVA-1: 14.7 psi airlock repress\nMon 10:33 AM...02...14...55...EVA-1: Hygiene break\nMon 11:08 AM...02...15...30...EVA-1: Crew airlock depress to 10.2 psi\nMon 11:08 AM...02...15...30...Station robot arm (SSRMS) S3/S4 install\nMon 11:48 AM...02...16...10...EVA-1: Campout EVA preps\nMon 12:53 PM...02...17...15...S3/S4 maneuver to ready to latch position\nMon 01:18 PM...02...17...40...EVA-1: Spacesuit purge\nMon 01:33 PM...02...17...55...EVA-1: Spacesuit prebreathe\nMon 01:43 PM...02...18...05...S3 truss bolted to S1 truss\nMon 02:23 PM...02...18...45...SSRMS ungrapples S3/S4\nMon 02:23 PM...02...18...45...EVA-1: Crew airlock depressurization\nMon 02:38 PM...02...19...00...SSRMS moves to park position for EVA-1\nMon 02:58 PM...02...19...20...EVA-1: Airlock egress\nMon 03:18 PM...02...19...40...SSRMS support\nMon 03:18 PM...02...19...40...EVA-1: EV1: Connect S1-S3 nadir utilities\nMon 03:38 PM...02...20...00...EVA-1: EV2: Release aft-fwd solar array blanket box restraints\nMon 03:48 PM...02...20...10...EVA-1: EV1: S3 MDM shroud removal\nMon 04:13 PM...02...20...35...ISS: Sokol suit pressure checks\nMon 04:23 PM...02...20...45...EVA-1: EV1: Connect S1-S3 zenith utilities\nMon 04:53 PM...02...21...15...EVA-1: EV1: Keel pin rotate\nMon 05:23 PM...02...21...45...EVA-1: EV1: Release 1A-3A SABGA restraint\nMon 05:38 PM...02...22...00...EVA-1: EV2: Release radiator restraints\nMon 06:03 PM...02...22...25...EVA-1: EV1: Unstow forward SABB\nMon 06:08 PM...02...22...30...EVA-1: EV2: Unstow aft SABB\nMon 06:23 PM...02...22...45...EVA-1: EV1: Install SARJ DLA 2\nMon 06:28 PM...02...22...50...EVA-1: EV2: Remove MLI insulation\nMon 06:58 PM...02...23...20...EVA-1: EV2: Rigidize AJIS struts (4)\nMon 07:23 PM...02...23...45...EVA-1: EV1: Remove SARJ launch locks\nMon 07:23 PM...02...23...45...Photo-voltaic radiator deploy\nMon 07:38 PM...03...00...00...EVA-1: EV2: Remove SARJ launch locks\nMon 08:38 PM...03...01...00...EVA-1: Cleanup and ingress\nMon 09:23 PM...03...01...45...EVA-1: Airlock repressurization\nMon 09:38 PM...03...02...00...Spacesuit servicing\nMon 11:00 PM...03...03...22...Mission status briefing on NTV\n\n06/12/07\nTue 01:08 AM...03...05...30...ISS crew sleep begins\nTue 01:08 AM...03...05...30...STS crew sleep begins\nTue 02:00 AM...03...06...22...Daily video highlights reel on NTV\nTue 04:23 AM...03...08...45...MCC: S4-1A solar array mast deploy (1 bay)\nTue 07:33 AM...03...11...55...MCC: S4-3A solar array mast deploy (1 bay)\nTue 06:30 AM...03...10...52...Flight director update on NTV\n\nThe S3 truss segment features the right-side solar alpha rotary joint, or SARJ, which is equipped with two redundant motors that drive a large gear to slowly spin the outboard solar arrays so they can stay roughly face on to the sun as the station flies through each 90 minute orbit. Power from the arrays, along with data and computer commands, passes through the center of the SARJ without regard to orientation.\n\nBefore the SARJ can be activated, both motors, called drive lock assemblies, must be manually engaged and then precisely positioned by flight controllers to ensure the drive teeth mesh properly with the main gear. Braces must be positioned, launch locks and thermal shrouds removed, along with a keel pin used to help mount the S3/S4 truss segments in the shuttle's cargo bay. Work to rig the SARJ for operation will be spread over two spacewalks.\n\nThe S4 segment features two solar array wings folded into shallow \"blanket boxes\" for launch. The mast canisters and blanket boxes must be deployed and restraints removed before the arrays can be deployed Tuesday, stretching some 240 feet from tip to tip. The blankets are extended by a self-erecting central masts made up of 31 \"bays,\" each one measuring about 40 inches deep. Boeing is the prime contractor for the S3/S4 truss segment while Lockheed Martin built the included SAWS.\n\n\"First thing that they'll be doing is mate the umbilical connections to provide power and commands to the components on the truss and also receive data from those components,\" Beck said. \"The next thing they'll be doing is preparing the solar arrays for deploy. They'll first release the restraints so that the mast canisters, the circular canisters that house the masts, the central structural member, they'll deploy those into position and then they'll release the restraints on the boxes containing the solar array blankets and they'll swing those out into position in preparation for deploy the following day.\n\n\"The crew will also release the restraints on the radiator so it can be deployed later on in the EVA,\" she said. \"They will start the preparation tasks for the solar alpha rotary joint. They'll be repositioning four struts that provide additional structural integrity to maintain, to take the on orbit loads. They'll also be positioning one of the drive lock assemblies, this is the mechanism that rotates the joint and also locks the joint when it becomes operational. And they'll start to remove the launch locks. So they'll get a good head start getting the SARJ prepped for its operational state.\"\n\nReilly will exit the Quest airlock module first, making his way across a spur to the S0 truss atop the Destiny module and from there out to the S1 segment where he will hook up two 85-foot-long safety tethers. At that point, Olivas will venture outside.\n\n\"Now the way it works out in our EVA is that Jim Reilly kind of has all the real estate on the front side of the truss segment, and I have all the real estate on the back side,\" Olivas said. \"One of the first things that happens after the installation has occurred, we have to basically start putting keep-alive power to all the subsystems on S3/S4.\"\n\nReilly will make the electrical connections between S1 and S3, hooking up six cables near the upper part of the S1/S3 interface and seven in a lower utility tray.\n\n\"While Jim Reilly takes care of that, my primary responsibility will be to start to get the solar array blanket boxes in from their stowed configuration, get them ready for the deployed configuration. We have a variety of restraints on those boxes that we'll have to pop off and get them ready. I'll do that for both the front side and the back side, the 1A and the 3A side.\n\n\"After that's complete my next major task is to go down and reconfigure the photovoltaic radiator, which is just a giant radiator that radiates the heat being generated by the electrical power system on the S4 segment out to space. My job is to go down there on the bottom side of the truss, the nadir side of the truss. A variety of cinches and winches keep it in the compressed configuration. My job is to get those fully deployed, get them opened up, and get it configured so that it can be commanded into the deployed configuration.\"\n\nToward the end of the spacewalk, the astronauts inside the station will send commands to deploy the folding radiator needed to keep the S4 array's electronics cool during normal operation. The radiator measures 44 feet long and 12 feet wide.\n\nOvernight, flight controllers will send commands to deploy the new arrays one mast bay to help warm the blankets up. On Tuesday the astronauts will fully extend both panels.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}