{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Voice of America - Cancer Rates Rising in Africa", "body": "http://www.allamericanpatriots.com/48723347_world_cancer_rates_rising_africa\n\nCancer Rates Rising in Africa\n\nVoice of America News\nWed, 05/16/2007\n\n15 May 2007 -- Another African epidemic is taking the spotlight, cancer.\nExperts say aging and infectious diseases are increasing Africa's cancer\nburden. A new non-governmental group is trying to raise global awareness\nof the problem and held a meeting recently in London that brought\ntogether African health ministers and other interested participants.\n\n[snip]\n\n\"Unless we start taking action now to make a difference, then the\nexisting health infrastructure in Africa is going to be overwhelmed by\nthe coming increased cancer incidence coming down the road,\" said\nUniversity of Oxford cancer physician David Kerr. \"By 2020, it is\nprojected there will be 15 million new cases of cancer every year and 70\npercent of these will be in the developing world. In Africa by 2020, we\nexpect there to be more than 1 million new cases of cancer every year.\"\n\n[snip]\n\nDavid Kerr says cancer survival rates in poor countries are often less\nthan half those in industrial nations. In Africa, he says, cancer is a\nsentence to a painful and distressing death, because treatment and care\nare lacking.\n\nThat is why he has begun Oxford University's Africa-Oxford Cancer\nConsortium, called AfrOx, and organized a recent two-day international\nconference in London to raise global awareness about the issue. The\nmeeting included 23 African health ministers, leading African medics,\nworld-renowned cancer specialists, officials of the World Health\nOrganization and development banks, investment bankers, and the Gates\nFoundation.\n\nKerr says the conference issued a London Declaration.\n\n\"This sets out some very simple precepts that say that we, the global\ncancer alliance, the global community, must support African health\nministers to start preparing for cancer,\" he added.\n\nThe London Declaration set out a plan of action for African cancer care.\nIt calls for vaccination against tumor-related infections, early\ndiagnosis and screening, access to modern cancer treatment, and easing\nthe pain of dying, now often medicated only by aspirin instead of\nstronger painkillers.\n\n\"We do need to bring some additional resources to bear, but it need not\nbe a huge amount of money. Some of the curable childhood cancers can be\ntreated for $1 a day,\" he said. \"So although there are new cancers drugs\nthat are terribly expensive, we would start building the pyramid from\nthe bottom and we could use so-called generic drugs, which are available\ncheaply.\"\n\nKerr says the cancer conference declaration is being presented at the\nannual World Health Assembly of national health ministers now under way\nin Geneva and will be discussed at an African Union health ministers\nmeeting in August. He is hopeful that it will stimulate more global\nattention and financial support to fight cancer in Africa.\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}