{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "Put DHNA on your radar now", "body": "    To view this email as a web page, go    here.     \n\n\nThe Bull ReportJune 6th, 2007Since 2001, Gold and silver have more than doubled in value while the U.S.Dollar index has fallen approximately 23%. During the same time period, theDow Industrials have only risen approximately 16%. Many analysts believe\ngold remains in a rising bull market! That is why you should put DHNA on your radar now!Our featured stock (OTCBB: DHNA) has been rated \"Outperform\" with a  target price of $4.30 by Beacon Equity Research. Over the past few  weeks DHNA has been charting well with impressive volume. Dhanoa  Minerals Ltd. (OTCBB: DHNA) is one stock that is as good as gold!Dhanoa Minerals Ltd. (OTCBB: DHNA) is a newly incorporated natural  resource exploration company. It is acquiring, exploring and  developing existing and new natural resource properties thought to  \ncontain significant quantities of gold and other minerals. The  Company was incorporated in July 2005 and is headquartered in Nevada,The Company owns a 100% interest in two adjacent mineral projects in  Canada - Close-Allies I and Close Allies II.  In addition, Dhanoa  holds an 80% interest in an Ecuador mining company, Promenasa. The  Company also recently acquired four properties that are part of the  Bonanza Project in the Bellarica gold mining camp in Ecuador. These  are gold producing mines and Dhanoa plans to increase production by  upgrading extraction operations.\nDhanoa is targeting production in its first year (ending June 2008)  at approximately 100,000 ounces. At recent gold prices of  approximately $680 per ounce, the value of 2008 production may  approach $68 million.  In addition, the Company expects to double  production the following year to approximately 250,000 ounces worth  around $170 million at today's prices. Investments the Company is  making in upgrading its processing faclities are expected to result  in a 40% improvement in the production recovery rate from its  existing faciliies.Don't miss out on this golden opportunity!!\nA $63 trillion United States' fiscal gap. The fiscal gap measures the  difference between our government's projected future expenditures and  tax receipts; this means, according to some economists, that our  government is technically bankrupt. To help manage debt, the  government is required to print money which means rising inflation  (causing your savings to lose purchasing power). Precious metals such  as gold are one of the few safe-haven investments to protect against  inflation and unchecked government spending.World oil prices are rising. With OPEC's commitment to higher prices,  \nthe geopolitical uncertainty in the Middle East, and the very real  prospect that global oil supplies will diminish while current and  increased global demand from countries such as India and China will  grow, oil prices should increase significantly. Higher oil prices  drive gold prices higher as it spurs inflation throughout our economy.\nRead the full report\nRead the full disclaimer\n\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}