{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Senate passes energy bill, boosting mileage standards", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun 22, 200705:18 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nSenate passes energy bill, boosting mileage standards\n\n\n\n\n\nThe Senate passed an energy bill late Thursday that includes an increase in\nautomobile fuel economy, new laws against energy price-gouging and a\nrequirement for huge increases in the production of ethanol.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGuantanamo meeting canceled after report closure is near \n\n\n\n\n\nA White House meeting planned for Friday about the future of the Guantanamo\nBay detention facility has been canceled after The Associated Press reported\nthe Bush administration was \"nearing a decision\" to close the center.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nRescuers find body of man, 81, after flooding\n\n\n\n\n\nSearchers found the body of an 81-year-old man and were looking for as many as\nsix other people still missing Thursday after flash floods surged through the\nedge of the Catskill Mountains.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nPittsburgh moms charged after 5 children die in fire\n\n\n\n\n\nThe mothers of five children killed in a house fire surrendered to police\nThursday to face involuntary manslaughter charges for allegedly leaving the\nyoungsters alone while they went to a bar.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n911 calls show fire started near store's rear deck\n\n\n\n\n\nPassing motorists and a store worker frantically called authorities about a\nfire behind a furniture store the night nine firefighters perished inside,\naccording to 911 tapes and transcripts released Thursday. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSuspect in shooting, hostage taking surrenders\n\n\n\n\n\nA man suspected of shooting a sheriff's deputy and taking five hostages in a\nbank, surrendered late Thursday, authorities said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice: Texas man beaten to death by a few, not mob\n\n\n\n\n\nAbout three or four people -- not a mob of 20 -- beat a man to death after the\ncar he was riding in struck and injured a toddler, police said Thursday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nLebanon defense minister: Militants at camp crushed\n\n\n\n\n\nLebanon's defense minister declared victory Thursday over the Fatah Islam\nmilitant group, saying it had been crushed after a month-long military assault\non its stronghold in a northern refugee camp and only mopping up remained.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHamas denies it plans to kill Abbas\n\n\n\n\n\nHamas has denied Palestinian Authority President Mahmoud Abbas' accusation\nthat it is planning to assassinate him.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n12 U.S. troops killed in Iraq in 48 hours\n\n\n\n\n\nTwelve U.S. troops have been killed in attacks in expanded operations against\ninsurgents in Iraq during the past 48 hours, according to the U.S. military.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAussies 'repelled Iran gunboats'\n\n\n\n\n\nAustralian navy sailors used \"colorful language\" and aggressive tactics to\nrepel five Iranian gunboats in an incident prior to the capture of 15 British\nsailors in March, Australian defense officials said on Friday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nBears back in control\n\n\n\n\n\nStocks were poised to slide Friday as investors returned their focus to a\nbackup in Treasury yields.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBlackstone prices IPO at $31 a share\n\n\n\n\n\nBlackstone Group, one of the world's largest private equity investment firms,\nis set to begin trading Friday on the New York Stock Exchange.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nDr. Z: More coaching techniques, top five players ever\n\n\n\n\n\nThe bag this week encompassed such an embarrassment of riches that I am\nsingling out the one negative voice for E-mailer of the Week honors. And\nalthough I have no hand in choosing the headline for this drivel, uh, for this\ncolumn, may I humbly suggest the following: Gourmet Dining -- Humble Pie.\nBasically I am the type of person who tends to flog something to death, as all\nyou readers know, and so does The Flaming Redhead. When I'm just getting\nwarmed up on one of my favorite shpiels, I'll hear, sotto voce, \"eighth time.\"\nThis doesn't stop me, of course, but it does serve as a reminder that I'm\ntiptoeing into the senility pastures that beckon to those of older vintage.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJon Heyman: Does Sammy Sosa deserve my Hall of Fame vote?\n\n\n\n\n\nSammy Sosa is going to be a tough call for the Hall.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nQuirky discipline rules that work \n\n\n\n\n\nI've made a lot of bad rules in the decade I've been a mom, from irrational\nthreats (\"No graham crackers in the house ever again if you eat them in the\nliving room even one more time\") to forbidding human nature (\"You may not\nfight with your sister\"). But occasionally I've come up with rules that work\nbetter than I'd ever contemplated. These made-up rules have an internal logic\nthat defies easy categorization, but their clarity and enforceability make\nthem work. Several of them are not, technically, rules at all, but\ndeclarations of policy or fact. And they're all easy to remember. A few\npersonal favorites, plus those of other moms:\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGene therapy shows promise for Parkinson's \n\n\n\n\n\nAn experimental treatment for Parkinson's disease seemed to improve symptoms\n-- dramatically so, for one 59-year-old man -- without causing side effects in\nan early study of a dozen patients.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\n'Manhunt 2' banned for 'casual sadism'\n\n\n\n\n\nBritish censors Tuesday banned a video game for the first time in 10 years,\nrejecting U.S.-published \"Manhunt 2\" for what they described as an unrelenting\nfocus on sadism and brutal slaying.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe next step in self-checkout\n\n\n\n\n\nStephanie Cerneck doesn't go through the checkout line at her supermarket\nanymore. Or even the self-checkout line.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\n'Citizen Kane' tops greatest movies list\n\n\n\n\n\nThe years have been kind to \"Citizen Kane,\" including the last decade.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBon Jovi: New album not 'Bon Jovi does country'\n\n\n\n\n\nThey still look like the Bon Jovi of old -- their leather jackets and jeans.\nAnd they still act like the boys from New Jersey, proud of their musical\nbrotherhood that spawned numerous hit albums and No. 1 singles.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}