{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>", "from_address": "\"Jeffrey Aresty\" <jaresty@cyberspaceattorney.com>", "subject": "[cc-community] Building Trust Online", "body": "One of your list members, Ayo Kusamotu, from Lagos, Nigeria introduced\nme to your listserv.  My name is Jeff Aresty, and I am a lawyer from\nMassachusetts, and one of the founders of the virtual bar association,\nInternetbar.org.  We are multidisciplinary and our mission is to open\npaths to online justice, both economic and procedural.  Clearly, the\nwork of creative commons has great potential to do both.\n\nThrough May 15, 2007, we are registering young people (undergraduates,\ngraduates, and those within 5 years of their degree) to enter a contest\nwhere the prize is to be the Reporter of the 6th International\nConference on Online Dispute Resolution, to be held in Hong Kong the\nfirst week of December, 2007, all expenses paid.  The contest is\ndesigned to organize a community that will explore how we build trust\nonline.  The contest url is www.internetbarcontest.org.   It is free to\nregister, and participate. Even if you are not eligible for the prize,\nyou can still join the community as a facilitator.  The contest runs in\ntwo stages through the end of June, and then fifteen people will be\nselected to write papers over the summer.  One will win the grand prize,\nand the top five papers will be published as part of the Conference\nproceedings.  \n\nThank you.\n\nJeff Aresty  \n\n-----Original Message-----\nFrom: cc-community-bounces@lists.ibiblio.org\n[mailto:cc-community-bounces@lists.ibiblio.org] On Behalf Of\np.hatzopoulos-alumni@lse.ac.uk\nSent: Saturday, May 12, 2007 2:38 AM\nTo: cc-community@lists.ibiblio.org\nSubject: [cc-community] Wiki politics 2\n\nNew online journal Re-public < www.republic.gr/en\n >  has just published the second part of its\nspecial issue \"Wiki politics\". The issue explores how the use of new\ncollaborative tools (wikis, blogs, forums, mailing lists, podcasting,\nand videos) can transform the ways politics are practiced . Articles\ninclude:  \n\n \n\nWard Cunningham - Wiki and the rise of gift economies   <\nhttp://www.re-public.gr/en/?p=141  >\n\nCreator of wiki software, Ward Cunningham, argues that the proliferation\nof wikis has proved that the for-pay economy is not the only way to\ncreate value. \n\n  _____  \n\nPete Ashdown -Open source politics  < http://www.re-public.gr/en/?p=145\n >\nBeing the first politician to to use a wiki to develop his campaign\nplatform for the 2006 US Senate election in Utah, Pete Ashdown makes the\ncase for open source politics. \n  _____  \n\nPaul Hartzog - Panarchy and the wiki-fication of politics  <\nhttp://www.re-public.gr/en/?p=148  > \nHartzog introduces the concept of panarchy, a sociopolitical field that\nemerges when connective technologies enable cooperative peer-to-peer\nproduction - of knowledge, of tools, of power. \n  _____  \n\nAustralian bill of rights initiative: Collaborating on public policy <\nhttp://www.re-public.gr/en/?p=142  >\nWiki politics are put into practice. This article focuses on the\ndevelopment and the rationale behind ARBI  , an\nonline project aimed at promoting awareness and discussion of human\nrights through the collaborative development of a bill of rights for\nAustralia. \n\n  _____  \n\nAll articles of Re-public are published with a Creative Commons license\nand can be re-printed freely, by acknowledging their source. \n\n\t\n\n\nPlease access the attached hyperlink for an important electronic\ncommunications disclaimer:\nhttp://www.lse.ac.uk/collections/secretariat/legal/disclaimer.htm\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}