{"category": "spam", "to_address": "cruiseca@speedy.uwaterloo.ca", "from_address": "Your Check <NewsLetter@dollardbox.com>", "subject": "Your check is ready", "body": "Your check is ready.* \n  \nTo arrange for delivery of your check.* \nPlease visit:\nhttp://dollardbox.com/solim?m=74393&l=0 \n \n \n \n \nFor more information visit us at :\nhttp://dollardbox.com/solim?m=74393&l=0 \n \n \n \n \n \n \n \n \n \n \n \nReal people have received thousands in cash. This is a real\nopportunity to get cash. Just visit\nhttp://dollardbox.com/solim?m=74393&l=0and\nparticipate in our awards program. There is not any cost or purchase\nnecessary. Just visit\nhttp://dollardbox.com/solim?m=74393&l=0 and\nview some free offers from our sponsors. You can exit at any time\nwithout obligation. Once you have followed the simple instructions on\neach page you will be registered to get a real check that you can take\nto the bank. Your cash is guaranteed as long as you follow the\ndirections. You do not need to purchase anything and no credit card\nis required. Yes, this is real and you will get cash by following and\ncompleting the directions. \n \n \n  \nThis is your chance to get real cash and it won't cost you anything\nother than a few minutes.* \nVisit us today and get your cash:\nhttp://dollardbox.com/solim?m=74393&l=0 \n \n \n \n \n \n \n \n \n \n \n \n*Receipt of the Free Cash and More  requires completion of offers\naccording to terms and conditions, including: age and residency\nrequirements, registration with a valid email address, completion of\nall required advertiser offers from each level (Silver, Gold and\nPlatinum)  and shipping address verification. Subject to terms and\nconditions. See site for details. To stop future contact go to:\nwww.am321.com/optout.aspx?siteid=fcm Or this way - 7378 W Atlantic\nBlvd - Margate FL 33063-4214 \nYou are receiving this solicitation because you previously agreed to\nreceive\ncorrespondence from us our partners.  If this service should fail to\nmeet with your expectations, feel free to disassociate yourself from\nour service.\nhttp://dollardbox.com/unsub.php?e=cruiseca@speedy.uwaterloo.ca&m=74393\nShould you wish to contact us via the US Postal service, our address\nis: \nCustomer Service, 119 Rockland Center, Suite 365, Nanuet, NY 10954\n\n<1;88czhRb8L9RMbbQ.7z6LsbcOtt78L;74393>\n\n"}