{"category": "ham", "to_address": "submit@bugs.debian.org", "from_address": "\"Steve King\" <debian@invux.com>", "subject": "Re: Bug#431883: dcraw license does not give permission to \n     distribute modified versions or source alongside", "body": "> Package: dcraw\n> Version: 7.02-1\n> Severity: serious\n>\n> On Thu, 05 Jul 2007, Steve King wrote:\n>> However I would appreciate it if the assembled masses of legal\n>> experts could confirm that they agree that this is the case.\n>\n> There's actually an even more fundamental problem with dcraw.c:\n>\n> /*\n>    dcraw.c -- Dave Coffin's raw photo decoder\n>    Copyright 1997-2007 by Dave Coffin, dcoffin a cybercom o net\n>\n>    This is a command-line ANSI C program to convert raw photos from\n>    any digital camera on any computer running any operating system.\n>\n>    No license is required to download and use dcraw.c.  However,\n>    to lawfully redistribute this code, you must either (a) include\n>    full source code* for all executable files containing RESTRICTED\n>    functions, (b) remove all RESTRICTED functions, re-implement them,\n>    or copy them from an earlier, unrestricted Revision of dcraw.c,\n>    or (c) purchase a license from the author.\n>\n>    The functions that process Foveon images have been RESTRICTED\n>    since Revision 1.237.  All other code remains free for all uses.\n>\n>    *If you have not modified dcraw.c in any way, a link to my\n>    homepage qualifies as \"full source code\".\n>\n>    $Revision: 1.387 $\n>    $Date: 2007/06/24 00:18:52 $\n>  */\n>\n>\n> You'll notice that we have no permission to distribute modified\n> versions of dcraw.c as required by the DFSG.\n\nI don't agree with you here. It seems to me that we do have permission to\ndistribute modified versions, provided source is included.\n\n\n>                                              Secondly, it appears that\n> we must include full source code if we've modified dcraw.c, but we\n> don't do that. We distribute source alongside.\n>\n\nAll that is required in this license is a link to David's home page.\nThe build process does not modify the file dcraw.c, so the footnote clause\nis applicable to this version of dcraw that would be included in debian.\n\n--\nSteve King\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}