{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Josip Rodin <joy@entuzijast.net>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "On Tue, Apr 24, 2007 at 08:07:03AM +1000, Ben Finney wrote:\n> The Social Contract makes a promise we are not keeping. You say it's\n> \"not ... something the social contract cares about\". That's not at all\n> clear from reading it -- the social contract makes a straightforward\n> promise, which has no exception for this, yet we're acting as though\n> such an exception were there.\n\nThe social contract is not making any exceptions; the law of the land is.\nIt goes without saying that we will be applying the copyright law to our\nstuff; should we explicate the fact that we do that, just in case someone\nthinks that by implicitly abiding by the copyright law we're doing something\nWrong(TM)?\n\nWhat else do we have to account for? Maybe talk about how developer time is\nnot free and it's possible for it to shrink to zero one day, invalidating\nthe whole deal. Maybe talk about how we can easily be derelict in\ncommunicating with upstream. Maybe talk about hiding some of the stuff we\nget at the BTS because it's marked by anti-spam filters. Talk about the\ndelay in publishing data from the BTS because the computers are not\ninfinitely fast. Hey, the fourth clause is very general, let's dissect that\none, too - let's explicate how all volunteers have a mind of their own and\neach has the option of prioritizing differently, even if slightly. Sometimes\nthere will be computing environments which we think we can't adjust to -\nlet's say so clearly. What if we fail to provide an integrated system of\nhigh-quality materials? Let's put the fact that we may be carrying lower\nquality materials up front.\n\nWe could go on and on, stating all those promises we are not keeping.\n\n(We should really be having an existential crisis by now...)\n\n-- \n     2. That which causes joy or happiness.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}