{"category": "ham", "to_address": "debian-desktop@lists.debian.org", "from_address": "\"=?ISO-8859-1?Q?Andr=E9_Luiz_Rodrigues_Ferreira?=\" <andrelrf@gmail.com>", "subject": "Re: Announce: DebianArt.org", "body": "2007/5/10, jmak <jozmak@gmail.com>:\nOn 5/9/07, André Luiz Rodrigues Ferreira <andrelrf@gmail.com> wrote:> Hi all,>> After some comments in debian-desktop list[1], the DebianArtwork Team[2]\n> prepared the DebianArt.org site[3].>> DebianArt.org is a place for high quality artwork and themes for the Debian> Desktop[4]. The idea is use the website for contests, creating an archive of\n> user contributed artwork that can be freely used and included in upcoming> Debian releases.>> The artwork should be pleasant, yet unintrusive. Ideally, it should work> well with the default user interface of the three major desktops: GNOME, KDE\n> and Xfce; but there's also room for more generic Debian related artwork like> t-shirts, labels and system sounds.> For example, the Debian Desktop team can create contests for create packages\n> of popular files.>> The user can put the follows categories:> - Wallpaper> - Splash screen> - Icon> - System sound> - Logo>  - Usplash> - T-shirt> - Screenshot\n> - Generic>> What do you think?> We think this is one of the available ways for a best desktop....>> Can you test? Please register and put your artworking :D>> Thanks to Valessio Brito and Gustavo Franco by their precious help !!!\n>> Links:> [1] -> http://lists.debian.org/debian-desktop/2007/04/msg00045.html> [2] - \nhttp://wiki.debian.org/DebianDesktopArtwork> [3] - http://www.debianart.org> [4] - http://www.debian.org/devel/debian-desktop/\n>> --> Andre Luiz Rodrigues Ferreira (si0ux) <andrelrf@gmail.com>> *******************************************************************> Orlandia - SP - Brazil\n>> \"Unix is user friendly... It's just selective about who its friends are.\"Hi,Hi Jmak, how are you? \nRegarding the new artorg site, I have a few suggestions.The main criteria for artwork creation would be better like \"artworkshould be unified, and coherent rather than the current \"pleasant, yetunintrusive\" Why? Because the latter ones are highly subjective terms\nand hard even impossible to evaluate them since everybody hasdifferent taste. While unity and coherence of the desktop can beevaluated with objective terms.Artists should be encouraged to develop entire sets rather than\nindividual pieces (wallpaper, splash and so on). This way unity andcoherence can be better maintained. When pick different pieces ofartworks and match them up later like a puzzle that always result badpatchwork. A coherent but less artistic desktop always better than the\nprofessional patchwork.Yes... It will be need in artwork contest. For example, for Lenny default artwork...\nI am suggesting wallpapers without logo like ubuntu wallpapers. Thereason is because wide screen monitors can badly distort the logo asthey stretch the artwork, and a distorted logo looks veryunprofessional. This is a problem even with dedicated wide-screen\nwallpapers because most novice users just don't bother changing them.The idea is to add the debian swirl in .svg format, after the contest.Thanks!\nRegards,Jmak--http://jozmak.blogspot.com/http://jozmak.googlepages.com/\n-- Andre Luiz Rodrigues Ferreira (si0ux) <andrelrf@gmail.com> *******************************************************************Orlandia - SP - Brazil\n\"Unix is user friendly... It's just selective about who its friends are.\"\n"}