{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESKiller's Video Reveals Deep-Seated Rage\nTwo days after the worst killing spree in U.S. history, videos and photographs of Cho Seung-Hui that were mailed to NBC between\n                        killings stunned the Virginia Tech community and the country. \"Now you have blood on your hands,\" he said in the video. More...Watch: 'You Forced Me Into A Corner'\n• Gonzales: Firings Proper And Should Stand• Gates In Iraq: Patience Running Out\n                     \t\t\t\t\t| Watch• CBS Poll: 36% Say Gonzales Should QuitU.S.New Pet Food Worry: Contaminated Rice\nThe FDA says the industrial chemical previously found to have contaminated wheat bran and caused the recall of over 100 pet\n                        food brands is now believed to have contaminated rice protein concentrate, also imported from China. More...\n• Killer's Video Reveals Deep-Seated Rage\n                     \t\t\t\t\t| Watch• Wounded Student: I Forgive Gunman\n                     \t\t\t\t\t| Watch• Story Behind Famous Virginia Tech Photo\n                     \t\t\t\t\t| Watch• More StoriesWorldGates In Iraq: Patience Running Out\nDefense Secretary Robert Gates has arrived for his third visit to Iraq with a message that American patience for the war is\n                        wearing thin. He arrived hours after a suicide bomber killed 12 people, and relatives mourned more than 230 killed Wednesday.\n                         More...Watch: Has The Troop Increase Helped?\n• Police Hunt Suspect In Peace Corps Death• Turkey Detains 5 In Bible Shootings• Crucial Iraq Oil Law Set For Parliament• More StoriesPoliticsCBS Poll: 36% Say Gonzales Should Quit\nAccording to a new CBS News Poll, over a third of Americans think Attorney General Alberto Gonzales should resign or be removed.\n                        But nearly two-thirds of those who are closely following the firings flap do not think Gonzales is telling the truth. More...\n• Gonzales: Firings Proper And Should Stand• High Court Upholds Ban On Some Abortions\n                     \t\t\t\t\t| Watch• Bush Threatens Sudan Over Darfur Bloodshed• More StoriesHealthDoes Cervical Cancer Vaccine Benefit Last?\nTwo vaccines for preventing cervical cancer, one that is already available and another that is undergoing FDA review, continue\n                        to offer nearly 100% protection five years following administration, new research shows. More...\n• New Pet Food Worry: Contaminated Rice• Hormone Use Linked To Higher Cancer Risk• Possible Aid For Alzheimer's: Satellites• More StoriesSciTechMySpace Enters Online News Business\nThe popular online social networking site MySpace is entering the news business with a feature that lets its users determine\n                        what items other members see. As part of the service, MySpace will pull and display headlines from the outside news sites. More...\n• Cars Still Beat SUVs In Safety• Antwerp Zoo: Don't Stare At That Chimp• Gunman's Cyber World To Be Revealed\n                     \t\t\t\t\t| Watch• More StoriesBusinessCars Still Beat SUVs In Safety\nWhen comparing the death rates in passenger vehicles with similar weight, cars are still safer than SUVs and pickup trucks.\n                        But the insurance industry finds that SUVs and pickups are catching up with cars, due to electronic stability control.  More...\n• MySpace Enters Online News Business• BlackBerry Outage Leaves Thumbs Idle• New Pet Food Worry: Contaminated Rice• More StoriesEntertainment\"American Idol\" Says So Long, Sanjaya!\nThe reality show's unlikely star was finally voted off the show this week. More...Watch: Simon Cowell Gets Judged\n• Lindsay Lohan: I'm Not An Addict• Kitty Carlisle Hart Dies At 96• Governor Mulls Pardon For Jim Morrison  • More StoriesOpinionGuns And Abortions\nCBSNews.com's Dick Meyer says those two newly-reignited arguments won't be resolved anytime soon. \"We aren't polarized,\n                        we are pluralized,\" Meyer says. More...\n• CBS Poll: 36% Say Gonzales Should Quit• Making No Sense Of It All\n                     \t\t\t\t\t| Watch• Iraq On Edge\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Story Behind Famous Virginia Tech Photo\nThe image of senior Kevin Sterne being carried off has been seen worldwide. It captures the drama of the moment, and has come\n                        to be seen as the iconic photo from that tragic day. Kelly Wallace reports. More...Watch: 'You Forced Me Into A Corner'\n• EARLY SHOW: Wounded Student: I Forgive Gunman\n                     \t\t\t\t\t| Watch• CBS Evening News: One Room Away: A Student's Story\n                     \t\t\t\t\t| Watch• CBS Evening News: Gunman's Cyber World To Be Revealed\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nRare Tiger Cubs Make DebutCBS News RAW: An Australian zoo has introduced two rare Sumatran tiger cubs to the public, after they were born in\n                                    captivity  as part of a global breeding program to save the species.\nTOP VIDEOS\n'You Forced Me Into A Corner'\nPackage Of 'Marginal Value'\nGonzales Testifies At Senate\nStudents Describe Shooter\nCho's Post Office Visit\nPicture Worth A Thousand Words\nSpirituality Practiced At Work\nWatch Cho's Video Manifesto\nSurvivor Forgives Shooter\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}