{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nBefore 9/11, the \n      government's \"No Fly List\" had 16 suspected terrorists on it.  Five \n      years later, the list ballooned to 44,000 and had become riddled with \n      inaccuracies, including dead people and international leaders not likely \n      to commit acts of terror. In our lead story, correspondent Steve Kroft takes \n      another look at the list and shows that, despite deletions like the \n      president of Bolivia \n      and the speaker of the Lebanese Parliament, flying can still be a hassle \n      for thousands of people, especially if you have a common name shared \n      by thousands – like Robert Johnson, Gary Smith or John \n      Williams.\n \nWatch an \n      excerpt.\n \nSpeaking of names, Barry \n      Diller is one you may not have heard in a while, but his recent \n      accomplishments are too big to miss.  In Hollywood, he was \n      responsible for movies like \"Urban Cowboy,\" \"Raiders of the Lost Ark\" and \n      \"Beverly Hills Cop.\" Then he started the fourth television network, \n      Fox.  In his third act, the home shopping giants QVC and HSN \n      flourished under his hand. What’s Diller up to now? Combining brands like \n      Ticketmaster and Match.com, he’s formed InterActive Corp., which Fortune \n      magazine named America’s most admired company \n      in Internet services. What does this billionaire do for an encore? He \n      marries the beautiful, rich clothing designer Diane von Furstenberg. Correspondent Lesley Stahl \n      reports.\n \nWatch Stahl's reporter's \n      notebook.\n \nIn our third story, correspondent Bob Simon takes you \n      to an exotic place where the people and the lifestyle will open your eyes \n      in wonder. The Moken people of the Andaman Sea in Southeast \n      Asia have no words in their language for time.  Nor do \n      they bid one another hello or goodbye. There is no word for \"want.\" \n      They've lived a nomadic life on the sea, living on their boats and on \n      tropical islands, living for and in the moment, for hundreds of \n      years.  So as the seas receded from their islands before the deadly \n      tsunami of Christmas 2004, they knew to run for high ground and saved \n      themselves. Saleh Kalathalay, an elder Moken, explained to Simon what \n      happened. \"The wave is created by the spirit of the sea. The big wave had \n      not eaten anyone for a long time and it wanted to taste them \n      again.\"\n \nWatch an \n      excerpt.\n \nThese stories and Andy Rooney's unwanted gifts, \n      this Sunday, June 10, on 60 Minutes at 7 p.m. ET/PT. \n\n \nFor an early look at this \n      week’s stories, please click \n      here.\n\n \n       \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n \n"}