{"category": "ham", "to_address": "\"'Prof Brian Ripley'\" <ripley@stats.ox.ac.uk>", "from_address": "\"John Fox\" <jfox@mcmaster.ca>", "subject": "Re: [R] Windows Vista issues", "body": "Dear Brian,\n\n> -----Original Message-----\n> From: Prof Brian Ripley [mailto:ripley@stats.ox.ac.uk] \n> Sent: Saturday, April 14, 2007 9:44 AM\n> To: John Fox\n> Cc: R-help@R-project.org\n> Subject: RE: [R] Windows Vista issues\n> \n> On Sat, 14 Apr 2007, John Fox wrote:\n> \n> > Dear Brian,\n> >\n> > I don't yet have a Vista machine, but it occurs to me that some of \n> > these problems might be avoided if R installed by default into c:\\R \n> > rather than c:\\Program Files\\R. Is that the case?\n> \n> If C:\\R is not a system area, the first para of 2) applies: \n> in fact I tried installing into E:\\R as an unprivileged user. \n>  That's what I would recommend a sole user of R to do (and \n> have long done myself). \n\nYes, I do that too (to c:\\R, in my case). I don't know whether Vista\nconsiders c:\\R a system area; if not, making c:\\R the default would avoid\nproblems for sole users.\n\n> However, if you are a sysadmin \n> installing for many users of the machine, you will want to \n> install into a system area (or else a standard user is likely \n> to be able to uninstall R, for example).\n> \n\nAssuming that c:\\R is not a system area, the question is what's the best\ndefault location for installing R. I suspect that most people who use R on\nWindows are using it on sole-user machines, and are not used to\ndifferentiating between administrator and other accounts. Vista will make\nthem attend to this distinction, and they may well get in the habit of\ninstalling software as an administrator. This would lead to the kinds of\nproblems that have been surfacing: Difficulty installing packages as an\nunprivileged user after doing a default install of R as an administrator.\n\nSysadmins, on the other hand, tend to be more sophisticated, and could\ninstall R to c:\\Program Files\\R even if the default location is c:\\R.\n\n> My memory is that long ago the default for the R installer \n> was c:\\R, and user pressure made us change it.  \n\nYes, I recall that. I agree that the change made sense at the time.\n\n> BTW, the \n> default is only c:\\Program Files\\R for an administrator \n> account: for unprivileged users it is under c:\\Documents and \n> Settings\\ for XP and c:\\Users\\ for Vista.\n> We have some control in the installer script of these things, \n> but have chosen to take the defaults which give the most \n> familiar experience to end users.\n> \n\nI think that the general principle should be to choose defaults to cause the\nleast difficulty, especially to unsophisticated users. Perhaps the\nimplications of that have changed with Vista. As I said, I don't currently\nhave a Vista machine, so none of this is based on experience.\n\nRegards,\n John\n\n> The file access reporting issues were occurring in ordinary \n> user space.\n> \n> Brian\n> \n> \n> > Thank you, by the way, for pursuing these issues.\n> >\n> > John\n> >\n> > --------------------------------\n> > John Fox\n> > Department of Sociology\n> > McMaster University\n> > Hamilton, Ontario\n> > Canada L8S 4M4\n> > 905-525-9140x23604\n> > http://socserv.mcmaster.ca/jfox\n> > --------------------------------\n> >\n> >> -----Original Message-----\n> >> From: r-help-bounces@stat.math.ethz.ch \n> >> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Prof Brian \n> >> Ripley\n> >> Sent: Saturday, April 14, 2007 1:57 AM\n> >> To: R-help@R-project.org\n> >> Subject: [R] Windows Vista issues\n> >>\n> >> It seemed FUD [*] has been prevailing here and elsewhere on Vista \n> >> security features.\n> >>\n> >> I asked our sysadmins to set up a Vista box for me on which I have \n> >> access to all levels of accounts.  Many of the issues I found were \n> >> covered by earlier answers and all in the upcoming rw-FAQ \n> (currently \n> >> available at http://www.stats.ox.ac.uk/pub/R/rw-FAQ.html \n> and in the \n> >> 2.5.0\n> >> pre-releases) but a quick reprise may help.\n> >>\n> >> Most of my testing was of 2.5.0 beta, but I did some quick \n> tests of \n> >> 2.4.1.\n> >>\n> >>\n> >> 1) The R installer and uninstaller are from an 'unidentified \n> >> publisher'\n> >> and you may have to agree that you trust them.  This is a \n> problem of \n> >> the Inno Setup installer kit we use.  An ultra-cautious sysadmin \n> >> could configure Vista to stop you installing via such a program.\n> >>\n> >>\n> >> 2) Permission problems:\n> >>\n> >> If you install R as an ordinary user (into your own file\n> >> space) you should see no permissions problems.  (There would have \n> >> been problems, including under XP, with some recent daily binary \n> >> builds as the installer kit had changed one of its defaults to \n> >> disallow non-administrator installs, but these have been fixed.)\n> >>\n> >> I also encountered no problems installing R under the \n> Administrator \n> >> account (normally hidden) and installing packages under the same \n> >> account.\n> >>\n> >> Things are more complicated if you use an account which is in the \n> >> local administrator group (but is not Administrator itself).  Such \n> >> accounts are no longer (by default) equivalent to \n> Administrator, and \n> >> run programs as ordinary user accounts.\n> >> They need to 'Run as Administrator' to do things in the \n> system area \n> >> such as C:\\Program Files.  You will be asked if you want to run as \n> >> administrator if you try to install software such as R, \n> but you will \n> >> not be asked if you try to install packages in the main R library \n> >> (since asking is something that applies to a program, not \n> part of a \n> >> particular session).  One simple solution is to elevate your \n> >> credentials when running an R session to install packages \n> in the same \n> >> way that you needed to when installing R.  (Unix and MacOS X users \n> >> will recognize a somewhat automated reincarnation of 'sudo'.)\n> >>\n> >> It looks like the best practice will be to change the (full) \n> >> ownership of the R installation to the account used to install it, \n> >> something which would be standard practice in the Unix \n> world.  Also, \n> >> we are encouraging people as from 2.5.0 to install packages into a \n> >> site or personal library where these permission issues should not \n> >> arise (except when updating recommended packages).\n> >>\n> >>\n> >> 3) The most worrying problem is that Vista is reporting quite \n> >> incorrectly file permissions through the POSIX interfaces used by \n> >> file.info() and file.access(), and furthermore allowed me as a \n> >> standard user to create directories in areas over which it \n> says I do \n> >> not have write permission. We will look further into possible \n> >> solutions, but it seems the Win32 API functions are giving \n> the same \n> >> answers.\n> >>\n> >> Problems with 'access' (the C call underlying file.access()) mean \n> >> that the MinGW compilers do not currently run on Vista \n> without a lot \n> >> of hoop-jumping.\n> >>\n> >>\n> >> [*] http://en.wikipedia.org/wiki/Fear,_uncertainty_and_doubt\n> >>\n> >> --\n> >> Brian D. Ripley,                  ripley@stats.ox.ac.uk\n> >> Professor of Applied Statistics,  \n> http://www.stats.ox.ac.uk/~ripley/\n> >> University of Oxford,             Tel:  +44 1865 272861 (self)\n> >> 1 South Parks Road,                     +44 1865 272866 (PA)\n> >> Oxford OX1 3TG, UK                Fax:  +44 1865 272595\n> >>\n> >> ______________________________________________\n> >> R-help@stat.math.ethz.ch mailing list \n> >> https://stat.ethz.ch/mailman/listinfo/r-help\n> >> PLEASE do read the posting guide\n> >> http://www.R-project.org/posting-guide.html\n> >> and provide commented, minimal, self-contained, reproducible code.\n> >>\n> >\n> >\n> \n> -- \n> Brian D. Ripley,                  ripley@stats.ox.ac.uk\n> Professor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\n> University of Oxford,             Tel:  +44 1865 272861 (self)\n> 1 South Parks Road,                     +44 1865 272866 (PA)\n> Oxford OX1 3TG, UK                Fax:  +44 1865 272595\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}