{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: Final text of GPL v3 (new interactive interfaces)", "body": "Francesco Poli  wrote: [...]\n> The scenario I am mainly worried about is the following.\n> \n> The work A is published under the terms of the GNU GPL v3.\n> A has *no* interactive interfaces, because it's not an interactive work.\n> I receive work A and want to create a modified work based on A.\n> The modified work is named B and has one, newly implemented, interactive\n> interface.  Hence, work B is an interactive work.\n> I want to distribute work B in source form.\n> \n> In this scenario, I have to comply with Section 5 of the GNU GPL v3.\n> Work B is the \"work based on the Program\" referred to in the first\n> sentence of Section 5:\n> \n> |   You may convey a work based on the Program, or the modifications to\n> | produce it from the Program, in the form of source code under the\n> | terms of section 4, provided that you also meet all of these\n> | conditions:\n> \n> On the other hand, work A is the \"Program\".\n> Is that right?  I cannot see any other reasonable interpretation.\n\nNow I'm unsure.  Earlier, the Program was defined as \"any copyrightable\nwork licensed under this License\".  Because the GPL is a copyleft, isn't\nthe modified Program also the Program?  Is 5d's work the original or\nmodified work?  Is 5d's Program the original or the modified Program?\nI thought it was 'the work' [= work B] as mentioned in the first part of\n5d.  It seems a bit fiddly for the work to change in 5 to mean the\nmodified work but the Program never to change.\n\n> > > >   7. Additional Terms.\n> > > [...]\n> > I share these reservations.  A problem to watch for in GPLv3 packages.\n> \n> Hooray!  Another check-on-case-by-case-basis license!  :-(\n\nTo be fair, some people have tried to use GPLv2's requirements about\nnotices to include invariant sections.  I think this will be less common\nand less troublesome than many licences.\n\n> Thanks for replying to my comments.\n\nNo worries.  Thanks for the thorough analysis, flagging many potential\nproblems, even if I'm not convinced that there any DFSG-busters.\nI'm very demotivated by the GPLv3 and the way it has been produced (not\nsure which of this and FDL 1.2 was worse for me, to be frank) and it's\nrather inescapable, so I probably wouldn't have looked so closely at it\nwithout this thread you started.\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}