{"category": "ham", "to_address": "\"\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  Blue Security and Blue Frog Resurface Reincarnated as a Social Networking Spammer", "body": "\n\n\nThe Internet Patrol\n\n\nThe Internet Patrol \nhttp://www.theinternetpatrol.com\n\nBlue Security Resurfaces Reincarnated as a Social Networking Spammer - The Blue Frog Will Spam Digg, Del.icio.us and More\nThe trio that brought us Blue Security and their Blue Frog, the DOSing service that planned to DOS spammers, and that went belly up after a spammer instead DOSed them (well, duh), has apparently decided that spamming is more lucrative (again, well, duh), and founded a new company called Collative to do just that. \nRead more here: Blue Security Resurfaces Reincarnated as a Social Networking Spammer - The Blue Frog Will Spam Digg, Del.icio.us and More \nHere are some amazing deals we've found on the Internet for ourselves recently: \nGet gadget insurance for your cell phone, PDA and all your electronic gadgets, to protect against los or theft! http://www.theinternetpatrol.com/get-your-stuff-back-with-stuffbak-pdas-laptops-cell-phones-protect-them-all Send Unlimited Newsletters to Your Customers, Friends, Family, and Others: http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters \nUnlimited Calls to Any Phone in the U.S.: http://www.theinternetpatrol.com/make-unlimited-phone-calls \nCheck out our online audio show, \"Three Things You Should Know\"! http://www.ThreeThingsYouShouldKnow.com \nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV ! \nKnow somebody who would like to receive these alerts? Forward this one to them and let them know that they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the word 'Subscribe' in the subject! \n \n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA\n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}