{"category": "ham", "to_address": "debian-devel@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Josselin Mouette writes:\n\n> Le jeudi 24 mai 2007 à 15:36 -0400, Michael Poole a écrit :\n>> > Please stop the choice-of-law bullshit. This clause is moot, we can\n>> > ignore it.\n>> \n>> Moot in what venues?  I live in a state that has enacted the Uniform\n>> Computer Information Transactions Act (UCITA), which -- among other\n>> things -- gives effect[1] to choice of venue clauses in shrink-wrap\n>> licenses unless a party can show that the choice is \"unreasonable and\n>> unjust\".  US courts have made that barrier rather high in practice.\n>> \n>> I'm not a fan of judging licenses free because Debian thinks certain\n>> clauses are moot.  If the clause is in fact moot, the license is\n>> buggy.  If the clause is not moot -- at the time of upload or some\n>> point afterwards -- it can cause significant harm.\n>\n> The reason why the relation between the author and the user would come\n> to court can not be the user suing the author, only the author suing the\n> user for violating his copyright.\n>\n> I don't know about the US - and if this is enough to make a license\n> non-free, this will give another reason to resurrect the non-us archive\n> - but in other countries, the author could only sue the user in the\n> latter's juridiction (if the \"juridiction\" word ever makes sense).\n> Whatever is written in the license text will not change that.\n\nThe default situation in the US also is that a plaintiff (in the\nworrisome case, the software's author) may not select the venue for\nhis own convenience, but instead must file in a forum that has both\npersonal jurisdiction over the defendant(s) and subject matter\njurisdiction.\n\nHowever, most contracts -- any negotiated contract, and many standard\nform contracts -- may specify a venue for court actions arising from\nthe contract.  UCITA makes it clear that shrinkwrap licenses should be\npermitted to specify venue in this way.  Only Virginia and Maryland\nhave enacted UCITA, but a wide variety of other courts (see [1]) have\nruled or held that choices of venue in click-wrap and shrink-wrap\nlicenses are binding.\n\n[1]- http://eric_goldman.tripod.com/resources/onlinecontractcases.htm\n\nThus, it is not just reading a law, but also actual history, that\nmakes many of us presume that license-based forum selection is\nbinding, and leads us to judge license freedom on that basis.\n\nSeparately, for two reasons, I do not think that forum selection is a\ngood argument for reviving non-us. First, I am not convinced that the\nUSA is the only place that contractual forum selection is binding; I\nsuspect there are others.  Second, non-us was used for software that\ncould not be legally exported from the USA; using non-us for software\nunder choice-of-venue licenses would both overload the meaning and\nmean that the software could not be safely either exported from *or*\n_used in_ the United States.  Why then should we not create\n\"non-europe\" for software that is free except for the fact that the\nlicense forbids citizens of European countries from using the\nsoftware?  If the DFSG violation arises from the license, the software\nbelongs in non-free, full stop.\n\nMichael Poole\n\n\n"}