{"category": "ham", "to_address": "Robert McFadden <robert-mcfadden@o2.pl>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] Speed up R", "body": "On Tue, 19 Jun 2007, Robert McFadden wrote:\n\n> Dear R Users,\n> I hope that there is someone who has an experience with a problem that I\n> describe below and will help me.\n> I must buy new desktop computer and I'm wondering which processor to choose\n> if my only aim is to speed up R. I would like to reduce a simulation time -\n> sometimes it takes days. I consider buying one of them (I'm working under\n> Win XP 32 bit):\n> 1. Intel Core2 Duo E6700 2.67 GHz\n> 2. Dual-Core Intel Xeon processor 3070 - 2,66 GHz\n> 3. AMD Athlon 64 X2 6000+\n> Or simple Pentium 4?\n>\n> I'm very confused because I'm not sure whether R takes advantage dual-core\n> or not.\n\nNot under Windows XP.\n\nThe experience under Linux shows that on the right problem dual processors \ncan help a lot (say 1.8x), but the gains are typically modest and can even \nbe negative.\n\nThe advantage of dual processors is that you can use the machine for \nseveral things at once, including multiple R jobs.  For example, when I am \ndoing package checking I am typically checking 4 packages at once on a \ndual processor machine to get continuous high utilization.\n\n> If not, probably Athlon would be better, wouldn't be?\n\nI have little doubt that a Pentium 4 would be much slower than the others.\n\nI've just bought an Intel Core 2 Duo E6600 primarily to run 64-bit Linux, \nbut it also has Vista 64 and XP (32-bit) on it.  I don't think the\ndifferences between the current dual-core chips are really enough to\nworry about: they will all look slow in less than a year.\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}