{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Zachary Kline\" <Z_kline@hotmail.com>", "subject": "Re: dropline-gnome accessibility", "body": "Hiya,\n    I suppose that Gnome really isn't absolutely necesary.  I've heard some \ntechnical complaints about Dropline.  One of those seems to be that it \ninstalls PAM, which isn't really something I'm familiar with.  From what I \ngather, it complicates traditional ways of doing things considerably.\nThanks for your help.  I'll try and see what happens, maybe.\nAll the best,\nZack.\n\n----- Original Message ----- \nFrom: \"Jude DaShiell\" \nTo: \nSent: Thursday, June 28, 2007 3:55 PM\nSubject: dropline-gnome accessibility\n\n\n> I'll try to help out as much as possible and wish I could be more helpful\n> by now than I can.  droplinegnome is the only slackware 3rd party gnome\n> that's mostly keeping current with the real gnome versions.\n> droplinegnome can be installed by downloading the droplinegnome-installer\n> from http://www.droplinegnome.org and running it as root.  droplinegnome\n> does have orca as part of its distribution and just using the installer\n> will get you only the latest versions of all packages.  Unfortunately,\n> droplinegnome does not include the speech-tools or festival packages or\n> the necessary add-ons from festvox.org. I've been trying to build both on\n> a kernel 2.4x system here without much luck.  I'll try again in my home\n> directory since it has more space and maybe they'll build then.\n> gnome-speech is also included in droplinegnome but since festival wasn't\n> available on my machine when I installed droplinegnome it built in such a\n> way that it excluded all speech servers like festival.  So first get\n> speech-tools and festival built and working then install droplinegnome and\n> if all works orca will talk on your end.\n>\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}