{"category": "ham", "to_address": "<ip-health@lists.essential.org>,\n   \"Healthgap List\" <HEALTHGAP@LISTSERV.CRITPATH.ORG>,\n   <WTO-INTL@LISTSERVER.CITIZEN.ORG>, <ipprofs@listserv.piercelaw.edu>", "from_address": "\"Sean Flynn\" <sflynn@wcl.american.edu>", "subject": "[Ip-health] Annex 2C Plus provisions in KoreaUS FTA Phrma Chapter", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nMore information on the Korea FTA and the pdf version of this article\ncan be found at\nhttp://www.wcl.american.edu/pijip/us_korea_negotiations.cfm\n\n\n\n\n\n\"Annex 2C-plus\" provisions in the Korea-US FTA Pharmaceuticals Chapter\n\n\n\nSean Flynn[1]\n\nAssociate Director, Program on Information Justice and Intellectual\nProperty\n\nAmerican University, Washington College of Law\n\nsflynn@wcl.american.edu, 202-274-4157\n\n\n\nApril 6, 2007\n\n\n\nAlthough the final text of the Korea-US Free Trade Agreement has not\nbeen released, it is evident from a careful reading of USTR's summary\nthat many of its provisions will go far beyond the controversial\nrestrictions on Australia's Pharmaceutical Benefit Scheme (PBS) included\nin Annex 2C of the Australia-US Free Trade Agreement.  Following the\npractice of terming provisions that go beyond the minimum requirement of\nTRIPS as \"TRIPS-plus,\" this paper coins a new phrase - \"Annex 2C plus\" -\nfor provisions in the Korea agreement that go beyond Annex 2C.\n\n\n\nThis is a first draft note including preliminary analysis.  I invite\ncomments to sflynn@wcl.american.edu  Subsequent drafts will be posted to\nwww.pijip.org   as new information is released.\n\n\n\nAnnex 2C and Drug Formularies\n\n\n\nAnnex 2C was the first section of an FTA with the U.S. to attempt to\nrestrict the operation of public pharmaceutical reimbursement schemes\nbased on a drug formulary (referred to by the Republic of Korea as a\n\"positive list\" and by U.S. states as \"preferred drug lists.\")  The\nprinciple of a formulary is simple.  In order to ensure value for money\nand negotiate reasonable prices with drug companies, the payer must be\nable to say \"no\" to some extent to the drug company's offered terms of\nsale.  This is normally accomplished by requiring that higher priced\ndrugs with equivalent therapeutic value compared to alternatives be\nsubject to some form of prior authorization, subject to restrictions on\nsubsidized use, or excluded from reimbursement entirely if the\nincremental therapeutic value is not considered sufficient to justify\nthe price premium.\n\n\n\nThe desire of companies to have their products reimbursed in the easiest\npossible manner provides an incentive for them to negotiate lower prices\nto the purchaser.  Formularies can also be used to steer patients toward\ngeneric equivalents of or therapeutic substitutes for brand name\nproducts.  Because of their effectiveness at promoting negotiation of\nlower prices, some version of a formulary for drug purchases is used by\nevery substantial purchaser of drugs, including private insurance\ncompanies and corporations, U.S. and foreign governments, and nearly\nevery state government Medicaid program.  But the pharmaceutical\nindustry is becoming increasingly successful at achieving limitations on\nthis important and effective tool by public entities through the\noperation of binding trade rules.\n\n\n\nAnnex 2C of the Australia-U.S. FTA was the result of intense\npharmaceutical industry lobbying against one of the most effective drug\nformularies in the world.[2]  The Australian PBS scheme works by\nrequiring drugs seeking listing on the formulary to be assessed based on\nevidence of the comparative effectiveness, including comparative cost\neffectiveness, against the therapy most likely to be replaced in\npractice.  Combined with a reference pricing system, the PBS will only\nlist a medicine at higher price than the comparator where it is able to\ndemonstrate an incremental benefit.  Where a new drug is deemed to offer\nequivalent benefits to patients, the system will not list the drug at a\nhigher price irrespective of its patent status.\n\n\n\nAnnex 2C did not mandate that Australia provide equally simple access to\nevery drug without price restraint, as the pharmaceutical industry\nwished.  It did, however, implement a number of procedures and normative\nprinciples that some argue could enable them to challenge listing\ndecisions.  The Annex included three main sections:\n\n(1) \"Agreed Principles,\" expressing commitments to recognize the value\nof \"innovative pharmaceuticals\";\n\n(2) Transparency provision, mandating certain procedures, including\nwritten reasons and \"independent review process\" for listing\nrecommendations; and\n\n(3) participation in a \"Medicines Working Group\" to \"promote discussion\nand mutual understanding\" of the issues raised in the Annex.\n\n\n\nUSTR's Fact Sheet on the Korea-US agreement follows the same general\npattern of Annex 2C, and therefore one can surmise what much of the\nlanguage in the final text will be.  Importantly, the Fact Sheet\nincludes several key changes in wording and additions to Annex 2C, i.e.\nAnnex 2C-plus provisions, that may further decrease the ability of Korea\nto use its public drug formulary to negotiate lower prices.  These\nprovisions are discussed in more detail below.\n\n\n\nTitle: Pharmaceuticals and Medical Devices\n\n\n\nKorea Fact Sheet language:     Pharmaceuticals and Medical Devices: A\nShared Commitment on Access to Innovative Medicines\n\n\n\nAnalysis:  The first notable Annex 2C-plus provision in the Korea-US is\nincluded in the title of the section.  Where Annex 2C was titled\n\"Pharmaceuticals,\" the Korea fact sheet labels the section\n\"Pharmaceuticals and Medical Devices.\"  The inclusion of \"medical\ndevices\" is new.  Annex 2C only covered reimbursement programs for\nmedicines, not medical devices.  The scope of the Korea-US FTA is thus\nlikely to be much broader than Annex 2-C.\n\n\n\n\n\nAgreed principles\n\n\n\nKorea Fact Sheet language:     Agreement on common principles on\nfacilitating high-quality health care and continued improvements in\npublic health for nationals.\n\n\n\nThis provision appears similar to the principles included in the\nAustralia-US agreement.  It does not clearly include Annex 2C-plus\nprovisions.\n\n\n\nAnnex 2C included a set of \"agreed principles\" favorable to the branded\ndrug industry, including commitments to \"the important role played by\ninnovative pharmaceutical products,\" the need to promote \"access to\ninnovative pharmaceuticals through transparent, expeditious and\naccountable procedures,\" and \"the need to recognize the value of\ninnovative pharmaceuticals.\"  Similar principles, focused on branded\ndrugs, can be expected in the Korea FTA principles.\n\n\n\nMuch may lie in the definition of \"innovative pharmaceuticals\" if that\nterm is used in the Korea agreement.  The Australians consider an\n\"innovative\" drug as one conferring a clinically important improvement\nin patient outcome. [3] The pharmaceutical industry tends to equate\ninnovative with patented.  Patented drugs do not necessarily have any\nadditional clinical benefit - they are required by the patent system to\nbe novel, not clinically important.[4] Annex 2C did not define\n\"innovative pharmaceuticals.\"  It will be important to analyze the Korea\nlanguage for further detail in this area.\n\n\n\naccess to innovative products\n\n\n\nKorea Fact Sheet language:     Commitment to increase access to\ninnovative products, including through insurance the fair, reasonable,\nand non-discriminatory treatment for pharmaceutical products and medical\ndevices.\n\n\n\nThis entire provision appears to be Annex 2C-plus.  Nothing in Annex 2C\nrecorded a commitment to increase the use of \"innovative\" products.\nAnd, as mentioned earlier, nothing in Annex 2C applied to \"devices.\"\n\n\n\nIt is not clear what the final text language will do to \"increase access\nto innovative products.\"  The pharmaceutical industry has argued that\npublic systems should reimburse every product for every registered\nindication.  Such a principle would obliterate the effectiveness of a\ndrug formulary since there would be no potential to refuse\nreimbursement.  The degree to which the Korea-US FTA will damage Korea's\nnegotiating power through its formulary is unknown at this point.\n\n\n\n\n\n\n\ntransparency\n\n\n\nKorea Fact Sheet language:     Commitments on transparency in the\npricing and reimbursement process for pharmaceutical products and\nmedical devices.\n\n\n\nAnnex 2C included a provision on \" Transparency\" applicable only where\n\"federal healthcare authorities operate or maintain procedures for\nlisting new pharmaceuticals or indications for reimbursement purposes.\"\nFor such programs, Annex 2C required that the system ensure decisions\nwithin a specified period of time, disclose \"procedural\" rules and\nguidelines used to assess a proposed listing, afford opportunities to\ncompanies to provide comments, provide written reasons for listing\ndecisions, and \"make available an independent review process\" for the\ndecisions.\n\n\n\nThe restriction of the application to \"federal\" level reimbursement\nprograms is noticeably absent from the summary description of the Korea\nFTA.  If this absence is carried forward in the actual agreement text,\nit may be the most important Annex 2C-plus provision from the point of\nview of U.S. States.\n\n\n\nAt least 40 U.S. states operate preferred drug price lists for Medicaid\nand other programs.  Under FTA implementing legislation, the U.S.\ngovernment maintains the authority to sue states to preempt programs and\nlaws that do not comply with the FTA.[5]  U.S. states have raised\nconcerns with the indeterminacy of Annex 2C as applied to Medicaid\nprograms.[6][7]  Under Medicaid, states play a large part in paying for\nand administering the drug benefit, but ultimately it is federal law\nthat determines which drugs are covered for reimbursement and thus could\nbe considered a \"federal\" program for Annex 2C purposes.  If the Korea\nagreement is not expressly limited to federal/national level programs,\nit would more directly threaten the most effective tool that states now\nhave in restraining medicine prices.\n\n\n\nImproper Inducements\n\n\n\nKorea Fact Sheet language:     Agreement to adopt and maintain measures\nto prohibit improper inducements by pharmaceutical products and medical\ndevice manufacturers and to enforce such measures.\n\n\n\nIt is not clear what this provision is indicating.  There is no similar\nprovision in Annex 2C, nor was one negotiated during the FTA process.\nIt is Annex 2C-plus, although to what effect it is difficult to\nascertain.\n\n\n\n\n\nMedicines and Medical Devices Working Group\n\n\n\nKorea Fact Sheet language:     Agreement to establish a Medicines and\nMedical Devices Working Group that will provide for continued dialogue\nbetween the United States and Korea on emerging health care policy\nissues.\n\n\n\nAnnex 2C provided for a \"Medicines Working Group\" to \"promote discussion\nand mutual understanding of issues relating to this Annex . . . ,\nincluding the importance of pharmaceutical research and development to\ncontinued health outcomes.\"  The extension of this mandate to \"Medical\nDevices\" is new, and therefore Annex 2C-plus.\n\n\n\nIndependent Review Body\n\n\n\nKorea Fact Sheet language:     Agreement by Korea to establish and\nmaintain an independent body that reviews recommendations or\ndeterminations regarding the pricing and reimbursement of pharmaceutical\nproducts and medical devices.\n\n\n\nAnnex 2C provided for \"an independent review process,\" not a \"body.\"\nThe distinction could be important.  Australia has complied with Annex\n2C by establishing a review process within the health system with no\nauthority to overturn the decision of the expert body in the PBS.  It\ncan only report findings on matters in dispute back to the expert body\nwhich may then decide to reconsider a recommendation (but is not obliged\nto).\n\n\n\nThe Korea language mandating creation of an \"independent body\" may imply\nan obligation set up an additional panel of experts with authority to\noverturn the decision of the initial panel of experts that decides\nlisting decisions.  This provision would be wasteful and may provide\nopportunities for the pharmaceutical industry to engage in complex and\nwell-funded efforts to capture the attention and interests of the review\n\"body\" through repetitive proceedings.\n\n\n\nInterestingly, the language in the fact sheet only applies to Korea.\nAnnex 2C binds both countries.  It will therefore be interesting to\nwatch for whether the agreement is in fact one-sided when the language\nis finally released.\n\n\n\n\n\n\n________________________________\n\n[1] Special thanks are owed to Ruth Lopert, MD, Harkness Fellow in\nPublic Health Care Policy at George Washington University School of\nPublic Health who reviewed and commented on an earlier version of this\nnote and whose insights are reflected herein and to Mike Palmedo for\ninvaluable research assistance.  All errors are my own.\n\n[2] Dr K. Lokuge and Richard Denniss. Trading Away Our Health System?\nThe impact of the Australia-US Free Trade Agreement on the\nPharmaceutical Benefits Scheme.  The Australia Institute. Discussion\nPaper Number 55.  May 2003.  Additionally, the US pharmaceutical\nindustry's grievances with the Australian Pharmaceutical Benefits Scheme\nare offered in writing each year to the US Trade Representative in\nannual submissions for the USTR 301 report.\n\n\n\n[3] This note was written with considerable advice and assistance of\nRuth Lopert, MD, Harkness Fellow, George Washington University, former\nHealth Care Advisor to the Australian Trade Negotiation Team.\n\n[4]  National Institute of Healthcare Management. Changing Patterns of\nPharmaceutical Innovation. May, 2002. This report examined drug\napprovals in the 1990s and found that only 35% received a priority\napproval from the FDA, indicating \"significant therapeutic gain\" over\nexisting treatments.\n\n[5]  Global Trade Watch. States' Rights and International Trade. Public\nCitizen. February, 2007.\n\n[6]  Vermont General Assembly. J.R.50. Joint resolution relating to\ninternational trade agreements and pharmaceutical drug programs.\nJanuary, 2006.\n\n[7]  California State Senator Liz Figueroa. Letter to the US Trade\nRepresentative. February 2005. Available online at\nwww.forumdemocracy.net  .\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}