{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Apr. 11, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 11, 2007\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for April 11, 2007  \n\n\n\nFirst Enercast Featured Articles for April 11, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\nFocus on Carbon Market Developments 2007 (UtiliPoint.com - Apr. 9, 2007) \n\n\n\nUtiliPoint.com - Apr. 9, 2007 - 2007 has become the breakthrough year in U.S. carbon consciousness. The realization that U.S. multinational companies fall under the Kyoto Protocol in 169 nations, coupled with state lead initiatives on both the East and West Coasts, have now crystallized Congressional attention on the issue of global warming.\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\n2007 FLAME Survey Results&#8212;Cross Border Gas Trading in Europe (UtiliPoint.com - Apr. 11, 2007)\n\n\n\nUtiliPoint.com - Apr. 11, 2007 - Recently, SunGard Energy, in cooperation with the organizers of FLAME, sought to gain feedback on some of the issues facing the ongoing liberalization effort in European natural gas markets.\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\nSempra Aggressively Pursues Opportunities (EnergyBiz Insider - Apr. 11, 2007)\n\n\n\nEnergyBiz Insider - Apr. 11, 2007 - More than four years ago, top executives with California energy giant Sempra identified a major opportunity developing in the natural gas market.\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 10, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 10, 2007\n\n\nApr 11, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nThe Gas Company to Honor Actor Ed Begley Jr. With Energy-Efficiency Champion Award\n\n\n\n(PRIME NEWSWIRE) -- Southern California Gas Company (The Gas Company) will honor actor Ed Begley Jr. with its first-ever 'Energy-Efficiency Champion Award,' recognizing his years of efforts to promote the economic and environmental benefits of energy efficiency. Anne Shen Smith, The Gas Company's senior vice president of customer services, will present the award at the company's Energy-Efficiency ...\n\n\nApr 10, 2007 NewsBlaze\n\n\n\nPG&E demonstrates Vehicle-to-Grid technology\n\n\n\nPG&E demonstrates Vehicle-to-Grid technology San Francisco, CA, April 10, 2007 -- During the Silicon Valley Leadership Group Alternative Energy Solutions Summit, Pacific Gas and Electric Co. (PG&E) showcased the utility Vehicle-to-Grid (V2G) technology demonstration. The demonstration marks a milestone in the development of technologies to make electric vehicles suppliers of electricity to homes ...\n\n\nApr 10, 2007 Utility Automation & Engineering T&D\n\n\n\nWestar Energy to Provide Energy Marketing Services to Kelson Energy\n\n\n\nTOPEKA, Kan., April 10 /PRNewswire-FirstCall/ -- Westar Energy, Inc. announced that it has expanded its energy marketing relationship with Kelson Energy, Inc. by renewing an existing agreement for the Redbud Energy LLC and adding a new energy management agreement for the Dogwood Energy LLC. Kelson Energy recently purchased the 620 MW Dogwood Energy LLC combined-cycle power plant in Pleasant Hill, ...\n\n\nApr 11, 2007 TickerTech.com\n\n\n\nChallenges to Power Plants Get Green Light\n\n\n\nHigh court boosts bid to get coal burners to install pollution controls The attorney for environmental groups that won a U.S. Supreme Court victory against a coal-burning utility says Mondays opinion could have been a lot shorter. Hes glad it wasnt. In a 9-0 ruling, the Supreme Court vacated a decision by the 4th U.S. Circuit Court of Appeals, saying the appeals court implicitly invalidated 1980 ...\n\n\nApr 11, 2007 American Bar Association\n\n\n\nPG&E Unveils Next-Gen Electric Car Technology\n\n\n\n-- At the Silicon Valley Leadership Group's  yesterday, Pacific Gas and Electric showcased the first-ever utility Vehicle-to-Grid (V2G) technology demonstration, marking a milestone in the development of innovative technologies to make electric vehicles suppliers of electricity to homes and businesses. 'PG&E is committed to meeting the challenges associated with climate change by developing and ...\n\n\nApr 11, 2007 GreenBiz\n\n\n\nSouthern Company Executive VP Leonard Haynes to Address Energy Security, Renewable Energy Resources in the Southeast\n\n\n\nATLANTA, April 10 PRNewswire-FirstCall  Southern Company Executive Vice President Leonard Haynes will participate in an energy security discussion during the National Conference on the Advancement of Research to be held in Savannah, Ga., April 11-13 at the Savannah Trade and Convention Center. Haynes oversees Southern Company's supply technologies, renewables and demand side planning initiatives. ...\n\n\nApr 11, 2007 DiGiTAL50\n\n\n\nAtmos Energy Corporation to Host Fiscal 2007 Second Quarter\n\n\n\nAtmos Energy Corporation (ATO) Stock Quote, Chart, News Related topics Atmos Energy Corporation ATO will host a conference call on Thursday, May 3, 2007, at 10:00 a.m. EDT to review the company's fiscal 2007 second quarter financial results and fiscal 2007 expectations. Atmos Energy will release its fiscal 2007 second quarter earnings on Wednesday, May 2, following the market close.\n\n\nApr 10, 2007 Business Wire via MSN Money\n\n\n\nCanadian Natural-Gas Prices Rise as Cold Temperature Spurs Demand in U.S.\n\n\n\nCanadian Natural Gas Rises as Cold Weather Spurs Demand in U.S. By Reg Curren April 10 (Bloomberg) -- Natural gas at Canada's biggest trading point surged as below-normal temperatures spurs U.S. demand for the furnace fuel. On Calgary-based Natural Gas Exchange Inc.'s NGX electronic energy market, spot gas at AECO C, Canada's largest trading hub, jumped 30 cents to C$7.48 per gigajoule ($6.86 per ...\n\n\nApr 10, 2007 Bloomberg\n\n\n\nARC Announces Renewable Energy and Energy Efficiency Grants Competition\n\n\n\nWASHINGTON D.C. (April 10) -- The Appalachian Regional Commission (ARC) announced a grants competition this week to assist communities in leveraging renewable energy and energy efficiency resources to revitalize their economies. ARC expects to provide eight to 10 awards of up to $75,000 each, for a total of $400,000 in awards, to help communities implement these strategies.\n\n\nApr 10, 2007 PA Department of Environmental Protection\n\n\n\nProposed Marshalltown power plant capable of burning biomass\n\n\n\nDES MOINES, Iowa (AP) - A new $1 billion power plant planned to be built in Marshalltown will be able to burn biomass fuels such as switchgrass to reduce the use of coal. Interstate Power and Light Co., a subsidiary of Madison, Wis.-based Alliant Energy Corp. said it is designing the plant so that it could burn switchgrass or other biomass fuels. Company spokesman Scott Drzycimski said decisions ...\n\n\nApr 10, 2007 AOL.com\n\n\n\nDTE Energy chief to testify about utility regulations\n\n\n\nDTE Energy Chairman and Chief Executive Officer Anthony Earley Jr. will testified before the Michigan House of Representative's Energy & Technology Committee Wednesday morning about changes to  the state's utility regulatory environment. Earley is expected to call for the repeal of the Electric Choice provisions of Michigan Public Act 141, which was adopted in ...\n\n\nApr 11, 2007 The Detroit Free Press\n\n\n\n\n\nBlake: REAs fight subsidized power\n\n\n\nColorado's rural electric cooperatives surrendered on the issue of renewable energy standards this year. But they claim they're not going to give in on another bill mandating much more 'net metering.' That's a system that allows customers to generate their own electricity - using windmills or solar panels - and sell what they don't use back to their REA. Under House Bill 1169, to the extent their ...\n\n\nApr 11, 2007 Rocky Mountain News\n\n\n\nU.S. 60 gas leak plugged\n\n\n\n(Gleaner photo by Amber Douthit) Henderson police officers rerouted all traffic from U.S. 60-West at the South Y after a natural gas leak was discovered near Canoe Creek. The two to three hour road closure caused heavy traffic and congestion on U.S. 41-Alternate and Kentucky 425. Officials were able to plug a leak in a high-pressure gas line that supplies the industrial park in Corydon Tuesday ...\n\n\nApr 11, 2007 Evansville Courier\n\n\n\nNACo launches Green Government Initiative\n\n\n\nThe Washington-based National Association of Counties (NACo) is offering assistance to counties that are exploring \"green\" technology. The new Green Government Initiative will provide counties with information on energy efficiency, renewable and alternative energy, green building, air quality, water quality, and land use. NACo's County Services Department and Financial Services Center, supported ...\n\n\nApr 10, 2007 American City & County\n\n\n\nWoodstock, N.Y., takes on global warming war\n\n\n\nMichael Hill / Associated Press WOODSTOCK, N.Y. -- Michael Esposito rides his bike all the time -- on cold nights when leaving his old job at a natural food store and warm days while passing shops selling yoga clothes and soy drinks. So the 67-year-old is excited about a new plan to reduce this countercultural haven's net carbon dioxide emissions to zero within a decade, an ambitious attempt to ...\n\n\nApr 11, 2007 Detroit News\n\n\n\n\n\n365 Main Joins The Green Grid to Advance Energy Efficiency in the Data Center\n\n\n\n365 Main today announced that it has joined The Green Grid, a global nonprofit consortium of technology companies and professionals dedicated to advancing energy efficiency in data centers and business computing ecosystems. Formed earlier this year, The Green Grid is committed to driving new user- centric metrics, technology standards and best practices for use by data center managers worldwide. ...\n\n\nApr 10, 2007 PR Newswire\n\n\n\nFitch Rates PE Environmental Funding LLC, Series A\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings rates PE Environmental Funding LLC, senior secured sinking fund environmental control bonds, series A as follows: --$28,450,000 4.9820% tranche A-1 'AAA'; --$25,700,000 5.2325% tranche A-2 'AAA'; --$50,700,000 5.4625% tranche A-3 'AAA'; --$9,975,000 5.5225% tranche A-4 'AAA'. The collateral securing the bonds consists primarily of environmental control ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nAdcock to Head Green Team at World Energy\n\n\n\nWORCESTER, MA, April 11 /PRNewswire-FirstCall/ - World Energy Solutions, Inc. (TSX: XWE) announced today that Rick Adcock has been named senior vice president for environmental markets. Adcock joins World Energy with more than 20 years of experience in the international renewable energy and carbon emissions management industries, including leading roles as a federal policy developer, clean energy ...\n\n\nApr 11, 2007 PR Newswire\n\n\n\nMilitary Moves to Solar Power, Hires Akeena Solar for the Job\n\n\n\nLOS GATOS, Calif.--(BUSINESS WIRE)--The California Air National Guard is switching to solar power for the operation of its armory in Fresno. The Guard hired MCC Construction and Akeena Solar (OTCBB:AKNS), already one of the state's biggest residential installer of solar systems, to do the multimillion-dollar job. Many government agencies are discovering that there never has been a better time to ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nSan Francisco Geothermal Workshop Speakers Announced\n\n\n\nThe preliminary agenda and confirmed speakers for the first annual West Coast Geothermal Energy Development and Finance Workshop were released today by the Geothermal Energy Association. The event, sponsored by Ormat Technologies and Glitnir Bank, will take place May 10, 2007 at the Hyatt Regency San Francisco, Embarcadero Center. The daylong workshop will bring together leading geothermal ...\n\n\nApr 10, 2007 PR Newswire\n\n\n\nTimetable Adjusted for Rockdale- West Middleton Electric Transmission Line Project\n\n\n\nMADISON, Wis.--(BUSINESS WIRE)--American Transmission Co. is modifying its filing date to the Public Service Commission of Wisconsin by at least three months for the Rockdale-West Middleton 345-kilovolt transmission line project. Originally, ATC planned to file its construction application with the PSC in June, but will now target October 2007. We are being responsive and responsible to the ...\n\n\nApr 10, 2007 Business Wire\n\n\n\n\n\nBHP weighs LNG decision; other gas projects could test California\n\n\n\nother efforts could further test California's tolerance for liquefied natural gas facilities along its coast.Observers differ on how similar bids might fare after the State Lands Commission's decision Monday to deny Australian energy company BHP Billiton LNG International Inc. a lease for pipelines essential to the project.Environmentalists applauded the move and said the hundreds of opponents ...\n\n\nApr 11, 2007 Sacramento Bee\n\n\n\nSolar power plants starts to deliver\n\n\n\nSpread across a Portugese hillside pasture amid olive trees, 52,000 photovoltaic modules are generating some 11MW in one of the world's largest solar power plants. This joint venture between , PowerLight Corp and Catavento SA could supply 8,000 homes.The 150-acre site, at Serpa, is 200km southeast of Lisbon in one of Europe's sunniest areas. It will remain as productive farmland while the ...\n\n\nApr 10, 2007 Engineer Live\n\n\n\nEnron Investors ask U.S. Supreme Court to Review Class-Action\n\n\n\nEnron shareholders and investors on April 5 asked the U.S. Supreme Court for help in their effort to recoup billions of dollars they lost in the once-mighty energy company's collapse. Shareholders and investors filed a motion asking the court to review an appeals court ruling that halted their class-action lawsuit against investment banks and firms. The $40 billion (euro29.9 billion) suit alleges ...\n\n\nApr 10, 2007 Insurance Journal\n\n\n\nCalifornia Assembly panel approves several bills on electricity\n\n\n\nA bill that would require California to have 33% of its electricity usage come from renewable resources by 2020 is among a handful of bills that cleared the California Assembly Utilities and Commerce Committee late Monday. The renewable bill, AB 94, sponsored by Assemblyman Lloyd Levine, would codify goals set by Governor Arnold Schwarzenegger calling for a renewable portfolio standard of 33% by ...\n\n\nApr 11, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nGain An Insight Into Nuclear Energy In India\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c53626) has announced the addition of Nuclear Energy in India to their offering. In the last few years, demand for power in India has been growing faster than supply, due to increased manufacturing activity. This has resulted in a net deficit of about 10-14%. Over 65% of power generated currently is ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nMission accomplished: Iran claims industrial uranium enrichment capability\n\n\n\nNATANZ, Iran -- Iran's announcement that it had achieved the capacity to enrich uranium on an 'industrial scale'' raises the fear that the Islamic Republic could manufacture a nuclear weapon within a year and could put Iran in a more powerful position in negotiations with the West. President Mahmoud Ahmadinejad, speaking Monday at an annual commemoration of his nation's nuclear program, described ...\n\n\nApr 10, 2007 Charleston Daily Mail\n\n\n\nEDF Energies Nouvelles Announces the Order Of 150MW of Turbines From REpower For Its Wind Activity in The USA\n\n\n\nPARIS--(BUSINESS WIRE)--Regulatory News: EDF Energies Nouvelles (Paris: EEN) continues its expansion programme in the USA with orders for 75 wind turbines for 2008. This new order follows a series of orders undertaken for the US continent, including the one announced last March, for a capacity of 276MW from GE Wind. The turbines, which have a unit capacity of 2MW, will be supplied by the German ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nGE Wind Turbines Deliver over 1 Gigawatt of Additional U.S. Capacity in 2006\n\n\n\nATLANTA--(BUSINESS WIRE)--Reaffirming its position as the leading supplier of technology and services for the U.S. wind industry, GE Energy (NYSE: GE) provided wind turbines representing over 45% of the countrys new wind capacity in 2006. The American Wind Energy Association (AWEA) reported today that U.S. wind power generating capacity increased by 27% in 2006 and is expected to increase an ...\n\n\nApr 11, 2007 Business Wire\n\n\n\nIf gas prices have fallen, why haven't energy bills?\n\n\n\nEnergy giants have been criticised for failing to cut their prices despite a sharp drop in the cost of wholesale gas. At least 23million households are still waiting for the savings to be passed on. While wholesale gas costs have dropped by 50 per cent since June last year, energy bills, typically 1,000 a year, have failed to fall by a single pence. Just two of the six energy giants, British Gas ...\n\n\nApr 10, 2007 Evening Standard\n\n\n\nThreat of energy expropriation in Latin America casues spike in political risk\n\n\n\nPolitical risk trends in emerging markets are taking on a troublesome retro feel back to the 70s, in a sense  led by energy-sector expropriation moves in South American countries, A.M. Best has reported. The A.M. Best analysis cites the findings of a political risk index calculated by the emerging markets team at broker Alliant Insurance Services Inc. According to A.M.\n\n\nApr 10, 2007 Canadian Underwriter\n\n\n\nCalif. panel votes against key lease for LNG proposal off Malibu\n\n\n\nnot to award a lease essential to a proposed liquefied natural gas terminal off the Southern California coast, citing environmental concerns. In the 2-1 vote, commissioners complicated efforts by Australia's BHP Billiton LNG International Inc. to build an $800 million terminal in the ocean northwest of Los Angeles, about 14 miles off Malibu and about 20 miles off Oxnard.\n\n\nApr 10, 2007 San Francisco Chronicle\n\n\n\nFirms link on project to explore for LNG\n\n\n\nSYDNEY: Exxon Mobil and partners in three natural gas fields in Papua New Guinea agreed to study a potential liquefied natural gas project in the Pacific nation that could cost as much as $7 billion. About $60 million is expected to be spent on initial studies over the next year, to be shared between Exxon, Oil Search, Santos and Nippon Oil, the Port Moresby-based Oil Search said Wednesday in a ...\n\n\nApr 11, 2007 International Herald Tribune\n\n\n\nRussia to commission first floating nuclear power plant by 2010\n\n\n\n- The first floating nuclear power plant in Russia will be commissioned in 2010, according to deputy prime minister Sergei Ivanov. 'We are starting the construction of floating nuclear power plants. The first one will be commissioned by 2010 and supply electricity to all of Severodvinsk,' said Ivanov. 'Construction of seven power plants of the kind for the Extreme North and the Far East is ...\n\n\nApr 10, 2007 Power Engineering\n\n\n\nNational Instruments Hosts Oil and Gas Industry Symposium in 13 Cities\n\n\n\nAUSTIN, Texas--(BUSINESS WIRE)--National Instruments (Nasdaq:NATI) today announced the 2007 Oil and Gas Industry Symposium, a one-day complimentary seminar that reaches 13 major drilling and exploration cities across North America, South America and Europe. The industry event highlights case studies from Shell Global Solutions, Bjrge and FAG Industrial Services (FIS).\n\n\nApr 10, 2007 Business Wire\n\n\n\nTriple Point Wins Gold Award for ''Excellence in Energy Technology''\n\n\n\nWESTPORT, Conn.--(BUSINESS WIRE)--Triple Point Technology, the leading global supplier of cross-industry software platforms for the supply, trading, marketing and movement of commodities, has been recognized with the prestigious Gold Award for Excellence in Energy Technology by Commodities Now Magazine following extensive industry voting. 'These awards have been the most successful yet with over ...\n\n\nApr 10, 2007 Business Wire\n\n\n\nHuaneng Power International, Inc. Power Generation Increases by 7.61% in the First Quarter of 2007\n\n\n\nBEIJING, April 10 /Xinhua-PRNewswire-FirstCall/ -- Huaneng Power International, Inc. (the 'Company') (NYSE: HNP; HKEx: 902; SSE: 600011) today announced its power generation in the first quarter of 2007. Based on the Company's preliminary statistics, for the first quarter ended March 31, 2007, the Company's total power generation based on a consolidated basis amounted to 38.867 billion kWh.\n\n\nApr 10, 2007 PR Newswire\n\n\n\nCalifornia rejects natural gas terminal for BHP Billiton\n\n\n\nSYDNEY: The California State Lands Commission has rejected a proposed $800 million liquefied natural gas import terminal that BHP Billiton, Australia's biggest oil and gas producer, planned to build off the coast. The three-member commission voted two-to-one against certifying the environmental report on the project and against granting an essential pipeline lease, Paul Thayer, a spokesman for ...\n\n\nApr 10, 2007 International Herald Tribune\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}