{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News With Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood afternoon.  \n \nThis is Harry Smith, filling in for Katie. \n \nThose wildfires are continuing to scorch their way\n  through the woodlands of Northern California.  \n  But firefighters finally have good weather on their side, which may be\n  helping to slow the blaze.  Bill Whitaker will have details from near Lake Tahoe. \n \nIn Washington,\n  President Bush has lost another key ally in the war against Iraq, Sen. Richard Lugar.  Lugar\n  has announced that he believes the president’s Iraq strategy is not working and that he\n  thinks it’s time for the United States to scale back its\n  military involvement in the war.  What does this mean for the White House? \n  Chief White House correspondent Jim Axelrod will report.  \n \nSome of Washington’s\n  most mysterious secrets are contained in the files of the CIA that have been\n  sealed for decades – until now.  Today, many of those files were opened\n  for the first time, most dating from the days of the Cold War.  National\n  Security correspondent David Martin will give us a first look at what’s\n  inside, and the secrets they reveal.   \n \nOn Capitol Hill, hearings began today on the\n  long-term harm some well-known NFL players are experiencing from their years\n  on the field.  Correspondent Cynthia Bowers will begin a two-part series on\n  some of the serious damages these players are experiencing – from\n  concussions to brain injury – and what is or is not being done about\n  it.     \n \nAnd our Byron Pitts will have the latest on the\n  circumstances surrounding the shocking deaths of WWF star Chris Benoit, his\n  wife and 7-year-old-son – deaths which authorities are describing as an\n  apparent murder-suicide.  \n \n \nSee you tonight,\n \n\n\n\n\nHarry Smith\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}