{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Michelle Childs <michelle.childs@cptech.org>", "subject": "[Ip-health] ] Nathan, Aligning pharmaceutical innovation with medical need", "body": "--\n[ Picked text/plain from multipart/alternative ]\n\n\nBegin forwarded message:\n\n> From: Soenke Zehle \n> Date: 13 April 2007 13:06:08 BDT\n> To: a2k@lists.essential.org\n> Subject: [A2k] Nathan, Aligning pharmaceutical innovation with\n> medical need\n>\n> Aligning pharmaceutical innovation with medical need\n> Authors: Nathan, C.\n> Produced by: Nature [journal] (2007)\n> \n>\n> This paper asks explores policies on how vaccines and medicines can be\n> developed to address the diseases facing the poor in the developing\n> world and how they can be made more accessible. The paper argues\n> that a\n> fundamental solution to these problems requires aligning three basic\n> processes-innovation, incentive and access-so that they become\n> mutually\n> reinforcing.\n>\n> The present patent system provides incentives for innovation by\n> enforcing product monopolies that permit sales at prices far above\n> production cost. Industry has little financial incentive to develop\n> products for diseases that mainly afflict the poor, and the poor\n> cannot\n> afford products that industry develops for wealthier customers. The\n> paper argues that two reforms could correct these disparities and\n> benefit all stakeholders:\n>\n> * open-access drug companies would bring new ideas and expertise to\n> the\n> development of drugs independent of market drivers\n>\n> * a patent track that rewards innovation in proportion to its\n> impact on\n> the global burden of disease would provide an incentive for pricing\n> near\n> the cost of production and commit government and business to improving\n> health care delivery.\n>\n> The paper puts forward a number or suggestions:\n>\n> * the establishment of open-access drug companies through public-\n> private\n> partnerships which would prioritise projects that offer hope of\n> meeting\n> substantial medical needs that are not otherwise likely to be\n> addressed\n>\n> * establishing a government funding system which would reward\n> pharmaceutical companies who reduce the global burden of disease. Drug\n> companies would benefit as additional diseases became rewarding to\n> treat\n> and new populations became medical consumers.\n>\n> The paper concludes that through realigning research and development\n> funding, governments can re-aligned incentives through the patent\n> system\n> which would contribute to the fight against global disease.\n> _______________________________________________\n> A2k mailing list\n> A2k@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/a2k\n>\n\nMichelle Childs\nmichelle.childs@cptech.org\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}