{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 7, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESKansas Tornado Survivors Return To Ruin\nResidents of a Kansas town left mostly destroyed after a devastating F-5 tornado will be allowed to visit their homes today.\n                        Meanwhile, rescue workers continued to search for more victims as the storm's death toll reached 10. More...Watch: Storm Decimates Kansas Town\n• Spider-Man 3 Smashes Box Office Records• France Elects U.S.-Friendly Conservative\n                     \t\t\t\t\t| Watch• Bush's GOP War Support Fading?U.S.A Thrift-Shop Jackson Pollock Masterpiece?\nTeri Horton knew nothing about art when she bought a big, drippy painting for $5 years ago in a thrift store. But now she\n                        says a fingerprint proves it is a $50 million Jackson Pollock original. CNN's Anderson Cooper reports.  More...Watch: Thrift Store Masterpiece?\n• Kansas Tornado Survivors Return To Ruin\n                     \t\t\t\t\t| Watch• LAPD Acts Against Elite Police Squad• Lou Dobbs, \"Advocacy\" Journalist?\n                     \t\t\t\t\t| Watch• More StoriesWorldFrance Elects U.S.-Friendly Conservative\nNicolas Sarkozy, a blunt and uncompromising pro-American conservative, has won the French presidency. Scattered protests greeted\n                        the new leader, who now must unite a divided public to tackle tough issues including immigration and a sluggish economy. More...Watch: France Elects Next President\n• Switching Sides: Inside The Enemy Camp• Iraq's Christian Minority Flees Violence• New Bombs After Bloody Sunday In Iraq• More StoriesPoliticsBush's GOP War Support Fading?\nThe House Republican leader has said President Bush could lose the support of his party if the chosen path in Iraq doesn't\n                        bare fruit by this fall. However, Minority Leader John Boehner said Mr. Bush's \"surge\" plan deserves a chance to work. More...\n• Gingrich: No '08 Decision Until September\n                     \t\t\t\t\t| Watch• Obama Carefully Courts Jewish Vote\n                     \t\t\t\t\t| Watch• Rangel: Bush Must Compromise On Iraq\n                     \t\t\t\t\t| Watch• More StoriesHealthParents Can Make Shots Easier To Take\nA study finds that telling jokes, reading books, bringing favorite toys from home, even blowing soap bubbles all ease children's\n                        anxieties about immunizations. Apologizing or reassuring too much may make the situation worse. More...\n• Younger Girls Binge Drinking More\n                     \t\t\t\t\t| Watch• Siblings Of Autistic Kids Also At Risk• Brazil Overrides Patent For AIDS Drug\n                     \t\t\t\t\t| Watch• More StoriesSciTechE-Mail Etiquette: The Do's and Don'ts\nThe \"e\" in e-mail might as well stand for \"essential\": Most of us have become hopelessly dependent on communicating with e-mail.\n                        But as Daniel Sieberg notes, many of us can use tips on how to use this technology for good, not evil.  More...\n• Dell Joins Microsoft, Novell Alliance• Fix It Or Nix It? \n                     \t\t\t\t\t| Watch• Monkey In The Middle• More StoriesBusinessGas Prices Jump To New Record\nGasoline prices have surged to a record nationwide average of $3.07 per gallon, nearly 20 cents higher than two weeks earlier,\n                        oil industry analyst Trilby Lundberg said Sunday. More...\n• Alcoa Bids For Canadian Aluminum Rival• Dell Joins Microsoft, Novell Alliance• Financial Spiders\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentSpider-Man 3 Smashes Box Office Records\nSpider-Man caught just about everyone in his web. The superhero's latest adventure, \"Spider-Man 3,\" smashed box-office records\n                        with $148 million in its first three days, according to studio estimates Sunday. More...\n• Could Jail Time Help Paris Hilton?\n                     \t\t\t\t\t| Watch• Benson's Not Asleep At The Wheel\n                     \t\t\t\t\t| Watch• It's A Summer Of Sequels\n                     \t\t\t\t\t| Watch• More StoriesOpinionWhat War? We Have Sanjaya!\nSunday Morning commentator Nancy Giles wonders where our priorities are. Why does the news media give as much\n                        or more coverage to Alec Baldwin as it does to a war Iraq? More...\n• Trying To Make Sense Of The Papers• Campaigning In The TV Age• The AWOL President\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Missing:  Khoi Vu\nLook here for numbers to call with tips on the possible whereabouts of missing people profiled on Without A Trace,\n                        and shown on The Early Show. The latest: Khoi Vu. More...Watch: Mother Vanishes, Family Dead\n• 60 Minutes: Lou Dobbs, \"Advocacy\" Journalist?\n                     \t\t\t\t\t| Watch• 60 Minutes: A Thrift-Shop Jackson Pollock Masterpiece?\n                     \t\t\t\t\t| Watch• 60 Minutes: Switching Sides: Inside The Enemy Camp\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nTracking The Midwest TornadoesRuss Mitchell talks to Reed Timmer, a storm chaser who has been tracking the powerful Midwest tornadoes that have touched\n                                    down in five states.\nTOP VIDEOS\nMIA Soldier Laid To Rest\nTexas State Lottery For Sale\nBinge Drinking Pitfalls\nStorm Decimates Kansas Town\nFrance Elects Next President\nFace The Nation, 05.06.07\nRoyalty At The Kentucky Derby\nGreensburg Reduced To Rubble\nRepercussions Of Bush's Veto\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}