{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Arnoud Engelfriet <arnoud@engelfriet.net>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Francesco Poli wrote:\n> On Tue, 17 Apr 2007 21:41:45 +0200 Arnoud Engelfriet wrote:\n> > Yes, these are vague criteria but that is to a certain extent\n> > inherent in trademark law. You don't know what people will do\n> > and how that can affect your trademark.\n> \n> Wait, the Debian Project should clarify the intended meanings of the two\n> different logos, in order to inform users upfront about which uses will\n> be considered OK, and which will be deemed to be abuses...\n\nOk, then I would suggest moving that out of the first sentence and\ninto a new paragraph. \"The above exception only applies for the\nsituations described in Exhibit Z\". Then you can write an Exhibit Z\nfor your own trademark(s).\n\n> | The sign [X] (hereafter \"the Mark\") is a trademark, rights to which\n> | are held by [Y] (hereafter \"the Mark Holder\"), representing [Z].\n> \n> AFAIUI, this means that the sign [X] is a trademark that means or refers\n> to [Z].\n\nRight. My problem with that is that Z can change over time, but\nthe definition of Z won't change with that. \n\n> The trademark license should forbid people to use [X] to mean or refer\n> to something that is *not* [Z].\n\nSuppose Debian becomes a free hardware company too. The license\nwould still refer to software only, as it was written before\nthat happened. Then can I use the sign Debian to promote my\nproprietary hardware company? The license only said I couldn't\ncreate confusion with the software parts of Debian.\n\n> [X] = Debian Open Use Logo\n> [Z] = Debian Project and Debian distributions\n> Nobody is allowed to use [X] (or a confusingly similar sign) to refer to\n> IBM, or to Slackware, or to Microsoft, or to MacOS X, ...\n\nEhm, you can't do *that* in a trademark license. You can only complain\nif people use X to create confusion in relation to *you*.\n\nSaying \"don't create confusion with anyone\" goes beyond what you\nare allowed with your trademark.\n\nAnyway, in summary I think it could work to have some Z in there\nbut I also think an exhibit is better. That at least avoids the\nimpression that Z has to fit in (one part of) a single sentence,\nwhich probably is too short for most cases.\n\nArnoud\n\n-- \nArnoud Engelfriet, Dutch & European patent attorney - Speaking only for myself\nPatents, copyright and IPR explained for techies: http://www.iusmentis.com/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}