{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Abbott cuts price of Kaletra", "body": "First Stocrin, now Kaletra... more positive ripples for other\ncountries from the Thailand CLs.  Unfortunately, this doesn't mean\nthat Abbott is changing its deplorable position on releasing new\ndrugs in Thailand.\n\nhttp://pharmalot.com/2007/04/abbott_lowers_price_of_kaletra.php\n\nApril 10, 2007\nAbbott Lowers Price Of Kaletra AIDS Drug\n\nThe drugmaker has agreed to lower the cost to $1,000 per patient per\nyear in more than 40 low- and middle-income countries, as defined by\nWorld Bank criteria. This includes India, Brazil and China. And\nAbbott will \"immediately begin discussions with countries where (its)\npatents are respected\" to increase the number of patients who can\nobtain Kaletra at the new price.\n\nAnd what about Thailand? Abbott says it \"fully respects and\nappreciates the suggestion of World Health Organization director-\ngeneral Margaret Chan that more work needs to be done with the\ngovernment of Thailand to achieve a positive outcome.\" Meanwhile,\nKaletra capsules remains available in Thailand at the new price, as\nopposed to the older $2,200 price.\n\nThis is the first sign that Abbott is doing something other than\nplaying hardball with the Thai military government, which recently\nissued compulsory licenses for Kaletra and two other drugs sold by\nMerck and Sanofi-Aventis. Unlike the others, Abbott has refused to\nnegotiate and, instead, threatened not to sell new meds in the country.\n\nUnfortunately, this statement is worded so vaguely that it's hard to\ntell what, if anything, Abbott is doing besides lowering its price.\nHas Miles White and his team agreed to wide-open talks? Is the\ndrugmaker backing away from its threat not to sell new drugs there?\nOr is the wording a polite way to tell Chan that she's not doing enough?\n\nAn Abbott spokeswoman says the drugmaker has \"been willing to talk\"\nto the Thai government, and denies reports that Abbott isn't\nattending a session this week involving Thai officials, Merck and\nSanofi-Aventis. However, the company isn't interested in discussing\nroyalties on generic versions of Kaletra. And for now, Abbott isn't\nchanging its mind about selling new meds there.\n\nThe drop in price is clearly designed to defuse tensions, and not\njust in Thailand. Whether the move will soften the Thai military is\nanother matter. The government seems determined to stick to its plan\nto issue compulsory licenses, and that could mean more showdowns.\n\nThe complete Abbott statement is here.\nhttp://www.abbott.com/global/url/pressRelease/en_US/60.5:5/\nPress_Release_0442.htm\n\nThe Bangkok Post yesterday on Abbott shunning talks.\nhttp://www.bangkokpost.com/topstories/topstories.php?id=117965\n\nPosted by Ed Silverman\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}