{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 5/3/07 - Poetry and Manual Labor", "body": "May 3, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nBeing Right or Making Money\n\nThe $11 Billion Retailer Whose Stock Jumped 27%\n\nCrossing the Blood-Brain Barrier\n\n-----\n\nToday we open and close with quotations from Alfred, Lord Tennyson.   \n\nFirst comes the oft-quoted . . . and oft-misquoted, \"In the Spring a young\nman's fancy lightly turns to thoughts of love.\"  He might have added\nbaseball - here in Massachusetts the Red Sox are way out in first place\nwhile their archrivals, the Yankees, are last - but Tennyson was English. \nFor the same reason, he wouldn't have mentioned football, though the\nrecent acquisition of Randy Moss has renewed fans' hopes that the New\nEngland Patriots will regain the Super Bowl trophy this year.  And he\nmight have mentioned yardwork, but perhaps that was too pedestrian a\nsubject for him   It's not for me.\n\nIn recent days I've been cleaning the yard of winter debris - particularly\ndebris from the big old silver maple - clearing the perennial garden of\nlast year's leftovers, putting out lawn furniture, repairing the walls of\nmy tiny pond and preparing the blueberry patch by \"mowing in\" the\nChristmas tree branches as mulch.   \n\nOne sad job was cutting down the beautiful weeping cherry tree that had\nsuccumbed to two years of attacks by winter moths.  No buds this spring,\nno life, so down it came.  Part one, felling the tree with a chain saw,\nwas easy.  Part two, removing the root ball, is hard work, and not yet\ncomplete.\n\nBut when I enlisted my son - and a friend of his who was visiting - to\nhelp with the manual labor, he complained (though only once),   \n\"When I go over to my friends' houses, their dads never make me work.\"  I\ncountered with the traditional, \"It builds character.\"\n\nWhat I mean, of course, is that shared labor brings shared rewards and a\nsense of accomplishment.  And in these digital days, physical labor\nprovides a needed respite from the world of pixels that absorbs so much of\nboth his and my time.  Furthermore, this is what I did with my father -\ncutting wood, digging holes, mending fences.  In enlisting his help, I'm\nalso passing along family values.\n\nAs for dragooning a visiting friend when the opportunity arises; that way\nI get two bodies and - theoretically - twice as much work done.   \nAnd maybe it builds the friend's character, too!\n\n-----\n\nCharacter, of course, is a commodity that has been in short supply in some\ncorners of the investment world in recent years.  Thus the implementation\nof Sarbanes-Oxley in 2002.  The law undoubtedly has its good and bad\npoints, and I have no reason to get into them today.  But thinking of this\n- for some reason - gets me thinking of the title of one of my favorite\nbooks on investing, and that leads to a subject worth discussing.\n\nThe book is \"Being Right or Making Money,\" authored by Ned Davis in 1991. \nSome parts of it are dated, while others are timeless, but to me, the most\nvaluable part of the book is the title!  If it makes sense to you right\naway, congratulations.  If not, let me explain.\n\nWe all have opinions about the market and about individual stocks.   \nGiven a little prompting, most of us will express them!  But what are\nthese opinions worth?  Usually very little.  More importantly, given a\nchoice between listening to the market or listening to an opinion - even\nyour own - what should you do?  Listen to the market!   \nEspecially if it means admitting that you were wrong.\n\nThe goal, remember, is not to prove how right you are or how smart you\nare.  The goal is to make money.  Simple.\n\nBeing wrong is a normal part of investing.  Each of us is wrong about half\nthe time - some more and some less.  But there's nothing wrong with being\nwrong.  The key to successful investing is recognizing quickly that you\nwere wrong, and taking action to get in the right.\n\nTypically that means cutting losses short.  That's a lesson that's usually\nlearned the hard way; it's human nature to argue with the stock.  But\naround the fourth or fifth time they get socked with losses exceeding 20%,\n30% or more, most investors accept the fact that it's important to cut\nlosses short.\n\nSome, however, continue to have more confidence in either themselves or\nthe companies they invest in than is warranted.  For example, a reader\ncalled the office just this week, and referred to my last issue, in which\nI discussed both XM Satellite Radio and Sirius Satellite Radio.  He\nconfessed he'd bought both stocks near their peaks, back at the 2000\nmarket top, and was still holding them today.\n\nBy my calculations, XMSR is down 77% from its peak, while SIRI is down\n96%.  Both companies make great products, but both have turned out to be\nsuperbly bad investments, in part because both managements have spent so\nmuch money, and in part because both came public when investor sentiment\nwas - in retrospect - sky-high.\n\nIf you've been investing awhile, you've heard about cutting losses short,\nand I apologize for taking your time if you've already learned the lesson.\n But if you haven't learned, and especially if you're a newer investor . .\n. please pay attention.  If you're young and so inclined, you might even\nwant to tattoo these words on your bicep.   \n\"Cut losses short.\"\n\nThe goal is not to prove yourself right. The goal is to make money.\n\n\n----- Advertisement -----\n\nGrow 50% or Pay Nothing!\n\nWhen Intuitive Surgical represented the best growth story on Wall Street\nin August 2004, we quickly named it Stock of the Month. Since then it's\nhanded investors 600% gains.\n\nWhen we could see that Apple Computer's earnings momentum was shooting\nthrough the roof in October 2004, we named it Stock of the Month. It was\nselling for a shockingly low $35 per share. Today, (adjusted for a 2-for-1\nsplit) it has turned a $10,000 investment into $43,000.\n\nWhen the rest of Wall Street felt that Google's best days were behind in\nJuly 2005, our research said the tear would continue. Six months after we\nnamed it Stock of the Month, my readers saw the stock gain an incredible\n$160 a share.\n\nThere are 16 more Stocks of the Month I could name that have handed us an\n88% average profit per stock over the past two years...\n\nIntroducing Cabot Stock of the Month - Try It Risk Free for the Next 12\nMonths...\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/171995/13148861/86/0/\n\n-----\n\nAnd now, on to some stocks.  On Monday of this week the computer told us\nto write up Amazon.com in Cabot Top Ten Report.  That's the publication\nthat analyzes the market's ten strongest stocks every Monday, and the\nreason for Amazon's inclusion was no surprise - the stock had surged 27%\nin one day after announcing a pretty good earnings report.  Not shockingly\ngood, but much better than expected.\n\nRevenues grew 32% to $3.02 billion, while earnings jumped 117% to $0.26\nper share.  The reason for the divergence in growth rates?  An after-tax\nprofit margin that swelled from 2.2% to 3.7%.  In retail, that makes for\nan enormous improvement.\n\nSo who drove the stock up 27%?  Institutions, who love a stock like this. \nWith a float of 307 million shares, there's plenty of supply to go around.\n And with virtually guaranteed growth of revenues every year, it's hard to\ngo wrong in the long run.\n\nIn the short run, Amazon's chart is interesting.  After peaking at 61 in\nOctober 2003, the stock fell for nearly three years, bottoming at 26 in\nAugust 2006.  And in the eight months since then, Amazon has been a stock\non the rebound.  Last week's spike higher put the icing on the cake,\nactually sending the stock up above its old 2003 high of 61.  And that's\nwhere it sits today, catching its breath.\n\nBut do I like it as in investment?  Not really.  I used to, years ago,\nwhen people were still afraid that Amazon would never earn a dime.  The\ntime to buy was when there was skepticism about the company.\n\nNow there's no skepticism; institutions are falling all over themselves to\nget a piece of this company.  I still like Amazon as a convenient place to\nshop, just like millions of other people around the world . . . 45% of the\ncompany's business is now international.   \n\nBut as an investment, I prefer the road less traveled.\n\n----- \n\nWhich brings me to Xenoport.  Most investors have never heard of XenoPort;\nI know I hadn't until Monday.  But there it was, chosen, along with\nAmazon, as one of the market's top ten stocks.\n\nSo we wrote it up, learned why it was so strong, and became intrigued\nenough to pass this knowledge on to you . . . with a warning.\n\nXenoPort (XNPT) is a young company working to develop new drugs.   \nIt's never sold a single product and never made a single dime, and if it\nfails to do so, its stock will almost surely sink.\n\nHowever . . . the stock is strong today because investors with high hopes\nhave been buying.  Here's what we wrote in Cabot Top Ten on Monday.\n\n \"XenoPort, located in Santa Clara California, is working to develop drugs\nthat treat central nervous system (CNS) disorders.  It's working on\ntreatments for gastroesophageal reflux, neuropathic pain, spasticity,\nParkinson's disease and migraines.  But its biggest product, and the one\nthat caused a stir last Wednesday, is XP13513, a formulation designed to\ntreat restless leg syndrome (RLS).  The company reported that it ran a\ntwelve-week, double-blind, placebo controlled study on 222 patients, and\nat the end of the study 76% of patients receiving XP13513 were \"much\nimproved or very much improved\" while only 39% of patients receiving the\nplacebo reported the same result.  And that's statistically significant. \nThe science behind this achievement is proprietary (of course) Transported\nProdrug technology that uses the body's natural mechanisms to actively\ntransport nutrients through cellular barriers, and if it can work for a\nwide variety of drugs, this company could be really big.  That's one\nreason for the market valuation of over $1 billion today!  First quarter\nearnings results will be released May 8, but we don't expect anything as\nbig as last week's announcement . . . XNPT came public at 11 in June 2005,\nand has jerkily made its way up to the current level since.  In the early\ndays trading volume was very light, and even until last week it was below\nthe threshold we require for orderly trading. But now it's hit the big\ntime.  Last Wednesday's announcement saw the stock soar from 29 to 42, and\nif you're in the mood for an aggressive speculation, you can take a small\nposition here,\"\n\nDigging a little deeper into the story, we see that XenoPort's science is\nfocused on identifying specific high-capacity nutrient transporter\nproteins found in cells that line the gastro-intestinal tract.   While\ntraditional drugs are expected to passively diffuse through the GI wall\ninto the bloodstream, XenoPort aims to achieve active transport by using\ntarget transporter cells to deliver medications more quickly and, ideally,\nin more controllable doses.\n\nXenoPort has already profiled hundreds of transporter cells in many tissue\ntypes (including healthy and tumor tissues) and developed functional\nassays for about 80 of these transporters.  One of the trickiest parts of\nthe business is achieving transport across the blood-brain barrier (BBB),\nto access the central nervous system.  And now the company is working on\ncreating drugs that incorporate chemical features that allow them to be\nrecognized by specific transporters.  The drug for Restless Leg Syndrome\nis in the most advanced stage of all the company's drugs, but there's\nlittle doubt it will be followed by others.\n\n To me, it sounds like a technology with a wide - and very profitable -\nrange of applications.  And that piques my interest.\n\nToday, the stock is still at 42, having pulled back slightly from last\nThursday's high of 44.  That's solid action, technically, and reason to\nbelieve that the uptrend will continue.\n\n-----\n\nEditor's Note\n\nCabot Top Ten Report comes to your email inbox once a week with capsule\nanalyses of the market's ten strongest stocks.  Some are big, some are\nsmall, some are young and some are old.  Our job is to describe why each\none is strong, to give you an idea of how likely that strength is to\ncontinue, and to provide a follow-up in each issue until we tell you to\nsell.  It's the single best way we know to find great growth stocks in\ntheir early stages . . . stocks like Hansen Natural, Titanium Metals and\nUltra Petroleum.  To get started with a no-risk trial subscription, simply\nclick the link below.\n\nhttp://cabotmail.net/t/171995/13148861/81/0/\n\n-----\n\nAnd here's the second quote from Tennyson. \"Blind and naked ignorance\ndelivers brawling judgments, unashamed, on all things all day long\"\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=171995&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}