{"category": "spam", "to_address": "smiles@speedy.uwaterloo.ca", "from_address": "Elizabeth & Deacon Leonard Ashley <leonard_700@mail.com>", "subject": "", "body": "Dear In Christ,\nThe time has come for Christians to worship God in spirit and in truth\naccording to the book of John chapter 4:vs23-24.``But the hour cometh\nand now is when the true worshipers shall worship the Father in spirit\nand in truth: for the Father seeketh such to worship him . God is a\nspirit, and they that worship him must worship him in spirit and in\ntruth. Based on this scripture, it became obvious that I should do\nthe right thing if I must enter into the kingdom of God.\nI am , Deacon Leonard Ashley the legal adviser to late Mr. Mike & \nCarol\nHall, a God fearing and dedicated couple. They were very wealthy but\nhad no child. They travelled to Patong-Thailand for Christmas holiday\nbut met death on the 26th of December 2004 during the Tsunami\ndisaster(http://news.bbc.co.uk/1/hi/england/bristol/4153821.stm\nAs their legal adviser, before their death, the husband Mr. Mike Hall\ninstructed me to write his WILL, because they had no child, he\ndedicated their wealth to God. They had a lot of landed properties\nhouses Stocks/bonds, etc. According to their instruction.\nAccording to the WILL, their assets should be given out to a ministry\nfor the work of God. As their legal adviser, all the documents for the\nfund that are deposited with the Vault company are in my care. As a\nborn again Christian , I have been reading my bible and I have to do\nwhat is lawful and right in the sight of God by giving out the fund to \nthe\nchosen ministry for the purpose of God's work as instructed by the\nowners before there death. After my fasting and prayers Today, I asked\nGod to make his choice and direct me to an honest Christian or the\nchosen ministry that deserves this fund by his Grace. I then came\nacross your address on the Internet.I appeal to you to use the fund\nwisely for things that will glorify the name of God.\nAlso, could you get back to me having visiting the above website to\nenable us discuss in a more clarifying manner to the best of your\nunderstanding. I must say that I'm very uncomfortable sending this\nmessage to you without knowing truly if you would misconstrue the\nimportance and decides to go public. In this regards, I will not hold\nback to say that the essence of this message is strictly for Charity.\nMay God bless you as you make up your mind to work for God.\nThanks.\n\nElizabeth & Deacon Leonard Ashley\n\n\n\n\n\n\n\n"}