{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 108", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. Germany. Mannheimer Kunstdieb hat mit Bestnote promoviert\n      (Museum Security Network Mailing list)\n   2. D.C. officials will spend $15 million to $20 million to\n      repair the Georgetown public library damaged this week in a\n      three-alarm fire. (Museum Security Network Mailing list)\n   3. His mission -- to save art looted by Nazis. Here's how he did\n      it. (Museum Security Network Mailing list)\n   4. Germany. Anwalt gesteht Spitzweg-Diebstahl (Lawyer admits\n      theft of Spitzweg painting). 500000-Euro-Gem?lde aus Mannheimer\n      Kunsthalle entwendet/Prozess vor Landgericht.\n      (Museum Security Network Mailing list)\n   5. The heir of a Jewish art dealer Goudstikker whose entire\n      collection was looted by Nazi troops during World War II is\tsuing\n      a US museum that acquired two of the stolen paintings\tmore than\n      35 years ago. (Museum Security Network Mailing list)\n   6. Washington DC: Library fire likely sparked by construction\n      accident. (Museum Security Network Mailing list)\n   7. Austria. Salzburg: Vier Skulpturen verschwunden (four\n      sculptures stolen at art fair, or gone missing during transport)\n      (Museum Security Network Mailing list)\n   8. Thieves grab British Museum exhibits.\n      (Museum Security Network Mailing list)\n   9. Canada. Stash of cash missing from currency museum.\n      (Museum Security Network Mailing list)\n  10. Man arrested in theft of Old Salem pottery\n      (Museum Security Network Mailing list)\n  11. The Tales Pollen Tells. The rise of forensic palynology,\ta\n      once obscure science may give answers about the origin of Greek\n      statue achieved for the Getty Museum by Marion True.\n      (Museum Security Network Mailing list)\n  12. The Museum of Art in Fort Lauderdale will close its doors to\n      the public during the summer months. Starting June 1,\tthe museum\n      begins the overhaul of its security and fire suppression\tsystems.\n      (Museum Security Network Mailing list)\n  13. Lessons From the Washington D.C.  Library Fire\n      (Museum Security Network Mailing list)\n  14. An Aspen police investigator recovered two paintings Thursday\n      at the home of a Denver man who allegedly stole them from an\n      Aspen Gallery. (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Fri, 4 May 2007 22:26:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Mannheimer Kunstdieb hat mit Bestnote\n\tpromoviert\nTo: \nMessage-ID: <00a901c78e8a$7959ae60$6c0d0b20$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nMannheimer Kunstdieb hat mit Bestnote promoviert\n \nSein \"emotionales Verh?ltnis zu Spitzweg\" wird Rechtsanwalt zum Verh?ngnis -\nVon Ehefrau der Vergewaltigung bezichtigt\n \nMANNHEIM. Der Diebstahl des Gem?ldes \"Friedenszeit\" von Carl Spitzweg bei\nder Langen Nacht der Museen hat die Mannheimer Kunsthalle vergangenes Jahr\nersch?ttert. Seit gestern steht der mutma?liche T?ter vor Gericht. Er ist\nein Jurist mit Doktortitel.\n\nVon Johanna Eberhardt\n\nMit dem Diebstahl des Spitzwegbilds hat der 41-j?hrige Jurist vor einem Jahr\nbundesweit Schlagzeilen gemacht und die Verantwortlichen der angesehenen\nMannheimer Kunsthalle ziemlich blamiert. Die Sicherheitslage in dem Museum\nsei zum Zeitpunkt der Tat mehr als nur katastrophal gewesen, meinte der\nVerteidiger des Angeklagten zum Prozessauftakt. \"F?r diese Bilder hat es gar\nkeine Sicherheit gegeben. Sie standen einfach so in einem abgedunkelten\nRaum, ohne Bewacher, gleich neben dem Hintereingang. Wenn man an dem Abend\nmit einem Lastwagen vorgefahren w?re, h?tte man noch viel mehr mitnehmen\nk?nnen.\"\n\nDem Angeklagten d?rfte das nicht allzu viel helfen. Denn er muss sich nicht\nnur wegen des gestohlenen Spitzwegs verantworten. Nach seiner Festnahme im\nDezember vergangenen Jahres hatte ihn seine Ehefrau auch noch der\nVergewaltigung, der N?tigung und der K?rperverletzung bezichtigt. Vier F?lle\nhat die Staatsanw?ltin aufgelistet. Sollten sich die Vorw?rfe als richtig\nerweisen, k?nnten sie am Ende strafrechtlich schwerer wiegen als der\nspektakul?re Kunstdiebstahl.\n\nDen hat der Angeklagte gestern - wie zuvor schon im Verlauf der Ermittlungen\n- einger?umt, ebenso zwei kleinere ?bergriffe auf seine Frau. Die\nVergewaltigungen hat er hingegen bestritten. Die Ehe seines Mandanten, sagte\nsein Verteidiger, sei bereits kurz nach der Hochzeit gescheitert. Dessen\nungeachtet hatte sich das Paar am 18. M?rz 2006 gemeinsam aufgemacht, um die\nLange Nacht der Museen im Rhein-Neckar-Dreieck zu erleben. Nach der\nSportschau zogen beide los: zun?chst ins Hack-Museum nach Ludwigshafen,\nanschlie?end ins Mannheimer Schloss, die Jesuitenkirche, die\nReiss-Engelhorn-Museen und eine Galerie am Wasserturm, berichtete der\nVerteidiger. Dabei habe sein Mandant, ein Kunstliebhaber, \"Wei?wein in nicht\nunerheblichen Mengen\" getrunken.\n\nGegen Mitternacht seien beide in die Kunsthalle gegangen, wo der Angeklagte\nseiner Frau einige seiner Lieblingsbilder haben zeigen wollen. Beide h?tten\nzun?chst eine Weile einem K?nstler zugeschaut, der erotische Bilder gemalt\nhabe; sein Mandant h?tte gern eines der Werke gekauft, doch der Maler habe\nin der Museumsnacht nicht verkaufen wollen. So seien beide weitergegangen in\nden abgedunkelten Altbau der Kunsthalle, wo sich auch das ber?hmte Gem?lde\nEduard Manets von der Erschie?ung Kaiser Maximilians befindet.\n\nZum Erstaunen seines Mandanten sei der fragliche Raum offen gewesen; zwar\nh?tten keine Bilder an den W?nden gehangen, daf?r sei alles, was Rang und\nWert hatte, auf dem Boden gestanden. So habe er sich entschieden, f?r seine\nFrau \"eine Privatf?hrung zu veranstalten\". Der Spitzweg \"Friedenszeit\" -\neines von zwei Bildern des Malers, habe ihr \"ausnehmend gut gefallen\". Da\nhabe er, halb im Scherz, halb im Ernst, gesagt, das mache er jetzt ihr und\nsich zum Geschenk. Er habe das Bild aus dem Rahmen gel?st, an sich genommen\nund die Frau aufgefordert, zu sehen ob \"die Luft rein ist\". Dann h?tten sie\ndas Museum getrennt verlassen. \"Vor dem Wasserturm haben sie sich wieder\ngetroffen und gewundert, wie leicht alles war\", schilderte der Anwalt.\nAnfangs habe sein Mandant erwogen, das Bild rasch wieder zur?ckzubringen.\nDoch dann habe er sich entschieden, es in einem Schlie?fach im Bahnhof zu\ndeponieren. Sp?ter habe er es sicher verpackt in einem Koffer zun?chst bei\neinem Freund in Pforzheim, dann bei einem anderen in Bruchsal untergebracht.\nEs sei, sagte er denen, Schmuddelkram drin.\n\nDie tieferen Motive der Tat blieben am ersten Verhandlungstag unklar. Der\nAngeklagte, im dunklen Anzug, wei?en Hemd, goldfarbener Krawatte, sagte dazu\nnichts und lie? auch sonst lieber seinen Verteidiger sprechen. Zu Spitzweg,\nmeinte der, habe sein Mandant \"seit Kindertagen ein geradezu emotionales\nVerh?ltnis gehabt\".\n\nSicher kann man davon ausgehen, dass der Angeklagte wusste, was er tat: Nach\nAngaben seines Anwalt hat der 41-J?hrige nach dem Abitur in Bruchsal und dem\nMilit?rdienst bei den Fallschirmj?gern Jura in Heidelberg studiert. Er war\nzun?chst dort als wissenschaftlicher Assistent t?tig, danach promovierte er\nin Wien ?ber das Thema \"Der Kunsthandel unter besonderer Ber?cksichtigung\ndes internationalen Rechts\" und schloss mit der Bestnote ab. Anschlie?end\nlie? er sich erst in Heidelberg, dann in Mannheim als Rechtsanwalt nieder.\n\nSeine Karriere neigte sich dem Ende zu, als einige Monate nach dem Diebstahl\nein Informant die Polizei wissen lie?, dass der Jurist einen Spitzweg zum\nVerkauf anbiete. Im ber?hmten Caf? Flo in Mannheim nahm ein verdeckter\nErmittler des Landeskriminalamts im Oktober 2006 den ersten Kontakt zu ihm\nauf. Im Dezember, bei der Besichtigung des Bildes, wurde er festgenommen und\nsitzt seither in Untersuchungshaft. Er hatte eine Million Euro f?r das Bild\nverlangt, das 500 000 Euro Wert ist. Seine Anwaltszulassung hat er\nzur?ckgegeben.\n \nAktualisiert: 04.05.2007, 06:19 Uhr\n\nhttp://www.stuttgarter-zeitung.de/\n\n\n\n------------------------------\n\nMessage: 2\nDate: Fri, 4 May 2007 22:31:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] D.C. officials will spend $15 million to $20 million to\n\trepair the Georgetown public library damaged this week in a\n\tthree-alarm fire.\nTo: \nMessage-ID: <00ad01c78e8b$2c4a65a0$84df30e0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nLibrary to be repaired\nBy Kristen Chick\nTHE WASHINGTON TIMES\nPublished May 3, 2007\n \nD.C. officials will spend $15 million to $20 million to repair the\nGeorgetown public library damaged this week in a three-alarm fire, D.C.\nMayor Adrian M. Fenty said yesterday. \n    Mr. Fenty has identified $7.2 million in capital funds for the repair\nproject, which library officials said will take years to complete. \n    \"The administration's No. 1 point here is that we are committed to\nrebuilding Georgetown's historic library 100 percent,\" the mayor said in a\npress conference in front of the building, in the 3000 block of R Street\nNorthwest. \n    The fire started about 12:30 p.m. Monday. \n    An electrical short sparked another fire that day, at 1 a.m. at the\nEastern Market in the Capitol Hill neighborhood. Damage to the market is\nestimated at $5 million to $10 million. \n    Mr. Fenty, a Democrat, said Tuesday that the administration will use\n\"supplemental revenue\" to assist vendors and to rebuild the market, in the\n200 block of Seventh Street Southeast. He said the city's chief financial\nofficer, Natwar M. Ghandi, will identify the revenue next week. \n    The D.C. Sports and Entertainment Commission will consider opening the\nD.C. Armory as a temporary site for displaced Eastern Market vendors. \n    Officials said the armory could not accommodate vendors this month\nbecause of scheduled events, but it may be available during the summer. \n    \"If there's some way we can be a good neighbor, we'd like to be if we\ncan,\" said Allen Lew, chief executive of the sports commission. \n    Neither the library nor the market had a sprinkler system and neither\nwas required to have one. \n    A bookmobile will be dispatched to the library by next week, and a\nlocation for a temporary library is being sought, said Ginnie Cooper, chief\nlibrarian for the D.C. Public Library System. \n    A fire station in Georgetown will serve as a temporary reading room for\nchildren until the library is restored, said fire Chief Dennis L. Rubin. \n    The children's room and story time were two of the library's most\npopular attractions, residents said. \n    The room was among the worst damaged in the fire, which started in the\nattic and destroyed most of the roof. \n    With the ceiling collapsed, the room is open to the elements. Steel\nbeams lie with scorched children's books scattered in the rubble. \n    Fire department spokesman Alan Etter said the blaze was not set\ndeliberately, but officials are investigating. One suspected cause is\nrenovation work being performed on the building's trim and windows. \n    Mr. Etter said construction workers may have tried to extinguish the\nfire. Chief Rubin said the workers did not call the fire department\nimmediately after the blaze started. \n    The lapse contributed to the extent of the destruction more than the two\nmalfunctioning fire hydrants closest to the building, he said. \n    Georgetown residents who gathered for the mayor's address and library\ntour expressed relief that most of the historical documents and paintings in\nthe library's Peabody Room had survived the fire. \n    The Peabody Room, on the second floor, was wet but intact. The glass\ncases that lined the walls were empty, the pieces of history they had housed\nstored safely in a freezer truck to be taken to a restoration facility. \n    \nhttp://washingtontimes.com/functions/print.php?StoryID=20070502-111145-2766r\n\n\n\n------------------------------\n\nMessage: 3\nDate: Fri, 4 May 2007 22:31:19 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] His mission -- to save art looted by Nazis. Here's how\n\the did\tit.\nTo: \nMessage-ID: <00ae01c78e8b$2f171a30$8d454e90$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nHis mission -- to save art looted by Nazis. Here's how he did it.\nJesse Hamlin, Chronicle Staff Writer\n\nFriday, May 4, 2007\n\nBernard Taper dreamed about Raphael's \"Portrait of a Young Man,'' the most\nprized painting looted by the Nazis that has never been found. He spent two\nyears searching for the Raphael in ravaged post-World War II Germany -- and\nfor many other works he did recover -- as an art-intelligence officer with\nthe Monuments, Fine Arts and Archives section of the U.S. military. \n\n\"It's the most valuable single thing that's still missing,'' says Taper, a\nlongtime writer for the New Yorker, one-time Chronicle reporter and retired\nUC Berkeley journalism professor. He tracked down many artworks in 1946 and\n'47, including objects German peasants had looted from an abandoned train\ncarrying booty pilfered by Luftwaffe chief Hermann G?ring. A connoisseur of\nluxury, G?ring had amassed thousands of paintings, sculptures and others\nworks during his tenure as the second-most powerful man in Nazi Germany. \n\nTaper is sitting in the sunny living room of the Berkeley home he shares\nwith his wife, poet Gwen Head, recalling the slippery art advisers, black\nmarketeers and such top Nazis as Albert Speer he interrogated 60 years ago.\nOn the table is a book published by the Polish government, in English titled\n\"Wartime Losses, Foreign Paintings, Volume I,'' with Raphael's curly-haired\nyoung man on the cover (the portrait belonged to the Czartoryski Museum in\nKrakow). He's become the poster child for the countless artworks stolen by\nHitler and his Nazi henchmen from Jewish homes and art galleries, civic\nmuseums, private collections and churches across Europe -- tens of thousands\nof them still missing -- during the reign of the Third Reich. \n\n\"The Nazis were not just the most systematic mass murderers in history, they\nwere the greatest thieves,'' says historian Jonathan Petropoulos in the\npotent new documentary \"The Rape of Europa,'' which screens at the San\nFrancisco International Film Festival next Monday, Tuesday and Thursday and\nplays at the Krakow and Jerusalem film festivals next month. Taper is one of\nseveral of the so-called Monument Men who appear in the film. They describe\nthe vast hordes of art, furniture and religious objects the Nazis stashed in\ncastles, salt mines and bunkers in Germany and Austria, and the noble\nefforts to recover, protect and return them to the countries from which they\nwere stolen. \n\nJointly written, produced and directed by three San Francisco filmmakers --\nRichard Berge, Bonni Cohen and Nicole Newnham -- \"The Rape of Europa'' is\nbased on the 1995 book of the same name by Lynn Nicholas. Seven years in the\nmaking, the documentary delves into the Nazis' obsession with art, and the\nfervor for not only wiping out entire races but also their cultural\npatrimony as well. And it tells the story of the people who tried to salvage\nthe remnants of European culture and those still working to repair the\ndamage: the Monument Men on the front lines in Italy who sought to protect\nhistoric buildings and artworks from Allied bombing (sometimes\nunsuccessfully); the working people at the Louvre in Paris and the Hermitage\nin St. Petersburg, who struggled to save their cultural heritage; and the\nItalian conservators still piecing together the shattered frescoes from the\nCamposanto in Pisa, destroyed by Allied shells. \n\n\"I was fascinated with this issue of art and culture being like mana,\ninvested with some kind of soul,'' says Berge, who met his co-directors in\nthe early '90s in the documentary film masters' program at Stanford. \"The\nNazis wanted to eliminate it, and all these other people wanted to protect\nit. You could kill all the people, but if the objects remained, there would\nbe something left of the soul. And the Nazis were trying to eliminate every\nvestige of it.'' \n\nRather than dealing in obvious terms of good and evil, Cohen says, \"it was\ncentral for us to get all those gray areas. We wanted to get into the\nmind-set, to understand the Nazis' obsessive art collecting -- not only the\ncollecting but the eradication -- and what it said about them. We felt\nstrongly that this was a new lens to look at this period of history through,\nand we could bear witness in a different way than how we were taught about\nthe Holocaust.'' \n\nA failed artist, Hitler had begun collecting art and using it as propaganda\nafter his rise to power in the 1930s. He had more than 16,000 works of\nmodern art, which he labeled \"degenerate,'' purged from German museums. They\nwere destroyed, sold or traded for Old Masters. Other high-ranking Nazis\nbegan collecting, following the example of the F?hrer, who planned a great\nmuseum of European art, honoring his reign, in his provincial hometown of\nLinz, Austria. Many of the stolen Rembrandts, Vermeers and Boticellis were\nearmarked for Hitler's museum. \n\nWhen American art experts learned of the Nazi looting, they convinced\nPresident Franklin D. Roosevelt to form a commission to try to save European\nmonuments and artworks as the Allies prepared to invade Europe. Officers\nwith art and curatorial backgrounds were assigned to Army units to advise\nthe advancing troops about what buildings were worth saving. They made\naerial photographs marking monuments not to be bombed. A strategic bombing\nof the vital Florence rail yards spared the city's great art treasures, but\nthe Germans blew up historic bridges as they retreated. \n\nThe ranks of the Monument Men included such later well-known figures as\nJames Rorimer, future director of the Metropolitan Museum of Art, and\nLincoln Kirsten, director of the New York City Ballet (Taper wrote the\ndefinitive biography of the great Russian-born choreographer Kirsten brought\nto America, George Balanchine). One of the most lauded Monument Men was\nCapt. Deane Keller, a Yale art professor charged with protecting Italian art\nand buildings. A medieval cemetery with vast Gothic galleries containing\ntreasured frescoes, the Camposanto was accidentally hit during the battle\nfor Pisa, and the lead roof melted over the frescoes and marble work. \n\nOver the next several weeks, Keller got Italian soldiers to clean the place\nout and pick up thousands of fresco fragments. He got U.S. Army engineers to\nbuild a temporary roof to shield works that survived, hunting up the\nmaterials wherever he could, and sent art conservators from Rome and\nFlorence to tend to the works. Keller, who later rescued a horde of looted\nworks by Michelangelo, Botticelli and Raphael and accompanied their\ntriumphant return to Florence, was buried in Camposanto after his death in\n1992. \n\n\"My story is not as heroic or as glamorous as those of the earlier Monuments\npeople, whom I look on as legendary figures, truly chivalric in their\ncourage, enterprise and dedication to a cause,'' Taper wrote in a 1995\nessay, included in a book \"The Spoils of War,'' the title of an\ninternational symposium he participated in that year. \n\n\"I was in the Army for three years, and I didn't fire a shot at anybody and\nnobody fired a shot at me. That's the definition of a good war,'' the\nwhite-haired Taper, sharp at 89, says with a smile. But he did his part to\nbring forth light, in the form of recovered art, from the darkness of the\nwar. \n\nBorn in London and educated at UC Berkeley, Taper was drafted into the U.S.\nArmy in 1943. He served in intelligence and infantry units before being sent\nback to Berkeley to learn Chinese in preparation for work as a liaison\nofficer assigned to Chaing Kai-Shek's army in China. But at the last minute,\nthe entire class was sent to Germany, where the war was over. \n\n\"It was the Army. Why do you think they invented words like 'snafu'?\" laughs\nTaper, who was assigned to Patton's Third Army, then sent to Munich to write\nintelligence reports. Lunching outdoors one day at an officers' club, he\nfell into conversation with a dashing chap named Walter Horn, an Aryan\nGerman who abhorred Hitler and left, became a professor of medieval history\nat UC Berkeley and saw combat action during the war. \n\n\"He started telling me marvelous, fascinating stories about what it was like\nin his job to search for lost and stolen art,'' recalls Taper, who had begun\ncontributing to the New Yorker and the Nation while serving in occupied\nGermany. Horn was desperate to go home, but couldn't until he found a\nsuccessor for his art-investigating job. \"When he met me he found his\nsuccessor,'' says Taper, who told Horn he wasn't an art historian and\nprobably wasn't qualified. Horn said the Monuments section was \"lousy with\nart historians,'' but what was needed was somebody who knew how to ask\nquestions. As a budding journalist, Taper fit the bill. \n\nAs a further inducement, Horn told him he would have the use of a white BMW\nroadster, wouldn't have to wear a uniform, could travel freely without\norders and would meet women. \"And he said if nothing else, there's all this\nart you can look at,'' recalls Taper, quick to point out that he got a brown\nAudi sedan, not the promised BMW. For about six weeks, Taper was in charge\nof the Army's art-collecting center at Wiesbaden, which was filled with not\nonly looted art but works from various German civic collections. \n\n\"They had fantastic stuff there,'' Taper says. \"In the office, across the\nwhole back wall, was Watteau's 'Embarkation for Cythera,' and a wonderful\nDegas, where you look up through the orchestra pit, through the beards of\nthe musicians, at these elegant dancers. It was from the Frankfurt Museum.''\nAs Taper says in the documentary, \"Just that office alone was worth the\nprice of admission to World War II.'' Outside the door stood a\n5,000-year-old stone Nefertiti, which also stopped Taper in his tracks. \"I\ncouldn't just brush by. I had to stop and commune with her.'' \n\nBuilding on the work of previous Monument Men, such as his friend Stewart\nLeonard, a bomb diffuser who single-handedly removed 22 mines from the\nChartres Cathedral and later opened crates containing priceless books and\nD?rer drawings, Taper tracked down mostly mid-level missing artworks, by\npainters like the 16th century Dutch artist Mierevelt and his Flemish\ncontemporary Teniers, as well church statuary and other looted objects. \n\n\"Probably the best artwork I helped recover was from G?ring's train,'' Taper\nsays, abandoned on a rail siding not far from Neuschwanstein Castle, where\nAllied troops found a huge cache of stolen art. The locals had heard there\nwas schnapps on board, Taper says, and after stealing the schnapps, they\ntook the rest of the stuff, which included late-Gothic wood statutes and a\n15th century School of Rogier van der Weyden painting. \"Not bad,'' says\nTaper, who had the bright idea of tapping the de-Nazifed German police to\nhelp him find stolen goods. \n\nHe learned that the Gothic statutes had been taken by a cabinetmaker named\nRoth. When caught, the man said he'd seen the objects lying in the mud and\n\"took pity on them'' by taking them home. \"After that,'' Taper says, \"when\nwe had an interrogation, we'd say, 'Did you steal that, or did you just take\npity on it?' \" \n\nSearching for the missing Raphael, Taper questioned many people, including\nthe art advisers to Hans Frank, the Nazi governor of the occupied Polish\narea called \"General Gouvernement.'' Frank kept the Raphael, along with a\nRembrandt and Leonardo's \"Lady with an Ermine'' -- both of which were found\nand returned to the rightful owner -- in his Krakow residence. As the\nRussians advanced on Krakow, Frank and his entourage left in a rush, taking\nall three masterpieces with them. They stopped in various towns on their way\nto Bavaria. By the time Frank was captured in Neuhaus, the Raphael had\nvanished. \n\nTaper spent many hours questioning Frank's first art adviser, the\n\"infamous'' Kajetan M?hlmann and his successor, Wilhelm Ernest von\nPalezieux, whom Taper found in the French occupation zone. He got\nconflicting stories -- all of these characters suffered from what Taper\ncalls \"selective amnesia'' -- tracked down all the leads, but came up\nempty-handed. A number of important missing works have cropped up in recent\nyears as paintings have come on the market and governments open their files.\nThe Russians, who suffered mightily at Hitler's hands, still have loads of\nthings Stalin took from Germany when the Red Army got back what was left of\nthe stolen Russian art. Taper doesn't know if the Raphael will ever\nresurface. \n\nIn addition to returning looted works, \"a major part of our task was the\nfostering of the public German institutions,'' says Taper, who still recalls\nconcerts held in freezing halls in bombed-out cities across Germany, which\nfed defeated spirits. \"That was all they had.'' \n\nTaper thinks the work the Monument Men did was not only important in terms\nof equity, but also as ritual and symbol. \"It was a symbol that there were\nhigher values than victory, higher values than patriotism,'' he says. \"It\nwas a rare kind of behavior, which was a disinterested doing of good.'' \n\nIn \"The Rape of Europa,'' an Army doctor named Leonard Malamut, who was on\nhand when American soldiers discovered Hitler's vast horde of loot a quarter\nmile down a salt mine in the Austrian Alps, says: \"All this accumulated\nbeauty had been stolen by the most murderous thieves that ever existed on\nthe face of the Earth. How they could retain the nicety of appreciation of\ngreat art and be exterminating millions of people nearby in concentration\ncamps, I couldn't understand then and I can't understand it today.'' \n\nTaper may not understand, but he can fathom it. \"Human beings are\ncomplicated,'' he says. \"I've read enough Shakespeare to know.'' \n\nStill, \"amid all the sickening evidence of man's depravity and\ndestructiveness,'' he wrote, it was good to \"help preserve some of the\nthings mankind had done that one could not only bear to contemplate but even\ntake joy in.'' \n\n\"The Rape of Europa\": The film that documents the work of Bernard Taper and\nother Monument Men screens at the San Francisco International Film Festival.\nFor more information, go to fest07.sffs.org. \nE-mail Jesse Hamlin at jhamlin@sfchronicle.com. \n\nhttp://sfgate.com/cgi-bin/article.cgi?f=/c/a/2007/05/04/DDGQSPJJD753.DTL\n\n\n\n\n------------------------------\n\nMessage: 4\nDate: Fri, 4 May 2007 22:36:20 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Germany. Anwalt gesteht Spitzweg-Diebstahl (Lawyer\n\tadmits theft of Spitzweg painting). 500000-Euro-Gem?lde aus Mannheimer\n\tKunsthalle entwendet/Prozess vor Landgericht.\nTo: \nMessage-ID: <00ba01c78e8b$dfaf6280$9f0e2780$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nAnwalt gesteht Spitzweg-Diebstahl \n500000-Euro-Gem?lde aus Mannheimer Kunsthalle entwendet/Prozess vor\nLandgericht \n\nVom 04.05.2007\n\nMANNHEIM Ein Anwalt hat gestanden, ein Gem?lde des K?nstlers Carl Spitzweg\naus einem Mannheimer Museum gestohlen zu haben. Seit gestern muss sich der\n41-J?hrige vor dem Landgericht verantworten. Der Jurist soll zudem seine\nFrau vergewaltigt und misshandelt haben.\n\n \nVon\n\nUlrich Willenberg\n\n\"Mein Mandant hat seit Kindertagen ein geradezu emotionales Verh?ltnis zu\nSpitzweg-Gem?lden\", berichtete dessen Verteidiger Hans Ulrich Beust. Der\nAngeklagte hatte das Bild im M?rz 2006 w?hrend der \"Langen Nacht der Museen\"\naus der Kunsthalle entwendet. Neun Monate sp?ter versuchte er dieses f?r\neine Million Euro an einen verdeckten Ermittler der Polizei zu verkaufen.\n\nDer Diebstahl sei ein \"spontaner Entschluss\" gewesen, lie? der Angeklagte\ngestern seinen Verteidiger erkl?ren. Sein Mandant wollte sich und seiner\nFrau \"das Bild zum Geschenk machen\", sagte Beust. Das Paar habe nach\nzahlreichen Gl?sern Wein nachts die Kunsthalle besucht. Dort entdeckten\nbeide den kleinformatigen Spitzweg aus dem 19. Jahrhundert, der auch der\nFrau gefiel. \"Sie fand besonders den kleinen Vogel auf der Kanone niedlich\",\nso der Verteidiger. Das Biedermaier-Gem?lde mit dem Titel \"Friedenszeit\"\nzeigt einen g?hnenden Wachtposten auf einer Bastei.\n\nAuch in der Mannheimer Kunsthalle war man offenbar nicht besonders wachsam.\nSo stand das Gem?lde in einem nicht abgeschlossenen Nebenraum, zu dem das\nPublikum eigentlich keinen Zutritt hatte. Der Anwalt l?ste das Bild aus dem\nRahmen und nahm es unbemerkt mit. \"Er war ?berrascht, dass dies alles so\neinfach gegangen sei\", berichtete Verteidiger Hans Ulrich Beust.\n\nSp?ter legte der 41-J?hrige die Leinwand in einen Koffer und vertraute\ndiesen einem Bekannten an. Den machte er Glauben, es handele sich um\npornographischen \"Schmuddelkram\". Der Verlust wurde in dem Museum erst im\nLaufe des n?chsten Tages entdeckt. Die Sicherheitsm?ngel sollen inzwischen\nbeseitigt worden sein.\n\nDie Polizei war durch einen anonymen Hinweis auf die Spur des Diebes\ngekommen. Der wurde bei der vereinbarten Besichtigung des Bildes in Bruchsal\nfestgenommen. Das Gem?lde, das bereits seit 100 Jahren im Besitz des Museums\nist und dessen Wert sich auf rund 500000 Euro bel?uft, wurde dort inzwischen\nwieder aufgeh?ngt.\n\nDer Angeklagte hat seine Zulassung als Rechtsanwalt inzwischen zur?ckgegeben\nund seine Kanzlei geschlossen. \"Er steht finanziell vor dem Nichts\", glaubt\nVerteidiger Beust.\n\nNoch schwerer als der Diebstahl wiegen die Vorw?rfe, die seine Frau gegen\nden 41-J?hrigen erhebt. Sie hatte nach dessen Festnahme behauptet, ihr Mann\nhabe sie vergewaltigt und misshandelt. Verteidiger Beust bezeichnete dies\nals \"v?llig haltlos\". Die Frau habe nicht deutlich gemacht, dass sie keinen\nSex w?nsche. Die Ehe, die 2004 geschlossen wurde, sei nicht gl?cklich\ngewesen. Die Gattin habe ihren Mann mit \"absurden und h?sslichen\nEifersuchtsszenen\" zugesetzt. Die Frau soll am Montag als Zeugin geh?rt\nwerden. Gegen sie wird wegen des Spitzweg-Diebstahls ermittelt.\n\nF?r den Prozess sind neun Verhandlungstage anberaumt. Das Urteil wird f?r\nden 12. Juni erwartet.\n\nhttp://www.main-spitze.de/rhein-main/objekt.php3?artikel_id=2812390\n\n\n\n------------------------------\n\nMessage: 5\nDate: Fri, 4 May 2007 22:41:36 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The heir of a Jewish art dealer Goudstikker whose\n\tentire\tcollection was looted by Nazi troops during World War II is\n\tsuing a US museum that acquired two of the stolen paintings\tmore than\n\t35 years ago.\nTo: \nMessage-ID: <00c501c78e8c$9bf37da0$d3da78e0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nHeir of Jewish art dealer sues US gallery over Nazi loot \nPosted on donderdag 3 mei 2007 (EST) \n\n\nThe heir of a Jewish art dealer whose entire collection was looted by Nazi\ntroops during World War II is suing a US museum that acquired two of the\nstolen paintings more than 35 years ago.  \n\nNEW YORK (AFP) - Marei von Saher, the daughter-in-law of noted art dealer\nJacques Goudstikker, filed a lawsuit on Tuesday against the Norton Simon\nMuseum in Pasadena, California, her lawyers said in a statement issued\nWednesday. \n\nVon Saher and the museum had been in talks over the paintings for some years\nbut the two parties failed to reach a settlement, the lawyers said. \n\nAt stake are two life-size paintings of Adam and Eve by 15th century artist\nLucas Cranach the Elder, which Von Saher's lawyers said were among the most\nimportant works in Goudstikkers collection of more than 1,300 artworks. \n\nThe paintings, most of them Old Masters today worth hundreds of thousands of\ndollars apiece, were looted in 1940 when Nazi troops invaded the\nNetherlands. While some of the collection has been returned, many paintings\nremain missing. \n\nLuftwaffe commander Hermann Goering was among the officers who looted\nGoudstikker's gallery, taking some works back to Germany. \n\nThe two paintings in the current dispute were acquired by the Norton Simon\nMuseum in or about 1971, according to Von Saher's lawyers, who have\nchallenged the museum's contention that it has fair title to the paintings. \n\nLast year the Dutch government returned around 200 paintings that had been\nlooted from the Goudstikker collection to Von Saher. Around 30 of them were\nsold at auction in New York last month, fetching almost 10 million dollars. \n\nGoudstikker was forced to abandon his collection when he fled the\nNetherlands in 1940. However, a notebook in which he recorded details of\nover 1,000 of his works has proved invaluable in the search for the lost\npaintings. \n\nhttp://news.sawf.org/Lifestyle/36647.aspx\n\n\n\n\n------------------------------\n\nMessage: 6\nDate: Fri, 4 May 2007 22:46:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Washington DC: Library fire likely sparked by\n\tconstruction\taccident.\nTo: \nMessage-ID: <00cb01c78e8d$4fc3bf70$ef4b3e50$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nLibrary fire likely sparked by construction accident\nThe Associated Press\n2007-05-03 21:11:23.0\nCurrent rank: # 1,710 of 9,340 \n\nWASHINGTON - \nA fire that severely damaged the Georgetown public library and some of the\nvaluable documents inside likely was accidentally started by construction\nworkers, fire officials said Thursday.\n\nThe 72-year-old building was being renovated when the fire broke out Monday,\nburning portions of the roof and damaging irreplaceable documents and\nartworks in the Peabody Room.\n\nA mechanical heating device in use at the time likely touched off the blaze,\nsaid Alan Etter, a District of Columbia fire spokesman.\n\nOfficials had not come up with a damage estimate Thursday, Etter said,\nbecause they had to take into account both the value of the building and at\nthe artifacts in the Peabody collection.\n\nThe collection includes valuable books, paintings, rare maps of Civil War\nfortifications and copies of newspapers that contained stories about the\nsigning of the Declaration of Independence. It also includes files on every\nhome in Georgetown, a historic district.\n\nLibrary officials have said that most of the items were not burned but did\nsustain water damage, and that many could likely be salvaged.\n\n\nhttp://www.examiner.com/\n\n\n\n------------------------------\n\nMessage: 7\nDate: Fri, 4 May 2007 22:46:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Austria. Salzburg: Vier Skulpturen verschwunden (four\n\tsculptures stolen at art fair, or gone missing during transport)\nTo: \nMessage-ID: <00cc01c78e8d$513e5180$f3baf480$@org>\nContent-Type: text/plain;\tcharset=\"iso-8859-1\"\n\nSalzburg: Vier Skulpturen verschwunden\n\nGalerie bef?rchtet Diebstahl, Ausstellungsleitung der Kunstmesse glaubt an\nIrrtum der Spedition\n\nSalzburg - Vier Skulpturen im Gesamtwert von rund 75.000 Euro sind am\nDienstag nach Ostern nach Ende der Kunst-und Antiquit?tenmesse in der\nSalzburger Residenz verschwunden. Die bestohlene Galerie bef?rchtet einen\nDiebstahl, die Ausstellungsleitung glaubt eher an einen Irrtum bei der\nSpedition, berichten die \"Salzburger Nachrichten\".\n\nCragg, Kolig, Kogelnik fehlen\n\nCarolin Walker von der Galerie Schloss Ebenau in Rosental in K?rnten hatte\ndie verpackten Skulpturen nach der Ausstellung im Hof der Alten Residenz auf\neinen Rollwagen gestellt und zum Spediteur gebracht, dann ging sie nochmals\nkurz weg, und danach waren die Kartons weg. Walker dachte, dass sie die\nSpedition bereits verpackt hat. Erst in K?rnten bemerkte sie das Fehlen von\nvier Kunstwerken, und zwar eine Skulptur von Anthony Cragg, eine\nBlumenpalette von Cornelius Kolig und zwei Plastiken von Kiki Kogelnik.\n\nIm Lieferbereich, betonte die ?ffentlichkeitsabteilung der Messe gegen?ber\nderStandard.at, seien die Galeristen selbst f?r die Sicherheit der\nKunstwerke zust?ndig. Das Areal falle aus dem Zust?ndigkeitsbereich der\nMesse, vor allem auch nach Ende der Veranstaltung, heraus.\n\nDer Versicherer geht von einem Diebstahl aus, weil inzwischen so viel Zeit\nvergangen sei, so dass die verschwundenen Werke in der Zwischenzeit\nauftauchen h?tten m?ssen. Alexandra Graski-Hoffmann, Gesch?ftsf?hrerin des\nMesseveranstalters MAC Hoffmann, entgegnete: \"Es gibt keine Anzeichen, dass\nes eine professionelle Truppe war\", vielleicht habe ein anderer Spediteur\nversehentlich die Kartons eingepackt. \"Von Diebstahl ist das weit entfernt.\"\n(red/APA)\n\nhttp://derstandard.at/\n\n\n\n------------------------------\n\nMessage: 8\nDate: Fri, 4 May 2007 22:51:48 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Thieves grab British Museum exhibits.\nTo: \nMessage-ID: <00d501c78e8e$089ff770$19dfe650$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThieves grab British Museum exhibits\n\nPOLICE are investigating how 10 artefacts were stolen from a Chinese\nexhibition at the British Museum.\nThe thefts occurred on the same day, October 30, 2004, despite sophisticated\nsecurity systems at the museum, in Great Russell Street, Bloomsbury.\nOnly two out of 13 historic pieces stolen from the museum since 2001 have\nbeen recovered by police from the Met's specialist arts and antiquities\nsquad.\nDetails of the thefts were released to the New Journal under the Freedom of\nInformation Act.\nThe Chinese pieces stolen included a pair of gold earrings from the Yuan\nDynasty, dating from between 1279 and 1368, a pair of gilt bronze hairpins\nfrom the Tang dynasty (618-906), and a gold fingernail guard from the\nTang-Yuan Dynasty.\nThe museum has not revealed how much the items are worth, how they were\ntaken or if the thefts were the work of more than one person.\nA museum spokesman said: \"In common with major national museums in this\ncountry, the British Museum cannot insure its objects, as they are of such\nhigh value. The museum's collections are covered by government indemnity.\"\nOther stolen artefacts include a late 18th restoration of a Roman marble\nhand, taken in July, 2002.\nThe only stolen pieces recovered have been a Greek marble head, from 324BC,\nand an oak table clock by Benjamin Lewis Vuilliamy. A man was subsequently\ncharged with handling stolen goods following the theft of the clock in\nOctober last year.\nPolice inquiries are continuing into the other thefts.\nThe museum spokesman said: \"The British Museum considers the security of its\ncollection to be one of its highest priorities and takes all necessary\nprecautions to ensure the safety of the objects in its care.\"\n\nhttp://www.thecnj.co.uk/\n\n\n\n------------------------------\n\nMessage: 9\nDate: Fri, 4 May 2007 22:56:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Canada. Stash of cash missing from currency museum.\nTo: \nMessage-ID: <00e001c78e8e$be870b50$3b9521f0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nStash of cash missing from currency museum\n  \nThe Edmonton Journal \n\n\nMonday, April 30, 2007\n\n\nOTTAWA - Someone has helped themselves to a few choice specimens from the\nBank of Canada's currency museum, newly released documents show.\n\nBank officials are short about $16,700 following the unsolved theft at the\ncentral bank's popular tourist attraction.\n\n\"There is no plausible explanation for the discrepancy other than theft,\"\nsays an internal audit obtained by The Canadian Press under the Access to\nInformation Act.\n\n\"The procedures for note holdings should have been stronger ... some of the\nprocedures that did exist were not followed.\"\n\nThe missing money came not from the display cases, but disappeared from a\nstash of cash the museum uses to help teach visitors about counterfeit\ncurrency.\n\nThe so-called note exchange program allowed patrons to swap their old-style\nbills for new-series money with special security features designed to thwart\ncounterfeiters.\n\nThe popular program, created in 2001, has been abruptly cancelled in the\nwake of the currency caper.\n\nhttp://www.canada.com/\n\n\n\n\n------------------------------\n\nMessage: 10\nDate: Fri, 4 May 2007 22:56:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Man arrested in theft of Old Salem pottery\nTo: \nMessage-ID: <00e101c78e8e$c045d250$40d176f0$@org>\nContent-Type: text/plain;\tcharset=\"KOI8-R\"\n\nThursday, May 3, 2007\nMan arrested in theft of Old Salem pottery\nHe's charged with possessing stolen ceramics\n\n\nBy Dan Galindo\nJOURNAL REPORTER\n\nWinston-Salem police have arrested one man in connection with the theft of\n20 pieces of Moravian pottery from Old Salem.\n\nThe ceramic pottery taken includes a few replicas, which have little value,\nalong with original plates, bowls and jugs from the 19th and late-18th\ncenturies.\n\nPolice have recovered at least 14 of the pieces after arresting David Curtis\nBarrow, 56, of 413 Holiday St. on Monday at Brookstown Antiques &\nConsignment on Brookstown Road.\n\nAccording to Lee French, the president of Old Salem Inc., the same man had\nsold stolen pottery pieces at the store, then returned Monday to sell more.\n\nOld Salem officials had notified local antique dealers after the thefts and\nasked them to be on the lookout.\n\nFrench said they confirmed that the first pieces sold to the store were\nstolen, and then police were ready in case the seller returned.\n\nBarrow is charged with possession of stolen property and carrying a\nconcealed gun, which police say was a loaded gun found in his car. He has\nnot been charged with the break-ins or thefts and is out of jail after\nposting a $15,000 bond.\n\nHe did not return a phone message yesterday.\n\nThe pottery pieces were taken in break-ins on the night of April 11 at\nWinkler Bakery and on April 15 at the Vierling House.\n\nOld Salem officials declined to say how much the pieces are worth. One\npolice report lists six stolen pieces as valued at $2,400.\n\nPolice declined to comment on the case yesterday other than to say they were\nstill investigating.\n\nThe stolen pieces are not the elaborately decorated plates often associated\nwith Moravians - they are more like the sturdy wares that would be used\naround the house, said Johanna Brown, the director of collections at Old\nSalem and curator of Moravian decorative arts.\n\n\"It's sort of the Rubbermaid of the 19th century,\" Brown said.\n\n? Dan Galindo can be reached at 727-7377 or at dgalindo@wsjournal.com.\n\nhttp://www.journalnow.com/\n\n\n\n------------------------------\n\nMessage: 11\nDate: Fri, 4 May 2007 22:56:53 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The Tales Pollen Tells. The rise of forensic\n\tpalynology,\ta once obscure science may give answers about the origin\n\tof Greek\tstatue achieved for the Getty Museum by Marion True.\nTo: \nMessage-ID: <00e201c78e8e$c14a7110$43df5330$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nThe Tales Pollen Tells\nThe rise of forensic palynology, a once obscure science.\n\n \nFor more on this fascinating subject, visit the Web site of University of\nWestern Australia palynontologist Lynne Milne at: http://tinyurl.com/39nxd4.\n\n \n In 1988 Marion True, at that time the J. Paul Getty Museum's antiquities\ndirector, paid a record $18 million for a 5th century BC Greek statue that\nshe said would become \"the single greatest piece of classical art in our\ncollection.\" It is still one of its most prized artifacts. Almost 20 years\nlater, True is on trial in Rome for trafficking in looted art, and her\nconviction or release may hinge on an analysis of the pollen found in the\nfolds of the excavated statue's robes. If the pollen is of Sicilian origin,\nit may have been looted from a site there after Italy's 1939 prohibition on\nexporting antiquities without a permit. But if it is of North African\norigin, where similar statues have been found, there is no problem. \n\nViewed under the microscope, pollen grains have an endlessly diverse variety\nof forms. The shell of pollen grains is highly resistant to degradation, so\npollen grains can fossilize, and are used to track and date geological\nstrata. They can also be used in tracking and solving crimes and other\npuzzles. \n\nDuring the massacre of Bosnians in and around Srebrenica in the summer of\n1995, one execution and burial site was in a field of wheat. Later, the\nbodies were dug up and reburied in smaller numbers elsewhere, to diminish\nthe evidence for a massacre. Their origin was traced to the wheat field\nthrough the presence of distinctive pollen in soil recovered from them. This\nfinding was important court evidence against those involved in the\nSrebrenica atrocities. \n\nBetween 1975 and 1978, after the end of the Vietnam War, a story emerged\nfrom the Hmong tribesmen who live in the hills bordering Laos and Cambodia,\nof a so-called yellow rain alleged to have fallen from the sky, often after\nplanes had passed over. The \"rain\" caused heavy bleeding from the nose and\ngums, blindness, tremors, seizures, other neurologic symptoms, and death. It\nled to serious allegations of chemical warfare by the United States against\nthe Soviet Union, which was supposed to have supplied chemical weapons to\nthe Vietnam government. \n\nSamples of yellow spots on leaves were submitted for chemical analysis and\ninitially gave positive results for mycotoxins, fungal poisons that can\ncause a variety of symptoms and, in the long run, liver cancer. But this\nresult was unreproducible. Eventually, microscopic analysis showed that the\nyellow spots were bee feces containing tree pollen. A swarm of bees had\nerupted from a tree-top hive, like a bucket brigade carrying out the slops,\ndumping them all over the neighborhood. This new finding for apiology [study\nof bees] was confirmed by actual observation in the hill forest by\nentomologists, who were caught in a yellow fecal shower during a field trip\nto the location of an alleged attack. It strains credulity that Russian\nchemical warfare agents went around harvesting tree pollen in large\nquantities to disguise a mycotoxin weapon. \n\nIn 1999, at a conference of the Missouri Botanical Society, a pollen\nspecialist with the Israel Antiquities Authority reported that pollen spores\nfound on the Shroud of Turin were typical of those of plants growing around\nJerusalem. A Swiss police criminologist, who had earlier been in trouble for\nfaking evidence, had given the samples of the shroud to him, thus leaving\nthe finding in doubt. \n\nThe late Andy Spielman of Harvard University, a highly respected medical\nentomologist, had a bee in his bonnet about pollen and malaria. He claimed\nthat the recent large increase in malaria transmission in parts of\nsub-Saharan Africa was linked to the increase in the cultivation of maize in\nthose areas. Huge quantities of pollen produced by the crop settle on the\nmud puddles, which are the preferred breeding sites for the Anopheles\narabiensis mosquito, providing a rich food supply for the larvae and\nproducing bumper crops of the malaria vector. Many of his associates and\nstudents thought he was a bit unhinged about the subject, but he has been\nvindicated by the finding that the large increase in malignant tertian\nmalaria in parts of Ethiopia is in fact correlated with the intensification\nof maize cultivation. \n\n\nThus the lowly pollen grain has shown its utility in the fields of\narchaeology, criminology, biowarfare investigation, and epidemiology, far\nbeyond its primary purpose of acting as simply the transmitter of DNA from\none plant generation to the next. Remember that, the next time you curse\npollen for your spring allergy or for messing up the shine on your\nautomobile. \n\n\nWoodall is former director of the Nucleus for the Investigation of Emerging\nInfectious Diseases in the Institute of Medical Biochemistry at Brazil's\nFederal University of Rio de Janeiro. \n\njwoodall@the-scientist.com  \n\nhttp://www.the-scientist.com/\n\n\n\n------------------------------\n\nMessage: 12\nDate: Fri, 4 May 2007 22:58:57 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] The Museum of Art in Fort Lauderdale will close its\n\tdoors to\tthe public during the summer months. Starting June 1,\tthe\n\tmuseum begins the overhaul of its security and fire suppression\n\tsystems.\nTo: \nMessage-ID: <00e801c78e8f$08801df0$198059d0$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nFort Lauderdale's Museum of Art to close this summer for repairs \nBy Emma Trelles\nArts Writer\n\nMay 3, 2007\n\n\n\nThe Museum of Art in Fort Lauderdale will close its doors to the public\nduring the summer months. Starting June 1, the museum begins the overhaul of\nits security and fire suppression systems, as well as renovations to make\nthe venue more accessible for people with disabilities. The museum's\nexecutive committee decided on the action last Thursday, citing the slow\nsummer season as an apt time to protect its artworks and least affect\nvisitors. The summer art camp, held in nearby studio space, will continue as\nscheduled.\n\n\"The Tut renovations were just the beginning of the improvements,\" says\ndirector Irv Lippman, who adds that other tweaks include replacement of the\nfront doors and windows, which were not constructed to hurricane-proof code\nduring the Tutankhamun exhibit. The first- and second-floor public restrooms\nare also slated for refurbishing, and the museum plans on sprucing up its\nentrance and lobby areas in anticipation of its 50-year anniversary in 2008.\n\n\"It's not uncommon to take an intermission,\" Lippman says. \"When the work\nhas to get done, it has to get done.\" Around the country other arts venues\nundergo their own makeovers, including the Amon Carter Museum in Fort Worth\nand New York City's Alice Tully Hall at Lincoln Center.\n\nFunding was raised in part by a challenge posed by the Museum of Art's past\nchair, Spie Eagon, who promised $100,000 toward building repairs if the\nboard matched an additional $400,000. It did, with an extra quarter of a\nmillion granted by board member Holly Hudson Bodenweber. But the museum is\ndoubling fund-raising efforts because the $750,000 in hand still does not\ncover its costs.\n\n\"The building is 20 years old, and we've had over 1million visitors in the\nlast three years. It really puts us in the forefront of art museums in terms\nof attendance. During Tut the pipes blew in the restrooms from overuse,\"\nLippman says. He explains the million-dollar grant the county gave the\nmuseum last year mostly helped with structural repairs, such as a new roof\nand air conditioning system, but these were bare necessities to accommodate\nTut.\n\n\"This is a building designed by Edward Larrabee Barnes; it's a gem and it\nneeds to be refurbished.\"\n\nBecause of the upgrades, the museum has postponed \"Unbroken Ties: Dialogues\nin Cuban Art,\" a show mostly composed of paintings and photographs by both\nexiled and national Cuban artists; it's now slated to open in April of next\nyear. \"Situational Comedy: Humor in Recent Art\" has been canceled.\n\nThe museum opens its coming season on Sept. 7 with \"The Quilts of Gee's\nBend.\" The show features the quilts of four generations of African-American\nwomen from the rural Alabama community of Gee's Bend.\n\nEmma Trelles can be reached at 954-356-4689 or etrelles@sun-sentinel.com.\n\n\n\n\n------------------------------\n\nMessage: 13\nDate: Sat, 5 May 2007 12:16:37 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] Lessons From the Washington D.C.  Library Fire\nTo: \nMessage-ID: <001301c78efe$77854ad0$668fe070$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nLessons From a Library Fire\n\nSaturday, May 5, 2007; A16\n\n\n\nI was astounded to read in the May 2 front-page article \"Across D.C., Dozens\nof Hydrants Are Broken\" that \"fire and union officials say the faulty\nhydrants often aren't discovered until a fire breaks out, as was the case in\nGeorgetown\" at the library fire. Later the article explained that repair of\nthe hydrants is the D.C. Water and Sewer Authority's responsibility.\n\nThe responsibility for repairing hydrants may be WASA's. However, the\nresponsibility to know which hydrants are bad or good lies with the D.C.\nfire department.\n\nI worked my way through college as a firefighter elsewhere. A large part of\nour \"between calls\" time was spent checking the hydrants in our district. We\nwere obligated to test the flow and pressure of each hydrant every two\nmonths. We recorded the results on a map, so that the company commander knew\nwhere to find a good hydrant long before we pulled up to a fire.\n\nI walk by a D.C. fire station every morning these days. Those firefighters\nare out there diligently testing and cleaning their equipment, as every good\nfire company should. But what about the hydrants? Is knowing that they have\na functioning hydrant less important than knowing that they have a\nfunctioning ladder or siren?\n\nDENNIS DILLMAN\n\nWashington\n\n.\n\nI hope that the administrators and staff of the Martin Luther King Jr.\nMemorial Library downtown read Sean Steele's May 3 letter, \"An Avoidable\nLibrary Fire,\" about cluttered District public libraries and fire hazards,\nbecause they've been propping open the clearly marked fire doors for years.\n\nGARY GOLDBERG\n\nSilver Spring\n\n.\n\nThankfully, no lives were lost in the fire at the Georgetown public library\non April 30, but we were not completely spared. Hand-colored maps of\nGeorgetown in the 1870s, a painting of Key Bridge and a document signed by\nFrancis Scott Key, all historically important objects, were threatened by\nthe fire. Across the nation, similar small institutions hold collections\nthat tell the stories of local communities and our nation's history.\n\nA report by the U.S. Institute of Museum and Library Services and Heritage\nPreservation identified emergency planning, environmental and storage\nconditions, staffing, and funding as aspects of collections stewardship that\nhave the greatest needs. If these needs are not addressed, many collections\nare at risk for damage or loss.\n\nIn June, library and museum representatives from each state will meet here\nto launch a nationwide conservation initiative. We are committed to raising\nawareness of the need to protect library and museum collections -- because\nthey are our collective collections, too.\n\nANNE-IMELDA RADICE\n\nDirector\n\nU.S. Institute of Museum and Library Services\n\nWashington\n\nhttp://www.washingtonpost.com/\n\n\n\n------------------------------\n\nMessage: 14\nDate: Sat, 5 May 2007 12:16:38 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] An Aspen police investigator recovered two paintings\n\tThursday\tat the home of a Denver man who allegedly stole them from an\n\tAspen Gallery.\nTo: \nMessage-ID: <001401c78efe$7a5c1180$6f143480$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nPolice recover paintings\n\n\n \n----------------------------------------------------------------------------\n----\n\nClick to Enlarge\n\nBrowse Aspen Times Photos\n \n \n\n----------------------------------------------------------------------------\n----\n \nBy Charles Agar\nMay 5, 2007\n\nAn Aspen police investigator recovered two paintings Thursday at the home of\na Denver man who allegedly stole them from an Aspen Gallery. \n\nLakewood police detained Tyson Hurd, 32, on suspicion of burglary.\n\nThe paintings, in Aspen Police custody Friday, are from the private\ncollection of the Goss family, owners of Gypsy Woman Gallery on Main Street\nin Aspen. \n\nAspen artist Earl Biss' two oil paintings, \"Indians in a Storm\" and\n\"Swimming Toward the Light,\" are valued at up to $90,000 each, American\nDesign Gallery President Paul Zueger said.\n\nThe Goss family first notified Aspen police April 14 when they noticed one\npainting was missing. They believed someone lifted the painting off the wall\nduring business hours, Aspen police investigator Eric Ross said.\n\nBut, on April 17, owners of the American Design Gallery in Denver notified\npolice they bought what they thought was a stolen painting from Hurd. The\ndescriptions matched, Ross said.\n\nHurd also offered the Denver gallery a second painting, and the suspected\ntheft became a suspected burglary; the Goss family searched their inventory\nand found a second Biss painting missing - something only an insider would\nknow, Ross said.\n\nHurd sold the painting to the Denver gallery for $8,500, Ross said.\n\n\"He knows the family. He knew the layout. It would be an easy thing to do,\"\nsaid Lou Lou Goss, whose family owns the gallery and who was formerly\nmarried to Biss, who died in 1998.\n\nHurd had a previous relationship with Lou Lou Goss, she said, and Ross\nbelieved Hurd banked on what he knew about the family and the gallery to\nsteal two valuable paintings.\n\nRoss went to Denver on April 18 and contacted Hurd at his home.\n\nWhen questioned, Hurd said he bought the paintings at an estate sale and\ncontended the other was in the custody of his brother, Ross said.\n\nHurd agreed to meet with Ross again in Denver on Thursday. When Hurd\nproduced the second painting, Ross served him with an arrest warrant.\nLakewood police took Hurd into custody.\n\nHurd will soon be transported to Pitkin County jail. Monday he will face\ncharges of second-degree burglary - a Class 4 felony - as well as felony\ntheft and felony receiving (for selling the painting). Both theft charges\nare Class 3 felonies because of the high value of the paintings, Deputy\nDistrict Attorney Gail Nichols said.\n\nOwners of the American Design Gallery said they will file separate fraud\ncharges against Hurd.\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 108\n****************************************\n\n"}