{"category": "spam", "to_address": "<IPLACEREPORTS@SPEEDY.UWATERLOO.CA>", "from_address": "\"DanWiener@AdviserOnline.com\" <DanWiener@AdviserOnline.com>", "subject": "The smartest investors at Vanguard", "body": "\n\nCONFIDENTIAL BRIEFING PREPARED FOR IMMEDIATE RELEASE\n\n\n\n\n\nWe love giving our InvestorPlace.com members benefits like access to this timely message.\nIn order to ensure you keep receiving special alerts and offers like this one, please take a moment to click on any of the links in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com \n \n\n\n\n\n\n\nA publication of Fund Family Shareholder Association. This publication, FFSA, and The Independent \n        Adviser for Vanguard Investors are completely independent of The Vanguard Group, Inc.\nHow the Smartest Vanguard \n        Investors Turn a 25¢ Investment \n        into $89 On a Daily Basis \nSUMMARY:\n\n Vanguard’s average investor tripled his or her portfolio value over the last 15 years.\nBut a group of risk-averse Vanguard investors grew their portfolios\neight times larger in the same time period.\nAny Vanguard investor can capture 136% greater profits.\nVanguard’s most popular funds doom millions of investors to mediocrity.\nVanguard does not promote its best funds.\n19 secrets (revealed in this briefing) hold the key to bigger profits with smaller risks.\n\nIf you are holding any of Vanguard’s most popular funds, \n        you could be doomed to mediocrity, or worse, this year.\n Cut Your Risks and Still Make 136% More \n        Money Than the Average Vanguard Investor \nThe average Vanguard investor has\n          more than tripled his or her personal pot of gold since 1991. A portfolio starting with $100,000 is now worth $384,095. That’s the average.\n          And many might say that’s a darn good reason to invest with Vanguard.\nBut during that exact same time, investors who took my advice on Vanguard saw their personal pots of gold grow not three but EIGHT TIMES\n            LARGER.\nMy name is Dan Wiener and some say I have the Midas Touch when it comes to Vanguard’s funds. Seems every fund I recommend surges beyond\n        expectations. Lucky? Not really. I’ve been picking the perfect Vanguard funds for nearly 20 years and I’m doing it again right now!\n\n\n“Your Vanguard profits will surge 136% beyond your expectations this year.”\n\n\n\n\n\nDan Wiener, the man with the Midas Touch for Vanguard funds,\n                    wants you to get rich, too.\n\n\nThis is not a prediction. \n              IT’S A PROMISE!\nBut if you’re holding Vanguard’s most popular funds, your profit surge won’t happen. This Briefing tells you why you’re\n              better off selling those funds today, and how this year, you can more than double your profits with a fraction of the risk you’re taking\n              now.\n\n\nIt might seem I’m bragging a bit. But I’m just giving the facts. The same $100,000 that the average Vanguard investor grew to $384,095\n        pales compared to the $905,530 that investors who followed my advice would have.\nWe (my subscribers and I) did it all with Vanguard funds. Yes, a profit of $805,530. That’s $521,435 more profit than Vanguard’s\n        average investor. Staggering. And sad, because the facts show that the average Vanguard investor, and you might be among them, is missing out on\n        $32,589.69 each year in profits. \nEvery year you stay with Vanguard’s most popular funds is costing you plenty, my friend. But I’m not writing to you today to tell\n        a sad tale. \nI’m going to lift your Vanguard profits dramatically. And at the same time, I’m going to cut your risks, slash your unnecessary investment\n        costs and tell you how to get more out of your Vanguard funds. \nHow? Well, I’m about to reveal 19 Vanguard secrets that will put you on the right path. But first, let me get some necessary business out\n        of the way. \nTurn 25¢ into $89 on a Daily Basis!\nThat extra $32,589.69 Vanguard profit I deliver each year (about $89 a day in extra profits) to members can be yours for about 25¢ a\n        day. That’s the cost of my investment advisory service.\nThink of what this could mean to you. When every 25¢ you spend turns into $89—day after day, year after year—your life changes. \n\n\nHow Dan’s Vanguard \n            Midas Touch \n            Has Made His \n            Subscribers Rich \n\n\n \nAverage\n                    Vanguard\n                    Investor\nDan’s\n                    Growth Model\n                    Portfolio\n\n\nStarting Value\n$100,000 \n$100,000 \n\n\n1991\n$115,550 \n$128,900 \n\n\n1992\n124,147\n136,763\n\n\n1993\n137,480\n159,466\n\n\n1994\n137,164\n159,147\n\n\n1995\n166,792\n200,684\n\n\n1996\n188,591\n233,997\n\n\n1997\n223,235\n288,285\n\n\n1998\n256,207\n356,032\n\n\n1999\n285,774\n485,271\n\n\n2000\n288,631\n584,266\n\n\n2001\n275,845\n546,874\n\n\n2002\n250,053\n449,530\n\n\n2003\n294,138\n593,380\n\n\n2004\n322,346\n685,540\n\n\n2005\n342,331\n764,806\n\n\n2006\n384,095\n905,530\n\n\n% Advantage: 136%\n              Extra Profit: $521,435\n\n\nInstead of taking two-week vacations once a year, you can buy a second home in your favorite part of the world, and still afford to jet away to\n        other spots whenever you want. \nInstead of taking a part-time job to pay for a comfortable retirement, you can buy or start your own business. \nInstead of selling your home and moving into a smaller, cheaper place, you can amass a fortune, live like royalty and still leave a healthy legacy\n        to your children and grandchildren.\nTo achieve this, all you do is make that 25¢-for-$89 trade-off. And if you do it today, I will welcome you to the “club” with\n        11 FREE gifts to get you started. \nIf you’re not willing to trade a quarter for $89, I wish you all the luck in world investing with Vanguard on your own. Click\n      here now to learn more.\nThe New Rules for Building a \n        Bigger Fortune with Vanguard\nFirst off: Forget conventional wisdom. It can get you into deep trouble when you’re investing with Vanguard. \nIf you want bigger Vanguard profits, you do NOT have to take on bigger risks. But Vanguard really doesn’t want you to know this. \nThey want you to keep pouring money into their most popular funds, which brings us to the second rule of Vanguard investing: Forget indexing. \n\n\n\nFame Is Not Fortune \n\n\nVanguard became famous for indexing, but index investors do not become as rich as my members do. What’s worse is index investors have no\n        idea how risky those funds can be. And risk is the enemy. Controlling risks is probably one of the top reasons you’re investing in mutual\n        funds. But what you are about to discover will shock you. \nAs I reveal 19 secrets critical to your Vanguard success, you will begin to see how my Midas Touch works. And you will see how Vanguard’s\n        most cautious investors can be the ones taking on the most risks. Find out what they are by clicking here.\n19 Secrets You Must Know Now to\n        Build Wealth Safely at Vanguard\nSince I do not know what kind of investor you are, the following secrets I’m about to expose cover the entire landscape: Indexing, growth\n        investing, Vanguard’s closed funds, sector investing, income investing, annuities, diversification, and secrets covering buying and selling\n        Vanguard funds.\nVANGUARD SECRET #1\n500 Index is not the safest index fund, nor is it the most best-performing index fund, nor is it the best way to invest in\n          large-cap stocks. In fact, during the last bear market investors lost more than $40 billion in this fund.\n500 Index has more risk built into it than Vanguard wants you to know about. Diversified? Risk free? Below-average risk? Think again, my friend.\n\n\n\nCaution: Hidden Risks \n\n\nA whopping 26% of the fund’s assets are tied up in just 10 stocks, and nearly half (49%) of its assets are invested in just three sectors.\n        What’s more, 500 Index took an eternity—six years—to recover from the tech implosion. In fact, investors just barely got back\n        to even in December of 2006. \nVANGUARD SECRET #2\nVanguard has a fund that’s remarkably close to the 500 Index, except it’s safer, performs better, and it’s\n          actively managed!\nIf you want to invest along with the S&P 500, fine. But you’ll be much better off when you do it with a fund that can weed out the dogs\n        that live in index funds. \nVanguard has such a fund, and members of the Fund Family Shareholder Association (or FFSA, the organization I created in 1990 to help investors\n        get richer, faster in their mutual funds) know all about it. This fund holds just 120 stocks. 65% of its assets are in stocks that are included\n        in 500 Index (the best of the 500). The other 35% of its assets are put to work in other areas. And that’s where this fund’s professional\n        management skills prove their worth.\nVANGUARD SECRET #3\nIndex funds, even the best ones, simply don’t compare favorably to Vanguard’s best actively managed funds.\nVanguard has a slew of index funds with growth objectives, the 500 Index among them. And if you’re looking for capital appreciation and\n        you’re indexing to get it, well you’re making a costly mistake, one that traps the average Vanguard investor time and time again and\n        costs them up to 40% in profits year after year.\nPlease don’t lose 40% of your profits this year. Join FFSA today. Do not wait for Vanguard to tell you that indexing is last century’s\n        way to profit safely. They will never reveal this fact to you.\nIndexing is failing now. From 2000 to 2005, Vanguard’s index funds were down a collective 13.3%. But during that same five-year time frame,\n        the funds I recommended to FFSA members were up 17.9%—with 13% less risk!\n\n\n\n$50,000 Grows To $40,000 \n\n\nHad you been with us as a member since I created our exclusive Growth Model Portfolio (one of four portfolios I construct exclusively for members),\n        a $50,000 investment on your part would now be worth over $400,000. That’s an average annual return of 14.8%—for 16 years.\nVANGUARD SECRET #4\nMost growth investors buying managed funds are too heavily invested in U.S. stocks.\nThe real action these days is outside the U.S. Sure, our economy is growing, but our growth rate (expect a slower growth rate this year) is nothing\n        like what’s happening overseas. And Vanguard is right there, ready to let you in on all the action. \n\n\n\nHottest Fund \n\n\nAfter posting gains of 44.5% in 2003 and 20.1% in 2004, Vanguard closed their only truly global stock fund. But in August of 2005, it re-opened\n        and kept a standard low minimum ($3,000) to get in. What’s more, and this may shock you, this actively-managed global fund has about half the\n        risk of 500 Index. \nOnce you become a member of FFSA and start receiving our private advisory, you’ll see that this fund plays a major role in our Growth Model\n        portfolio. \nAs I said, this global fund is now open once again to new investors. But who knows? It could slam its doors shut again without notice at any moment.\n        So please, join us today.\nSpeaking of closed funds. If you follow Vanguard at all, no doubt you’ve been frustrated to find that many of the best funds are closed. \nTake, for example, the 10-year returns enjoyed by owners of Health Care: +355.5%. Or Capital Opportunity: +324.6%. Funds like these can set you\n        up for life! In fact, both of these funds paid my kids’ college tuitions. But both of them are now closed to new investors.\nIn all, seven of Vanguard’s funds are closed. And many of them are funds you’d be smart to own. No secret there. The big family secret\n        is that even if you don’t own them now, you can still get in!\nVANGUARD SECRET #5\nVanguard has a form you can pick off their website that enables you to get into their closed funds. \nFFSA members know this secret, of course. And knowing it has enabled many of them to reap tremendous rewards that otherwise would have been shut\n        off to them. By joining us, you can unlock many doors that are now closed to you. \nVANGUARD SECRET #6\nVanguard’s closed funds have clones that often present even better investment opportunities.\nCapital Opportunity’s kissing cousin is PRIMECAP, which sorry to say, is also closed. But PRIMECAP Core is wide open. It’s a healthy\n        hybrid of the two. Less than two years old, PRIMECAP Core is already piling up the profits like crazy (up more than 12% in each of its first two\n        years). \n\n\n\nBetter Than The Closed Funds \n\n\nWhat about Health Care? Does it have a clone? Yes! But many investors (non-members of FFSA, that is) fall into a trap seeking a Health Care clone.\n        The unknowing assume that Vanguard’s Health Care Index Fund is a good alternative. But it is not!\nFirst off, Health Care Index has a minimum initial investment of $100,000. With such a steep entry fee, it’s all but closed to most investors\n        anyway. Second, it both underperforms Vanguard’s managed Health Care fund and has a higher risk as well. Not a good combo.\nVANGUARD SECRET #7\nThe manager of Vanguard’s Health Care fund, Ed Owens, runs a health care fund outside of Vanguard that’s wide\n          open to you!\nSame fund manager. Same fund objectives. Different fund family. The fact that the best alternative to Vanguard’s closed Health Care fund\n        is not a Vanguard fund doesn’t stop me from recommending it to FFSA members, especially when there’s no stopping the demands for health\n        care.\nMore than 25% of our 300 million population (78 million of us!) are just now entering the phase of their lives when health care becomes the most\n        important aspect of their lives.\n\n\n\nBest Investment Trend \n\n\nIf you can only invest in one trend, health care should be it! And if you can’t get into Vanguard’s Health Care, don’t worry.\n        I’ll tell you all about Ed Owens’ other managed health care fund (you can bet the ranch Vanguard won’t tell you about it) as\n        soon as you join FFSA.\nAnother way to capture the growth of America’s 78-million strong baby boom generation is to buy shares of ETFs that are comparable to the\n        Health Care fund. You’ll learn which ETF to buy when your FFSA Welcome Package arrives.\n\n\n“Thanks”\n“Your membership price has already returned an improved performance. Thanks!”\n—R.W., Kernersville, NC\n“...a lot more money...”\n “It’s a comfort to have a talented adviser helping me make fund picks. I’ve come to trust Dan\n              and, so far, feel he has made a lot more money for me than I could have on my own.”\n—R.S., West Dover, VT\n“My future is \n              brighter now”\n“I used to only buy Vanguard’s most popular funds. I always went with the biggest, looking for safety.\n              But now, with Dan Wiener’s help, I’m seeing much better returns from funds I never considered before. My future is brighter now,\n              thanks to Dan.”\n—C.H., Boston, MA\n“I’ve been a Vanguard \n              investor \n            for years, but...\n“I was so wrapped up in trading stocks on my online account that I just about lost sight of Vanguard. When\n              it came to time pay my daughter’s college tuition, I saw that my Vanguard funds were making more money than I was trading stocks on\n              my own—and I trade with advice offered by several stock-picking gurus! As luck would have it, I received an invitation to join FFSA\n              on the same day I checked my Vanguard funds. FFSA promised me even greater Vanguard profits, so I joined. And FFSA kept every promise, big\n              time! Now my Vanguard investments are doing even better than before. I know now that Vanguard is where every nickel of serious money belongs—especially\n              now that I have FFSA guiding me to the best Vanguard has to offer.”\n—W.H., Philadelphia, PA\n\n\nVANGUARD SECRET #8\nOnly two of Vanguard’s ten $100,000 minimum sector funds produced double-digit returns. One actually lost money.\nIf you had $25,000 to pony up and ice water galloping through your veins, you could have gotten into Vanguard’s Energy fund and seen big\n        payoffs over the last several years. \nA smaller, albeit still chunky initial investment of $10,000, would have given you entry to Vanguard Precious Metals & Mining. It paid off\n        even better than the $25,000 minimum Energy.\nWhile it’s not quite true that the higher the minimum initial investment the lower the returns, it’s pretty darn close to being true. \nThe only sector fund that requires the standard $3,000 initial investment, REIT Index, outperformed 80% of the highest-priced funds. \nREIT Index is all about real estate. And you know what’s been happening in that sector lately. It’s cooling fast. So be careful chasing\n        after profits here.\n\n\n\nSpecial Caution \n\n\nCaution should also be exercised before you go chasing after Energy and Precious Metals. Those two sector funds have been Vanguard’s biggest\n        profit generators lately. But what goes up must come down. And the volatility of these two sector funds is so fierce that they represent not investments\n        but speculation.\nVANGUARD SECRET #9\nBuy a high-flying sector fund at the wrong time and you can see two-thirds of your money disappear.\nSector funds are tempting. But buying a sector fund is actually a form of market timing, which individual investors never seem to master. But\n        when you’re a member of FFSA, you suddenly have the world’s best portfolio managers, and my track record of success, on your side.\n        I make sure of it!\nWithout an expert guiding you, sector fund investing can be more akin to speculating, which is a nice word for gambling. If you want to speculate,\n        be ready to say goodbye to a large chunk of your money. And if you’re ready to lose a bundle speculating, why not skip mutual funds altogether,\n        buy a few penny stocks and hope for the best? \nBut if you want to be smart and limit your risks, make long-term investments that make real money for you safely and on a consistent basis, join\n        FFSA. As a member, you’ll have complete access to the Growth Model portfolio I’ve put together for FFSA members. Join today. \n\n\n\nBest Way To Cut Risk \n\n\nAs you’ll see when your FFSA Membership Package arrives, you don’t have to throw caution to the wind to grab the big paydays. Some\n        of the least-risky funds are some of the best producing!\nOne more thing. As I’ve mentioned above, many of Vanguard’s sector funds carry a high entry price, calling for a minimum investment\n        of $100,000. And most of those just aren’t worth the price of admission. Find out what stocks those are by clicking here.\nVANGUARD SECRET #10\nFunds that mandate initial investments of $100,000 can be yours for much less when you buy their equivalent ETFs.\nExchange Traded Funds are hot, which is to say they are highly popular, but not necessarily profitable for the investor who doesn’t know\n        how to use them properly. You’ll find out which ones are worth the brokerage commissions in your FFSA Welcome Package.\nVANGUARD SECRET #11\nYou can actually lose money in a “safe” fund designed to generate income.\nIf you invest with Vanguard for income, you have no room for risk. Yet, many Vanguard income investors have their money in bond funds and Treasuries\n        that are more than twice as risky as their benchmark, the Lehman Aggregate Bond Index.\nOk, maybe you don’t expect returns as high as you might get in a growth fund, but you certainly do expect less risk. And you certainly don’t\n        expect to lose money. But many Vanguard income investors do lose money. Take inflation into consideration and even more are losing money in income\n        funds.\nVANGUARD SECRET #12\n\n\n\nBeware Of The \"Name Game Trap\" \n\n\n57% of Vanguard’s taxable income funds are riskier than the industry-standard benchmark. Of the family’s tax-exempt\n          income funds, 64% are more risky.\nBut how would you know this? Vanguard doesn’t tell you. When it comes to helping you pick an income fund, Vanguard actually helps you fall\n        into traps. \nI call it the “Name Game Trap.” Vanguard has a lot of funds with “income” in their names. But my Income Model portfolio\n        constructed for FFSA members includes only one fund that has “income” in its name, and it only constitutes 10% of our model income\n        portfolio. \nI’ve examined all of Vanguard’s income funds and found most of them aren’t worth your dollars. In our quest to always double\n        the profits of the average Vanguard investor, I’ve found just one that does the job well enough to qualify for my portfolios—and you\n        can get its name when you join FFSA. Click here now. \n\n\nGet Into Vanguard’s \n              Closed Funds\n\n\n \n5-years\n10-years\n\n\nHealth Care\n57.20%\n355.50%\n\n\nCapital Opp.\n65.70%\n324.60%\n\n\nPRIMECAP\n49.80%\n228.90%\n\n\nIntl. Explorer\n180.50%\n335.4%\n                (7-yrs)\n\n\nJoin FFSA Today!\nLearn how you can blast open the gates of Vanguard’s closed funds. And find out about the little-known open funds that work as alternatives.\n              In many cases, the alternatives outperform their closed cousins. Click here now. \n\n\nVANGUARD SECRET #13\nYou can safely increase your income with a selection of dividend-paying equity growth funds that are actually less risky than\n          most bond funds.\nSo please, join us and stay out of the traps—get the truth about the many safe ways you can increase your income year after year. Our clear\n        strategy for blending equity growth funds to get a higher return is laid out for you when you become a member. \nVANGUARD SECRET #14\nOne Vanguard annuity has actually performed better than its underlying fund.\n\n\n\nVanguard's #1 Annuity \n\n\nVanguard won’t steer you away from any of their variable annuities, but they should forbid you from buying some of them.\nYou see, Vanguard’s annuity funds are tax-deferred clones of other funds. Buying one for your 401(k) is a costly mistake. Annuities are\n        expensive when compared to the underlying funds they mimic and there is absolutely no reason for you to have an annuity in an account that’s\n        already tax advantaged.\nSince they are more expensive than their underlying funds, annuity returns are almost always subpar. I said “almost.” \nAnd it’s not like the underlying fund, Windsor II, is a dog. It has rewarded investors with returns of 61.9% over the last five years. Still,\n        the annuity fund did even better—70.7%.\nThe manager of this annuity is Jim Barrow, one of Vanguard’s all-time best equity fund managers. The underlying fund, Windsor II, is run\n        by a host of different managers. But Mr. Barrow runs this annuity all by himself.\n\n\n\nA Safe 70.7% Return \n\n\nAnd yet, his is not the overall best Vanguard annuity fund. That title belongs to the tax-deferred clone of PRIMECAP. (Unlike PRIMECAP, this annuity\n        fund is not closed to new investors.) \nYour FFSA Welcome Package has all the details on these two top Vanguard annuities, as well as details on all of Vanguard’s best funds. Join\n        today.\nVANGUARD SECRET #15\nMidCap Growth has a remarkably close correlation to SmallCap Growth, which is closely correlated to LargeCap Index.\n\n\n\nAnother Hidden Risk \n\n\nNo matter which type of fund fits your investment objectives the best, you’re looking for the safety of diversification. That’s why\n        you turn to mutual funds, isn’t it?\nBet you didn’t realize that 13 of Vanguard’s growth funds have the exact same top-10 holdings. So, if you own two growth funds, chances\n        are you’re overexposed on those stocks. Overlapping investments, which is the opposite of diversification, is a trap far too many Vanguard\n        investors fall into. \nIn 2005, Vanguard introduced Diversified Equity, to help investors achieve favorable diversification easily. It’s a fund made up of other\n        funds.\nThe core of the fund is Growth & Income, which is just about as close as you can get to 500 Index. \nDiversified Equity also includes Windsor and Windsor II, U.S. Growth and Morgan Growth, Capital Value and MidCap Growth. So yes, Vanguard does\n        reach a degree of diversification with that mix.\n\n\n\nAnother \"Name Game Trap\" \n\n\nBut still, in the end, Diversified Equity isn’t much better than a straight total-market index fund. You simply don’t get the safety\n        you seek from Diversified Equity, no matter what Vanguard’s marketing might say. FFSA members know to avoid this disappointing fund. \nHowever, the Model Portfolios presented and tracked every month in our private advisory, The Independent Adviser for Vanguard Investors, are putting\n        this fund and others to shame on all counts! Diversification and returns! \nVANGUARD SECRET #16\nYou could get hit hard with taxes on gains the fund achieved during the months before you jump in.\n\n\nFFSA MEMBERSHIP IS \n            FOR EVERY KIND OF\n            VANGUARD INVESTOR \nEach of Dan Wiener’s four model portfolios is a collection of the very best Vanguard funds for a variety of investment strategies\n                and preferences. Each issue of Dan’s private advisory, The Independent Adviser for Vanguard Investors, tracks these four model\n                portfolios for you:\n\nGrowth Model\nConservative Growth Model\nIncome Model\nGrowth Index Model\n\n\n\nCan you imagine Vanguard telling you not to sink a large amount of money into any taxable fund late in the year? \nFunds normally pay out capital gains at the end of the year. Why should you pay taxes on gains realized before you got on board? So please, do\n        not buy just prior to a fund’s distribution date. Wait until the beginning of the year, or at least until after distributions are made. The\n        money you’ll save on taxes adds up and goes directly to your bottom line.\nVANGUARD SECRET #17\nYou can save on taxes and penalties by NOT automatically reinvesting your distributions.\nGenerally, automatically reinvesting capital gains distributions is a fine idea, but this practice can lead to a higher tax bill if you’re\n        the kind of investor who rebalances your portfolio from time to time.\nBuying more shares of a fund could conflict with rebalancing decisions that say you should be scaling back a bit. This will only lead you to a\n        bigger tax bite, since you’d have to sell some of your automatically reinvested shares. And if a back-end load is involved, then you could\n        find yourself paying that penalty as well.\nWhat should you do with your capital gains distributions? Have them directly deposited into your money market account. You’ll still pay\n        taxes on your distributions, but now you’ve given yourself the flexibility of moving that extra cash into the funds your rebalancing decisions\n        say need beefing up.\nVANGUARD SECRET #18\nFunds that lose money can still hand you a tax bill.\nObviously, paying taxes and taking a loss is a double whammy you do not want. Yet, many mutual fund investors find themselves in that situation\n        year after year. Believe me, that’s no way to build wealth for your future.\nThat’s why it’s so important for you to invest in tax efficient funds. FFSA membership will help you do this. As a member, you learn\n        all sorts of ways to make sure nothing comes between you and your profits.\nVANGUARD SECRET #19\nVanguard will accept additional investments in any amount, even less than $1.\nVanguard wants you to believe there’s a $100 minimum on investments you make into existing accounts. Not true. There is no such thing as\n        a minimum additional investment.\n\n\n\nThe Holy Grail for Vanguard Investors\n\n\nInvest as much as you can as often as you can. And during those months you might be a little tight, keep on investing even if you only have a\n        few bucks to put toward your future. It pays! And it pays double when you invest armed with the unique intelligence FFSA membership injects in\n        you. \nVanguard is a huge family with more family secrets than can be revealed here. Join FFSA and all the family secrets will be revealed\n      to you. \nKnowing all the secrets certainly helps, but the bottom line is making sure your money is in the funds that are best for you. And that’s\n        the core advantage of membership.\n\n\nEach Page of This FREE Gift Gives You \n              More Information Than Vanguard Ever Will!\nIn\n                this comprehensive book you’ll find: \n\nComplete, detailed profiles of every Vanguard fund (sample page shown in illustration below). \nDan Wiener’s specific insights on every fund—he tells you to buy, sell, or hold, and why. \nData on all of Vanguard’s fund managers and outside management companies. \nYear-by-year comparative return charts. \nFund comparisons by size, risk and portfolio turnover. \nVanguard’s history, philosophy, services and policies. \nImportant Vanguard phone numbers. \nAnd much, much more!\n\n\nFund Objective \n              States the fund’s primary and secondary objectives, types of securities, and percentage cash positions. Tells you if the fund is right\n              for you.\nTotal Return \n              Shows both the cumulative and annualized returns for the fund over the past three, five, seven and 10 years. Tells you how well the fund\n                has performed over time.\nGeneral Information \n              Lists minimum initial investments, percentage yield, when dividends are paid, the fund’s date of inception, its portfolio manager,\n              fees, telephone switch privilege and more. Tells you the basic facts you need to know.\nPerformance Comparison \n              Compares the yearly returns of the fund to the S&P 500 (monthly, too). Tells you if the fund has fared better or worse than the market\n              as a whole.\n1996-2006 Performance \n              Shows year-by-year total return, plus income and capital gains distributions, operating expenses, portfolio turnover rate, risk ratings,\n                size in $millions, and price at year’s end (Net Asset Value). Tells you if the fund is efficient, profitable, safe and more.\nRisk Level \n              Shows the Maximum Cumulative Loss (MCL) during the fund’s history, the number of months it took to accumulate that loss (MTL) and the\n              number of months it took to recover (MTR). Tells you the relative risk level of the fund.\nThis one-of-a-kind guide is yours FREE when you join FFSA!\n\n\nWhat Kind of Investor Are You?\nDo you favor large-caps? Do you invest for income? Growth? Do you feel most comfortable with index funds?\nI won’t pass judgment on your investment comfort zones or objectives. If you’ve just started out investing, if you’ve been at\n        it for years, if you’ve reached retirement or will within a few years, that’s your business.\nMy business is to empower you as a Vanguard investor. I’ll help you reach new levels of investment intelligence, satisfaction and wealth,\n        no matter what kind of Vanguard investor you are.\nI do this with four model portfolios. Each model portfolio is made up of a collection of the very best Vanguard funds for each of the following\n        investment goals:\n\nLong-Term Growth \nConservative Growth\nIncome and Growth\nGrowth through Indexing\n\nNaturally, I want your membership to take off like a rocket and put you on your way to double profits right from the start. That’s why I\n        have a box full of gifts in my office with your name on it. May I have your permission to send you these gifts?\nThe Most Important Gift Of All\nThe one gift that stands above all the others is The 2007 FFSA Independent Guide to the Vanguard Funds. I’m betting that you have\n        never seen anything like it before.\nThis gift alone gives you more than 225 pages of advice, analysis, facts, and figures on more than 100 Vanguard funds. Each fund is broken down\n        so that you fully understand what a fund does, who’s running the show, and most important—why you should or shouldn’t own it.\nEach profiled fund gets a full page of in-depth coverage, showing you information—at a glance—you can’t find anywhere else. \nYou’ll be amazed at how many fund facts you get and you’ll be amazed at how fast you get them. You learn levels of risk, performance\n        over the long and short term, and my own take on the fund, including my personal buy or sell recommendation.\nGo to the back of this guide and you’ll find special sections revealing even more important facts in an easy-to-use, easy-to-understand\n        format, facts you may never discover on your own (unless you get this book), including:\n\nTop holdings of each fund.\nThe biggest and smallest funds, ranked by size, and why this matters.\nThe oldest and newest funds, some of which may deserve your dollars, and some of which don’t.\nFunds ranked by risk. Need I say more?\nFunds ranked by turnover. A good start when looking for funds that won’t cost you more in taxes than they earn in returns.\nFunds ranked by operating expenses.\nFunds ranked by performance. \nThe place where the investment rubber meets the road.\nAnd an ingenious fund correlations chart that will keep you from overloading on one type of investment rather than diversifying the way the\n          most successful investors do. Let me explain.\n\nThis correlations chart shows you how closely the performance of one fund tracks that of another. All you need to do is apply a quick glance at\n        the chart.\nUse this chart to make sure you do not have overlapping investments. Use it to make sure you reach the level of diversification you desire. Use\n        it to find alternatives to closed funds. Use it to find alternatives to funds that have out-of-reach minimum initial investment requirements.\nYou cannot get this book anywhere else. I’ve written it for the exclusive use of FFSA members. \nIt’s yours FREE when you join FFSA, and you can keep it FREE even if you cancel your membership immediately.\nSame guarantee goes for all the other gifts I’ve reserved in your name. Each gift (there are 11 of them!) is described in more detail below. \nBut first, let me tell you about the special offer I’ve put together—it's our best introductory offer ever!\nExclusive Discount Offer Loaded With FREE Gifts!\nI can’t afford to make this generous offer to every Vanguard investor. But I will pass it along to another if you don’t want it. In\n        addition to the $89 extra profit per day you get as a member, you also get:\n\nMonthly issues of our members-only advisory, The Independent Adviser for Vanguard Investors, including:\n          \ncomprehensive analysis of overall market conditions, \nperformance analysis of all four model portfolios,\nexclusive interviews with Vanguard fund managers,\nfund distribution schedules,\nfund manager changes,\nadvance news of new funds,\nwarnings of funds facing closure,\nalternatives for closed funds,\nand yes, even more, much more!\n\n\ntelephone hotline access,\nprivate website access,\naccess to the FFSA message boards, comprised of some of the savviest Vanguard investors ever found,\ndiscounted dues for the first or first two years of your membership, your choice,\nup to 11 free gifts:\n\n\n\nBONUS\n                GIFT #1:\nIndexing for Maximum Profit at Vanguard\n              Vanguard is famous for its menu of index funds. But not all index funds are good choices. In fact, only a few are worth your investment dollars.\n                And Vanguard’s biggest fund, 500 Index, is not one of them. This bonus gift is the only source that reveals the very best Vanguard\n                index funds that belong in your portfolio.\n\n\nBONUS\n                GIFT #2:\nCapturing Global Wealth with Vanguard\n              Sure, the Dow is at an all-time high. But markets in Europe are also reaching new highs. And then there’s China, the fastest-growing\n              economy on earth, growing three to four times faster than our own. Yet U.S. equity funds are still more popular. Break away from the crowd\n              and enjoy breakout profits with international stock funds. Vanguard’s menu of international funds is extensive. Which ones are the\n              best? Which ones are too risky? Which ones belong in your portfolio? Find out without delay and watch your Vanguard profits soar.\n\n\nBONUS\n                GIFT #3:\nManaging Cash Profitably with Vanguard\n              How can you make a mistake with a money market fund? Easily, especially when you have so many choices. This gift makes it easy for you to\n                avoid the mistakes others unknowingly make with their cash. And your gift gets even more valuable when it explains how to use your cash\n                smartly so that you never miss out on opportunities.\n\n\nBONUS\n                GIFT #4:\nConquering Complexities at Vanguard: Making Success\n                  Simple\n              Vanguard has rules for buying and even more rules for selling funds. Mess up and you could be out a ton of money. And then there are the\n              tax rules. Oh my. But none of this is a source of confusion for FFSA members. Get this bonus gift and learn the secrets revealed in your\n              statements, discover the best way to organize your statements, how to account for dividends, the yearly portfolio decisions you must make,\n              and what you should do at tax time to save yourself a bundle.\n\n\nBONUS\n                GIFT #5:\nWhat to Do Now at Vanguard: Your Top Priorities\n              Long-term investing doesn’t mean no action is necessary. Funds change managers and sometimes even objectives. And the economic winds\n              are always shifting. That’s why it’s critical to stay in touch with what you own and what you should own. In this bonus gift,\n              you’ll learn about the best growth fund for 2007, the best income fund, the best fund if you’re going to retire in the next five\n              years, the best index fund for 2007, the safest way to invest in the coming tech rebound, the best place for your cash, and more.\n\n\nBONUS\n                GIFT #6:\nThe 2007 FFSA Independent Guide to the Vanguard\n                  Funds\n              No Vanguard investor should be without this resource. It is the bible of Vanguard mutual fund investing. More than 100 of Vanguard’s\n              best funds are deeply profiled in quick-reading fashion. You learn more about each fund in just a few minutes than you’ll ever learn\n              directly from Vanguard. (See above for a sample page.) This single resource uncovers terrific alternatives to closed funds\n              and funds that have prohibitively high initial investment requirements, tells you whether or not you own funds with overlapping investments,\n              helps you insure that your portfolio is properly diversified, shows you each fund’s top 10 holdings, warns you of the risk of each\n              fund, and gives you Dan Wiener’s buy/sell/hold recommendation on each fund.\n\n\nBONUS\n                GIFT #7:\nThe Independent Guide to Vanguard ETFs\n              Exchanged Traded Funds, indexing investments that trade like stocks, are hot, which is to say they are wildly popular. Vanguard introduced\n                its variant in 2001. ETFs can give you terrific tax advantages, can be much cheaper than even the lowest cost mutual fund, and offer you\n                greater flexibility to target a specific sector or geographical region. Vanguard’s ETFs are examined under a microscope in this book.\n                You’ll learn which ones are right for you, which ones to avoid, which ones serve as ideal alternatives to Vanguard’s closed\n                and high-entry price funds, which ones are safest and which ones carry the most risk. You cannot get this under-the-hood analysis anywhere\n                else. Join FFSA today and get yours FREE!\n\n\nBONUS\n                GIFT #8:\nMagnifying Your Income 2X with Vanguard\n              $15 value. Life with twice the income is twice as nice. And this gift shows you how easily you can double your income with Vanguard. And\n                make sure that your income keeps increasing year after year! You’ll discover what few Vanguard income investors know, such as the\n                bond fund that’s best for 2007, the only annuity fund you should own, the fund that kicks off more income to you than municipal bond\n                funds and dividend-based funds. Why live life with less income than Vanguard has to offer you? Your FFSA membership will keep you in the\n                money for the rest of your life!\n\n\nBONUS\n                GIFT #9:\nGetting Richer Racing to Retirement with Vanguard\n              If retirement is in your crosshairs, obviously it’s time to take aim at handsome profits without ugly risks. Not so obvious are the\n              funds you should own at this stage of life. Many investors go for target maturity funds or index-based funds. But this is a mistake. Too\n              many investors have their portfolios all out of whack, but you won’t be one of them once you get your hands on this book. You’ll\n              discover exactly how your portfolio should be constructed so that you get where you want to be in five years or sooner.\n\n\nBONUS\n                GIFT #10:\nGetting High Returns On Top of Big Dividends at\n                  Vanguard\n              Dividend-paying stocks are safe, right? Not always, especially when those stocks fall into sectors like energy and real estate. But Vanguard\n              has two funds managed by pros who can protect you from energy speculators who force prices up and down without warning. And if you haven’t\n              yet figured out that the Vanguard REIT Index could cost you 25% to 50% in 2007, this book will wake you up then show you the way to the next\n              sector that will generate the big returns and yields real estate once provided. Join FFSA today and this valuable guide is yours\n              FREE!\n\n\nSPECIAL\n              QUICK-ACTION EXTRA BONUS (Gift #11):\nShedding Losers: Vanguard Funds You Must Sell\n              Yours FREE when you join FFSA within the next 10 days. You cannot double your profits when you’re holding funds that are laggards or\n              downright losers. Vanguard has a host of funds that do not belong in your portfolio. This report lists them all, and gives you better choices\n              for each fund you must sell. Of all the gifts ready to be sent to you, you might want to check out this one first! To make it easy\n              for you to steer clear of bad funds immediately, you get this report online seconds after you order. Click here to download this\n              report. \n\n\nAll you have to do is decide: Join now and capture all the introductory bonuses offered for a two-year membership, or a one-year membership.\nDouble Money-Back Guarantee \nThe special money-back guarantee should help make your decision easy. You risk nothing as you double your Vanguard profits. All risk of your success\n        is on my shoulders. To prove it to you, I’m putting everything\n        in writing.\nFirst, every penny you spend on dues will be returned to you in full if you’re not 100% thrilled with your FFSA member-ship within the first\n        six months. Even if you enroll today for a two-year introductory membership, you get two years of membership dues returned. Plus, you get to keep\n        all the added FREE bonuses that come with a two-year membership.\nSecond, if you decide FFSA membership is not for you any time after your first six months, you’ll get a 100% refund of the entire balance\n        remaining on your membership. All the bonus gifts you get are yours to keep FREE!\n Remember, I am promising to double your Vanguard returns. And I am promising to give you this added money with half the investment risks you\n        might be taking now. If I do not live up to these promises, then please, take me up on this guarantee.\nAnd please, be sure to enroll before this exceptional introductory offer expires. It may never be presented to you again.\nSincerely,\n\nDan Wiener,\n        Founder of FFSA and Editor-in-Chief of The Independent Adviser for Vanguard Investors\nP.S.  Click here now to get an EXTRA FREE BONUS—Shedding Losers: Vanguard\n          Funds You Must Sell—simply\n        by getting your membership enrollment to us within the next\n        10 days.\n\n\n\n\n A PUBLICATION OF FUND FAMILY SHAREHOLDER ASSOCIATION.\n    This publication, FFSA, and The Independent Adviser for Vanguard Investors are completely independent of The Vanguard Group, Inc. \n\n\n\n---------------------------------------------------------\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you. Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=7XA153-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n        2420A Gehman Lane\n        Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n        All rights reserved.\n04/25/2007 2:14PM\n--------------------------------------------------------------------\n        Thank you for subscribing to InvestorPlace.com. Please note  that we cannot be liable for any missed bulletins caused by  overzealous spam filters. To ensure that you continue to receive this  valuable part of your service please take a moment to add (DanWiener@AdviserOnline.com) to your address book. Click here for instructions: \nhttp://www.adviseronline.com/whitelist.php?eml=DanWiener@AdviserOnline.com\n        --------------------------------------------------------------------\nee==7XA153 \n\n\n\n\n\n\n\n"}