{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Robynn Sturm\" <robynn.sturm@gmail.com>", "subject": "[Ip-health] Job Opening: UAEM Executive Director", "body": "This is a multi-part message in MIME format.\n--\nDear all -\n\nAs Michael and I must return to law school in the fall, we are on the hunt\nfor a permanent Executive Director. Please circulate the enclosed\nannouncement widely.\n\nMany thanks -\n\nRobynn\n\nExecutive Director\nUniversities Allied for Essential Medicines\nP.O. Box 206376\nNew Haven, CT 06520\nE-mail: robynn.sturm@essentialmedicine.org\nPhone: (301) 467-7489\n\nOur Labs. Our Drugs. Our Responsibility.\n\n------------------------\n\nUniversities Allied for Essential Medicines\nJob posting: Executive Director\n\nUniversities Allied for Essential Medicines (UAEM) is a coalition of\nstudents at top research institutions across the United States and Canada.\nOur mission is to (1) ensure every healthrelated innovation developed in\ncampus laboratories is made available in the developing world at the lowest\npossible cost, and (2) increase the amount and impact of university\nresearch on neglected diseases.\n\nUAEM grew out of a successful 2001 campaign to increase access to a critical\nHIV-AIDS drug developed at Yale University. Since 2001, UAEM steadily spread\nto over 35 campuses across the country. In the past year, this grassroots,\nstudent-led organization burst onto the national scene.\n\nTo capture the fast-building momentum and extraordinary growth, UAEM seeks\nto hire a permanent executive director and a full-time student fellow. The\nExecutive Director will be an energetic, dynamic, and committed individual\nwho works closely with the Student Board to develop and advance UAEM's\nadvocacy mission and to further the organization's financial and structural\ngrowth. The ideal Executive Director will be an entrepreneur and a\nvisionary, someone excited about working with a group that has proven\nefficacy and great potential, and building it into a powerful national\nmovement.\n\nKey Responsibilities Include:\n\n..In conjunction with UAEM's student leadership and professional advisory\nboard, develop UAEM's national advocacy strategy.\n..Work closely with student national management team for day-to-day\nimplementation of strategic plan.\n..Direct UAEM rapid-response efforts.\n..Represent UAEM at relevant conferences and meetings; build, nurture, and\nleverage institutional relationships; and coordinate campaigns will allies.\n..Oversee financial matters, including fundraising and budgeting.\n..Help mobilize and support grass-roots student base.\n..In conjunction with UAEM's student Communications Director, coordinate\nUAEM's press work and other public communications.\n\nAn ideal candidate will:\n\n..Be a motivated, creative leader and a self-starter.\n..Have two or more years of management experience. Experience with volunteer\nand/or student management specifically will be considered a significant\nplus.\n..Have a graduate-level degree, preferably in management. A public policy,\nlaw, medical, science, or public health degree would also be considered a\nplus.\n..Have advocacy experience, including grassroots work, lobbying, and/or\npress work.\n..Have a proven fundraising track record.\n..Have excellent interpersonal skills, especially the ability to build and\nmaintain strong relationships.\n..Have strong writing and editing skills.\n..Have a working knowledge of relevant issues, including access to\nmedicines, intellectual property.\n..Be willing to travel and work with students around the country.\nPrior membership in UAEM and/or similar advocacy organizations will also be\nconsidered a significant plus.\n\nThis position is full-time. Location of the position is negotiable, but\npreferably Boston, New York, Philadelphia, or Washington, D.C. Salary will\nbe competitive based on experience, with full benefits.\n\nHow to apply:\n\nPlease send a resume, cover letter, and three references (including one\nsupervisor and one employee/supervisee) to:\nEDposition@essentialmedicine.org.  Applications will be considered on a\nrolling basis.\n\n\n\n\n\n\n\n\n\n\n--\n[ ED Job Posting.pdf of type application/pdf deleted ]\n--\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}