{"category": "ham", "to_address": "\"Samba User's List\" <samba@samba.org>,\n   Samba Technical <samba-technical@samba.org>,\n   pkg-samba-maint@lists.alioth.debian.org", "from_address": "Christian Perrier <bubulle@debian.org>", "subject": "Re: [Samba] Binary_Packages/Debian", "body": "(extending the discussion to the ML of the Debian packaging team in\nthe Debian project. Sorry for the extensive quote)\n\nSimo Sorce in samba|samba-technical:\n\n> Dear users,\n\n> I have uploaded the new 3.0.25a packages compiled for sarge.\n> At the same time I have removed older 2.2.x and 3.0.x packages for\n> Woody.\n\n> Support for back porting packages to Woody was already discontinued, but\n> older packages were still provided. As these packages were not updated\n> after the recent security issues, I decided to remove them to avoid\n> pushing people to use outdated and insecure packages with the believe\n> they are ok because they are hosted on samba.org\n\n> I am looking to see if I have time to start publishing packages for\n> Etch, I am undecided yet, and I may discontinue this service. If someone\n> is highly motivated and wants to give a hand, please contact me\n> privately.\n\n> Simo.\n\n> -- \n> Simo Sorce\n> Samba Team GPL Compliance Officer\n> email: idra@samba.org\n> http://samba.org\n\n\nSimo, we already discussed this at SambaXP but why not try to merge\nthe efforts of the Debian packaging \"team\" for samba and\nyours/upstream ones?\n\nOf course, everybody knows about the policy in Debian to not update\nsoftware in stable. That policy means that we're stuck with 3.0.24 in\nEtch (indeed, we're still working on an update to fix regressions\nafter the two already published security fixes....).\n\nHowever, it does not prevent us to work on the backportability of the\npackages we build for the next Debian release.\n\nWhat would IMHO be pretty easy to do is:\n\n- reduce the number of Debian \"specific\" patches we use in the Debian\n  packages. Ideally, down to 0...:-)\n\n- check what specific changes you use yourself in the deb packages\n  published by the Samba Team and decide whether we can incorporate\n  them in the Debian packages. I suspect you indeed make as few\n  changes as possible, if any. After all, *you* are upstream\n\n- keep Debian packages in unstable backportable to Etch (they are\n  right now)\n\nAll this should make both packaging styles to converge together and,\nideally, the DEB files published on samba.org could then be simple\nbackports of the packages in Debian unstable.\n\nThe major obstacle to this are the patches we use. Just after SambaXP,\nI and Steve Langasek examined all of them and commented them. Several\nare marked \"forward upstream\" so it's just a matter of time for us to\nrecover from the recent security fixes/release hype (and the\nassociated bug reports mini-flood) and come back at you discussing\nabout these patches.\n\nSide effect of this: the Ubuntu packages would also converge and that\nwould probably help providing up-to-dat packages for earlier Ubuntu\nreleases. Currently, the Ubuntu packages are essentially derived from\nthe Debian ones with no (IIRC) patch to source code.\n\n\n\n"}