{"category": "spam", "to_address": "memolink@speedy.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for April 30th - May 6th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n                                Full Moon, May 2,  6:10 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    As you know, success-minded thinking requires a real commitment to personal growth.  Here's a tip that will help you continue on this path of positive change -- explore your interests and unique talents.  If there is something you love doing, then it is very important that you find a way to do it.\n    Now, I am not suggesting that you drop everything in order to pursue something like a career in acting, but do take the time to think about ways you can include your pursuits in your current life.  For example, if acting does happen to be a passion of yours, you could sign up for acting lessons or audition for community theatre.  I want you to get away from thinking that it has to be \"all or nothing.\"  Take some time this week to think about what you really enjoy doing, and jot down your top 3 favorite pastimes on a list.  Then write down small ways you can fit them into your life.\n    As you pursue your talents in this way, you will experience a new level of satisfaction.  This is because you are expressing more of who you are.  Anytime you express your authentic self, you will discover avenues of achievement that you would never have dreamed of.\n    This is a very exciting time for you, Memo, since you are unlocking your potential.  The most important thing is to believe in yourself.  The next most important thing is to embrace persistence -- do not give up for any reason until you are living the life you want.\n    Trust your intuition, it won't steer you wrong.  If deep down your subconscious is telling you, \"There has to be more to my life,\" rest assured that there is more, and that it is time that you went after it!\n    Remember always, Bethea and I are here to help you use this time to succeed.\n\n                      Until next week,                          \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n\n                 \n\n\n    There is a Full Moon on the 2nd in the intense sign of Scorpio.  As this occurs following a day of potent aspects for Venus and Mars, relationships are again under the spotlight.  Honesty is important and it really is better to express your feelings rather than bottling them up.  The potential for growth is really positive and could usher in a whole new phase of mutual understanding, not to mention pleasure.  Mercury combines with Saturn on the 6th and this is not a day to challenge authority figures, Memo!\n\n\n\n\n\nMemo             April 30 - May 6             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Friday is going to be your lucky day for this period.  And your Lucky Numbers are 03, 05, 10, 18, 26, 33.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nApril 30th for Memo\n\n\n\n\n\n\n\n\n\n    You will win arguments and debates by being calm but courageous.  You are probably feeling the urge to study, write or catch up on business correspondences.  A quick, short trip brings happiness.\n\n\n\n\n\n\n\n    If you've recently sent out invitations, you are likely to be surprised at the number of acceptances you receive.  This is a good time for social planning and engagements and for local travel.\n\n\n\n\n\n\n\n    Travel plans could take an unexpected backseat thanks to a surprise visitor.  Never mind; this person is bound to bring you lots of joy and happiness.  Be prepared for some thrilling news.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 1st for Memo\n \n \n \n \n \n \n \n    A significant person in your life could express affection for you now. Try to keep the big picture in mind, but it's okay to feel flattered. Accept their comment as a compliment.\n\n\n \n \n\n \n \n    Your social graces aid you in getting ahead.  Be sure to praise an associate's efforts.  It's so important to express appreciation for little services that make life easier.  Spread sunshine.\n\n\n\n\n\n\n\n\n\n\n\nMay 2nd for Memo\n\n \n \n \n \n \n \n    If you feel that cooperation and harmony are lacking in your life today, take a long, hard look at yourself in the mirror.  Change must begin within your own being before reflecting in your outer world.\n\n\n\n\n\n\n\n\n\n\nMay 3rd for Memo\n  \n \n\n \n \n \n    A few friends may get together today and include you in their gathering.  It would be a good idea to suggest that everyone bring their favorite foods.  You can all share and have fun.\n\n\n\n\n\n \n \n    No matter who you meet over the course of today, they'll be quite taken with you.  What to do?  Well, congratulate them on their good taste, first - then smile, and accept the invitations.\n\n\n \n\n \n \n    You can connect to someone at a very deep level today, and you might feel as if you are right inside their mind.  You might even get the sense that they understand you better than anyone.\n\n \n\n \n \n\n\n\n\n    A burden could be lifted from your shoulders.  Take this opportunity to set new goals for yourself.  You've proven that you can accomplish anything you desire.\n  \n \n\n\n\n\n\n\n\n\nMay 4th for Memo\n  \n \n \n\n\n \n \n    A household project that has been long in getting started may finally get started today.  Be sure to avoid overworking.  There's no reason why you have to finish it all in one day.\n\n\n\n\n\n\n\n\n\n\nMay 5th for Memo\n  \n \n \n \n \n \n    A romantic interest from the past could dominate your thoughts. Perhaps you'll hear from or about, them today.  It never hurts to dream. Pull out the old photos and enjoy your reminiscing.\n\n\n \n \n\n \n \n    You may be inspired to take up a new course of study designed to raise your status in the community.  This is a fabulous plan, my dear, and I encourage you to follow it through.  Good for you.\n\n\n \n \n\n \n \n    If you've been coping with feelings such as jealousy, possessiveness or restlessness, this can be a time for delving into your emotions and motivations.  When you understand yourself, progress is much easier.\n\n \n\n\n \n \n\n\n\n\n    It may be difficult to get a handle on your feelings right now. Perhaps you need some time alone to assess your situation in a clear and rational manner.  Take a break, my friend.   \n\n \n \n\n\n    Others may find your communicative skills to be forceful and bold. Today, you are better able to express your deepest feelings because perspectives are easier to gain, dear one.  Focus on a specific goal.\n \n \n\n \n\n\n    You are a highly passionate, vital individual, dearest one, but you may find it difficult to express your true feelings today.  Showing your affections means being as emotionally honest as possible.\n\n\n\n\n\n\n\n\nMay 6th for Memo\n \n \n \n \n \n\n \n \n    You could find yourself with time on your hands.  Take advantage of the occasion and do something fun.  How long has it been since you went to the zoo?  How about an amusement park?\n\n\n  \n\n \n \n    This is a marvelous time to enjoy creative activities with friends. See if there are any classes or workshops that you can take together. Check the calendar at your local craft shop.\n\n \n\n\n \n \n\n\n\n\n\n\n    Impulse spending is not likely to gain you quality purchases, nor will it encourage personal security today.  Anticipated travel plans may prove more costly than first expected.  Make further inquiries.\n \n \n\n\n\n\n\n\n\n\n    Intense feelings could surface next week, Memo, so you'll need to be on your guard….\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}