{"category": "ham", "to_address": "shirley zhang <shirley0818@gmail.com>", "from_address": "Spencer Graves <spencer.graves@pdf.com>", "subject": "Re: [R] Can I treat subject as fixed effect in linear model", "body": "      The short answer is that you could fit that fixed-effect model \nusing 'lm', for example.  That would make sense if you wanted to make \ninference only about that particular group of 20 subjects AND you \nthought it was inappropriate to consider that their contribution to a \nmodel would follow a normal distribution. \n\n      If you want to make inference beyond that group of 20 subjects, \nthen the fixed effect analysis is not appropriate.  If you thought it \nwas inappropriate to think that individual adjustments for each subject \nwere normally distributed, then the question is how far from normal \nmight they be. \n\n      I don't think Model2 is \"illegal\" in the sense that you are not \nlikely to be sent to prison for using it.  However, I wouldn't do it.  \nI'd make use your Model 1 and make all the plots that seem consistent \nwith that model, as described in Pinheiro and Bates (2000) Mixed-Effects \nModels in S and S-Plus (Springer).  If the plots (or something else) \nsuggested that some of my assumptions were inappropriate, then I'd \nconsider other alternative models.  However, that could be a lot of \nwork, and I wouldn't undertake such an effort without some pretty strong \njustification. \n\n      Hope this helps. \n      Spencer\n\nshirley zhang wrote:\n> Hi,\n>\n> There are 20 subjects grouped by Gender, each subject has 2 tissues\n> (normal vs. cancer).\n>\n> In fact, it is a 2-way anova (factors: Gender and tissue) with tissue\n> nested in subject. I've tried the following:\n>\n> Model 1: lme(response ~ tissue*Gender, random = ~1|subject)\n> Model 2: response ~ tissue*Gender + subject\n> Model 3: response ~ tissue*Gender\n>\n>\n> It seems like Model 1 is the correct one since my experiment design is\n> nested design. However, can anybody tell me whether Model2 is\n> completely illegal?\n>\n> Thanks\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}