{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] AP: Brazil AIDS Drug Negotiations Break Down", "body": "\nhttp://www.guardian.co.uk/worldlatest/story/0,,-6606687,00.html\n\nBrazil AIDS Drug Negotiations Break Down\n\n\nFriday May 4, 2007 4:16 AM\n\nBy MICHAEL ASTOR\n\nAssociated Press Writer\n\nRIO DE JANEIRO, Brazil (AP) - Brazil moved closer to breaking a patent\non a U.S.-manufactured anti-AIDS drug after negotiations with Merck &\nCo. broke down Thursday.\n\nThe government last week declared Merck's efavirenz anti-retroviral\ndrug a ``public interest'' medicine - a move that effectively gave\nMerck, based in Whitehouse Station, New Jersey, seven days to negotiate\nlower prices with the government or have Brazil strip the patent by\nissuing a compulsory license.\n\nNegotiations began in November with Brazil demanding the same price for\nefavirenz paid by the Thai government - 65 cents per 600 milligram\npill. Brazil at the time said it was paying US$1.59 per pill.\n\nThe United States has since placed Thailand on a list of copyright\nviolators after the Asian country moved to break patents on three\nanti-AIDS drugs, including those made by Abbott Laboratories and Merck.\n\nIn Thailand's capital of Bangkok, AIDS activists rallied outside the\nU.S. Embassy on Thursday to protest the decision, calling the Thai\ngovernment's move to break patents on pricey U.S.-made AIDS drugs a\n``lifesaver.''\n\nBrazilian officials turned down Merck's offer of a 30 percent discount\non the drug.\n\n``We at Merck were disappointed to have had what we consider to be a\nfair offer rejected by the government of Brazil,'' Merck spokeswoman\nAmy Rose said by phone from New Jersey. ``We remain flexible, open and\ncommitted to the negotiations.''\n\nThe matter now will be referred to President Luiz Inacio Lula da\nSilva's chief of staff who will decide whether to issue the compulsory\nlicense and allow Brazil to manufacture the drug or to buy generic\nversions while paying Merck a small royalty.\n\nBrazilian law and rules established under the World Trade Organization\nallow for compulsory licenses in a health emergency or if the\npharmaceutical industry uses abusive pricing.\n\nEfavirenz is the drug most widely used by Brazil's anti-AIDS program,\nwhich provides free medication for anyone who needs it.\n\nCurrently 75,000 of the 180,000 Brazilians who receive the free\ncocktail of anti-AIDS drug use efavirenz.\n\nBrazil has repeatedly managed to win price reductions in recent years\nfrom big pharmaceutical companies by threatening to break patents, but\nhas never actually done so.\n\nIn 2005, Brazil threatened to break the patent on Kaletra, an anti-AIDS\ndrug produced by Abbott Laboratories, but later reached an agreement.\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}