{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "Direct2Drive <owner-d2d_cp_announce_list@news.ign.com>", "subject": "Download Company of Heroes on Direct2Drive!", "body": "\n\n\nDirect2Drive\n\n\n\n\n\n\n\n\nApril 27th, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInfernal Uncensored - $35.95\n\"Infernal\" tells the story of Ryan Lennox, a fallen angel now recruited by hell to fight ?Etherlight?, heaven?s own secret agency.Pre-Order now and receive a 10% discount!\n \nSupreme Commander - $39.95\nSet in the 37th century, Supreme Commander signals the next evolution in the RTS genre by being the first strategy game to deliver a truly strategic and tactical experience. You direct one of three warring human factions as their Supreme Commander, the ultimate power on the battlefield.\n \nS.T.A.L.K.E.R. - $39.95\nCollect artifacts and trade, grope your path and keep an eye on the rear, catch roentgens and fight ? only make sure you survive! And then, perhaps, if you are persistent and truly lucky, you will find out why all this had fallen on you.\n\n\n \n \n \n \n \n\n\nVanguard - $39.99\nJoin a community of thousands of players online as you traverse a breathtaking landscape on the back of a dragon as you explore the grandeur of a world designed by the seminal fantasy artist Keith Parkinson.\n \nNight at the Museum - $19.95\nLarry Daley (Ben Stiller), a new security guard at The Museum of Natural History, soon discovers that when the lights go out, the gallery becomes an epic battleground fueled with non-stop action and adventure!\n \n24 Season 6: 12:00AM to 1:00AM - $1.99\nDevelopments involving Jack Bauer and Agent Mike Doyle have CTU operatives and analysts scrambling to gain control of an intense situation. Vice President Daniels prepares to address the country while presidential advisor Tom Lennox participates in a personnel decision that will shake things up.\n\n\n \n \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\nSTALKER: Shadow of Chernobyl\n$39.95\n6\n\n\nNeverwinter Nights 2\n$49.95\n\n\n2\n\n\nTitan Quest & Titan Quest Immortal Throne Bundle\n$44.95\n7\n\n\nThe Elder Scrolls IV: Oblivion\n$49.95\n\n\n3\n\n\nVanguard: Saga of Heroes\n$39.99\n8\n\n\nSid Meier's Civilization IV\n$39.95\n\n\n4\n\n\nSupreme Commander\n$39.95\n9\n\n\nSilent Hunter: Wolves of the Pacific\n$49.95\n\n\n5\n\n\nCompany of Heroes\n$39.95\n10\n\n\nMedieval II: Total War\n$49.95\n\n\n\n\n\n\n\n\n\nTo Unsubscribe: Click Here.\n\t\t\t\nYou have received this e-mail because you are a registered user of GameSpy and have opted-in to receive GameSpy email updates concerning new products and services. If you believe you're receiving this e-mail in error or prefer not to receive promotions from GameSpy.com, reply to this message to opt out of future promotional mailings. Our privacy policy is viewable at http://corp.igngamespy.com/privacy.html. You may still receive other e-mails from GameSpy. To update your e-mail address or manage your account, visit GameSpyID.com. It may take up to 10 days for adjustments to your email preferences. If you have questions about this offer or your services, you can reach Customer Service here.\n\t\t\n\t\tYou may mail inquiries to: IGN Entertainment, Inc., 8000 Marina Boulevard, 2nd Floor, Brisbane, CA 94005\nCopyright © IGN Entertainment, Inc. All rights reserved.  \n\n\n\n\n\n\n\n\n\n\n\n\n"}