{"category": "ham", "to_address": "\"John (J5) Palmieri\" <johnp@redhat.com>", "from_address": "\"Eben Eliason\" <eben.eliason@gmail.com>", "subject": "Re: [sugar] More than 10 Activities Solution?", "body": "On 5/25/07, John (J5) Palmieri  wrote:\n> On Fri, 2007-05-25 at 14:34 +0530, Joshua N Pritikin wrote:\n> > On Fri, May 25, 2007 at 09:51:05AM +0200, Marco Pesenti Gritti wrote:\n> > > Mike Sloman wrote:\n> > > > I have browsed through the mail lists and the HIG docs but have found no\n> > > > mention for a scheme to cope with more than 10 Activities in the Actions\n> > > > section of the frame.\n> > >\n> > > All the activities will be accessible from the Journal. Kids will be\n> > > able to add/remove them from the frame (also the bottom panel of the\n> > > frame will be \"scrollable\").\n> >\n> > I don't think only scrollable will work so well with GCompris. Currently\n> > GCompris organizes activities into a tree. There are 8 top-level\n> > activity categories and lots of activities beneath each category.\n> >\n> > As you know, GCompris is being ported to the sugar environment so we\n> > need to think about a proper solution.\n>\n> In that case GCompris should offer a view of all of its game boards and\n> have a way of adding a specific board to the task bar.  Standard\n> GCompris launch would be to launch into a select a game board mode.\n\n\u007fActually, I think as much as possible we want to prevent any kind of\nsplash selection screens.  What we do want to emphasize, on the other\nhand are concise, well designed, self-contained activities.  These\nactivities should be independent.  They should be able to be passed\naround, installed, and placed in the frame individually, not as a\nbundle.\n\nAs per the Sugar guidelines for design and naming, they should be\ncalled things like \"Puzzle\", \"Soduku\", \"Experiment\", etc.  The .info\nfiles for activities provide a means of tagging activities, so you can\neasily tag all of the activities with \"Gcompris\" and furthermore tag\nall of the \"algebra\" related activities with \"math\", \"algebra\",\n\"numbers\", \"addition\", etc.  This will allow the children to look in\ntheir Journal and search for all of their activities that relate to\n\"science.\"  A number of yours would show up, and perhaps a few others.\n The hierarchy and bundled application metaphor isn't part of Sugar,\nbut by following some of these guidelines, it should be possible to\nachieve similar results.\n\nDoes that help clarify the logic of the design a bit more?\n\n- Eben\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}