{"category": "ham", "to_address": "<adschai@optonline.net>", "from_address": "\"John Fox\" <jfox@mcmaster.ca>", "subject": "Re: [R] Fitting multinomial response in structural equation", "body": "Dear adschai,\n\nI'm not sure that I entirely follow what you want to do, but if the response\nreally is qualitative I don't see the sense in transforming it into a single\nquantitative variable. Nor does the strategy of generating 24 dichotomous,\nseparately modelled responses make sense, since these are correlated. In\nsome circumstances, however, one can resolve a polytomous response into a\nset of *nested* dichotomies, which are then independent of one another.\nFinally, I wouldn't as a general matter recommend fitting any statistical\nmodel to a 24-category response.\n\nI suspect that you'd do well to find someone with whom you can about your\nresearch problem.\n\nRegards,\n John\n\n--------------------------------\nJohn Fox, Professor\nDepartment of Sociology\nMcMaster University\nHamilton, Ontario\nCanada L8S 4M4\n905-525-9140x23604\nhttp://socserv.mcmaster.ca/jfox \n-------------------------------- \n\n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch \n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of \n> adschai@optonline.net\n> Sent: Saturday, April 21, 2007 4:32 PM\n> To: r-help@stat.math.ethz.ch\n> Subject: [R] Fitting multinomial response in structural equation\n> \n> Hi - I am confronting a situation where I have a set of \n> structural equation and one or two of my responses are \n> multinomial. I understand that sem would not deal with the \n> unordered response. So I am thinking of the following two ways:\n> \n> 1. Expanding my response to a new set of binary variables \n> corresponding to each label of my multinomial response. Then \n> use each of these as a separate response in my model. \n> However, since I have about 24 labels in this single \n> variable, it will be very expensive to do this way.\n> 2. I am thinking of transforming this variable into a \n> continous-valued variable. I am thinking of using the \n> observed count to transform this variable using the probit \n> function. Then my new variable is just a step-wise function. \n> The trouble that I am struggling with is that this response \n> variable will also serve as a predictor in another equation \n> in my structural model. The interpretation of this equation \n> is not so straightforward for me. The coefficient of this \n> variable is no longer reading 'a unit change in this variable \n> holding everything else fixed corresponds to the x unit \n> change of the response'. All I can read from this method is \n> that when I change from one label to another, it means p \n> amount change in my step-wise-function predictor variable and \n> it corresponds to x unit change of the response holding \n> everything fixed.\n> \n> The main purpose here for myself to post my question here is \n> to obtain your insight especially with respect to using sem \n> with the two approaches above. I would like to ensure that my \n> approaches make sense within the context of sem. Any \n> comments/opinions would be really appreciated. Thank you so \n> much in advance.\n> \n> - adschai\n> \n> \t[[alternative HTML version deleted]]\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}