{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nNew data the FBI released today shows violent crime\n  is on the rise in the United\n    States and in 2006 particularly spiked in\n  the country’s mid-size and large cities. Homicides climbed 6.7 percent\n  in big cities and robberies increased more than any other crime. Bob Orr will\n  have more of the figures tonight and Hari Sreenivasan will take a closer look\n  at New Orleans’\n  staggering rise in violent crime – especially since Hurricane Katrina.\n \nAnd as more information comes out about the plot to\n  bomb the jet fuel pipeline that supplies JFK\nAirport in New York, our investigative correspondent\n  Armen Keteyian will have the story of how safe our country’s fuel\n  supplies are.\n \nA militant Web site released video clips allegedly\n  showing the ambush that captured three U.S.\n  soldiers last month in Iraq.\n  The group claims all three soldiers have been killed, but the U.S.\n  military maintains that its search will go on. Lara Logan, who has spent the\n  day with the U.S. commander\n  for Iraq,\n  Gen. David Petraeus, will have the story.\n \nThe United\n    States could be facing a new threat from\n  an old foe. Russian President Vladimir Putin warned that his country could\n  take “retaliatory steps” if Washington\n  continues plans to build a missile defense system in Europe.\n  The threat came as President Bush headed to Europe\n  for the G8 talks, Jim Axelrod will report.\n \nAnd at The\n    Hague, American-educated African warlord Charles\n  Taylor failed to show up for the first day of his war-crimes trial. Sheila\n  MacVicar will report on the trial, revisiting the crimes for which Taylor is being tried – including using child\n  soldiers in the battlefields of diamond-rich Sierra Leone.\n \nFinally, of the 1,800 athletes who competed in the\n  Escape from Alcatraz triathlon this past\n  weekend, one relay team stood out. It was composed of three Iraq veterans, each of whom had\n  lost limbs in battle. Our John Blackstone will report on their story.\n \nI hope you’ll join us,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}