{"category": "ham", "to_address": "R-help@stat.math.ethz.ch", "from_address": "Alan Zaslavsky <zaslavsk@hcp.med.harvard.edu>", "subject": "[R]  Reasons to Use R", "body": "Right: SAS objects (at least in the base and statistics components of the \nsystem -- there are dozens of add-ons for particular markets) are simple \ndatabases.  the predominant model for data manipulation and statistical \ncalculation is a row by row operation that creates modified rows and/or \naccumulates totals.  This was pretty much the only way things could be \ndone in the days when real (and typically virtual) memory was much smaller \nthan it now is.  It can be a pretty efficient model for calculatons that \nfit that pattern.  One downside of course is that a line of R code can \neasily turn into 30 lines of SAS with data steps, sort steps, steps to \naccumulate totals, etc.\n\nAs noted by a couple of previous writers, S-Plus might be regarded as \nsomewhat intermediate in its model in that objects constitute files but \nrows do not correspond to chunks of adjacent bytes in memory or filespace.\n\nI have thought for a long time that a facility for efficient rowwise \ncalculations might be a valuable enhancement to S/R.  The storage of the \nobject would be handled by a database and there would have to be an \nefficient interface for pulling a row (or small chunk of rows) out of the \ndatabase repeatedly; alternatively the operatons could be conducted inside\nthe database.  Basic operations of rowwise calculation and cumulation\n(such as forming a column sum or a sum of outer-products) would be\nwritten in an R-like syntax and translated into an efficient set of\noperations that work through the database.  (Would be happy to share\nsome jejeune notes on this.)  However the main answer to thie problem\nin the R world seems to have been Moore's Law.  Perhaps somebody could\ntell us more about the S-Plus large objects library, or the work that\nSpie Bates is doing on efficient calculations with large datasets.\n\n \tAlan Zaslavsky\n \tzaslavsk@hcp.med.harvard.edu\n\n> Date: Tue, 10 Apr 2007 16:27:50 -0600\n> From: \"Greg Snow\" \n> Subject: Re: [R] Reasons to Use R\n> To: \"Wensui Liu\" \n>\n> I think SAS has the database part built into it.  I have heard 2nd hand\n> of new statisticians going to work for a company and asking if they have\n> SAS, the reply is \"Yes we use SAS for our database, does it do\n> statistics also?\"  Also I heard something about SAS is no longer\n> considered an acronym, they like having it be just a name and don't want\n> the fact that one of the S's used to stand for statistics to scare away\n> companies that use it as a database.\n>\n> Maybe someone more up on SAS can confirm or deny this.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}