{"category": "spam", "to_address": "<ktwarwic@flax24.uwaterloo.ca>", "from_address": "\"The Bull Report\" <news@thebullreport.com>", "subject": "News update: Sun Announces Production of Art of War Video Game", "body": "    To view this email as a web page, go    here.     \n\n\n\nThe Bull ReportMay 30th, 2007\nSun Announces Production of \"Art of War\" Video Game \nDALLAS, TX, May 30, 2007 (MARKET WIRE via COMTEX) -- SUN Sports & Entertainment Inc. (PINKSHEETS: SSPE) announced today that it has completed the formation of MMA Games LLC with partners Barking Lizards LLC (www.barkinglizards.com) and Summit Advisory Partners (\nwww.summitadvisorypartners.com) to create the new \"Art of War\" Video Game. \nAccording to Barking Lizard Technologies CEO Drew Fisher stated, \"'Art of War' for the Xbox 360 is being developed as a cutting edge fighting game that focuses on and reinforces the Art of War fighting competition. The game will be built using the latest techniques to deliver a compelling and innovative game mechanic specially designed for this type of fighting. In addition, the game will use likenesses of the current and future stars of the ring in new and fantastical ways, extending their capabilities beyond that of mere mortals.\" \nFisher added, \"The fighting game market is a rich and diverse market that is dominated by a few key players. To maximize the license, BLT will consider all the things that make the current and past round of games successful, and integrate the features the market is clamoring for into 'Art of War.'\" The game is expected to have a retail sales price of $44.95 with distribution internationally. \nRead the full release on SSPE\nRead the full disclaimer Click here\n\n\n\n\n\n                                    This email was sent to:  ktwarwic@flax24.uwaterloo.ca\n\n\n\n\n                                                            This email was sent by: The Bull Report                                                                                                              \n                                                            1846 rosemeade 104 dallas, TX 75007 USA \n                                                            \n\n\n          \n                                    We respect your right to privacy - view our policy\n\n\n\n\n\n\n\n\n\nManage Subscriptions | \n                                    Update Profile | \n                                    One-Click Unsubscribe\n\n\n\n\n\n"}