{"category": "spam", "to_address": "Ktwarwic <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Wendy Richmond <shirley@gransul.com>", "subject": "Orgasm evolution", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nClick here to become a sex giant\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nGo to the shop\nWe offer only legal and licensed medications. Cheapest prices you ever seen.\nWith best regards,\nWendy Richmond\n \n \nGolova prosto kruzhilas ot nerealnosti proishodiashchego, no poka ia Doverial svoemu zreniiu. Ili sam po sebe iavliaetsia istochnikom razvlecheniia. Sleduet zametit, chto emu podhodit daleko ne kazhdaia. Perehod ot Vatnoj tishiny k shumu byl nastolko rezok, chto ia chut ne podprygnul ot Neozhidannosti. \nTrudnovato bylo opredeliat ottenki chuvstv po zverinomu licu Nkota, no Mne pokazalos, chto on ustavilsia na priblizhaiushchiesia vozdushnye sudna s legkim Nedoumeniem. Ia videl iazyki Plameni, pliashushchie na obnazhivshihsia, obuglivaiushchihsia kostiah skeleta. Ia dolzhen ubeditsia, chto s nej vse v Poriadke. Myslenno ia pozhal plechami. Szhigat poddannyh eto vhodilo ranshe v podderzhku Tvoego prestizha ili novyj ritual byl priduman riverom? Kengsh skrivilsia, slovno v rot emu popalas nevynosimaia kisliatina. Tolko, opiat zhe Boius, tvoj Nkot ne dozhivet do etogo momenta, kak i ty. Rudnikah? Prygun?! Posadit pryguna na cep dlia menia bylo to zhe Samoe, chto nazvat sahar gorkim. Dozhd ne prekrashchalsia, dvizhushchaiasia vodianaia plenka s ravnodushnym uporstvom Razmyvala detali za steklom. \nIa perevel vzgliad na Onni, snova pogruzivshuiusia v svoi mysli i ne obrashchavshuiu Na razglagolstvovaniia malchishki nikakogo vnimaniia. A esli magu nuzhna, Naprimer, bashnia, on nanimaet obychnyh rabotnikov, umeiushchih vypolniat desiatki Drugih del, i rukovodit stroitelstvom sam. Videl by sejchas kto etih geroev, Ssoriashchihsia, kak maloletki. Kazhdaia tochka na tele otzyvalas noiushchej sadniashchej boliu, i dazhe stol Neznachitelnoe dvizhenie zastavilo smorshchitsia. ejisuminyon VkRQW0dcU1B0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}