{"category": "ham", "to_address": "james.love@keionline.org, random-bits@lists.essential.org,\n   ip-health@lists.essential.org", "from_address": "Gwen Hinze <gwen@eff.org>", "subject": "[Ip-health] Re: [Random-bits] WIPO PCDA 4 - Final Recommendation and Proposals", "body": "Just a quick note of clarification - the text below is the full New\nDevelopment Agenda, which comprises 45 proposals as follows:\n\n  - 21 proposals that were agreed at the 4th session of the WIPO PCDA\nlast week (the \"Annex B\" proposals listed below) and\n\n- 24 proposals that were agreed at the 3rd session of the WIPO PCDA\nheld in February 2007 (the \"Annex A\" proposals that are listed\nfollowing the Annex B proposals, below)\n\nThanks also to Teresa Hackett of the Electronic Information for\nLibraries project for note-taking.\n\nThe authors have dedicated the notes posted on EFF's blog to the public domain.\n\nMany thanks,\n\n- Gwen Hinze\n\n---\n\n\nAt 11:44 AM -0400 6/18/07, james.love@keionline.org wrote:\n>These are the outcomes of the last week's WIPO development agenda, pulled\n>together by EFF's Gwen Hinze and some others, and posted to EFF's\n>Deeplinks Blog (which also has more notes and comments from the\n>negotiations).\n>(http://www.eff.org/deeplinks/archives/005320.php)\n>\n>Notice first that these new June 15, 2007 PCDA recommendations and\n>proposals are *added* to ones that were negotiated in the February PCDA\n>meeting.  (See:\n>http://www.wipo.int/pressroom/en/articles/2007/article_0011.html#pcda) In\n>both cases (February and June), there are no brackets on the\n>recommendations.  This is finished, months before the WIPO General\n>Assembly meeting, where they will be officially adopted.\n>\n>By reading this document (and/or the earlier one), particularly the\n>substantive ANNEX B, it is clear how much WIPO has changed (for the\n>better) in the past year.\n>\n>Jamie\n>\n>Here are the new June 15 recommendations and proposals:\n>---\n>\n>THE NEW WIPO DEVELOPMENT AGENDA\n>\n>PCDA Recommendations to 2007 General Assembly\n>\n>(As adopted 9:38 pm June 15, 2007)\n>\n>The PCDA decided to make the following recommendations to the 2007\n>General Assembly:\n>\n>1.\tTo adopt the recommendations for action in the agreed\n>proposals contained in the Annex;\n>\n>2.\tTo immediately implement the recommendations contained in the\n>list submitted by the Chair of the PCDA, in accordance with paragraph\n>X of the Report of the Fourth Session of the PCDA;\n>\n>3.\tA Committee on Development and IP be established immediately to:\n>\n>a.\tdevelop a work-program for implementation of the adopted\n>recommendations;\n>\n>b.\tmonitor, assess, discuss and report on the implementation of\n>all recommendations adopted, and for that purpose it shall coordinate\n>with relevant WIPO bodies;\n>\n>c.\tdiscuss IP and development related issues as agreed by the\n>Committee, as well as those decided by the General Assembly.\n>\n>4.\tThe Committee will be composed of the Member States of WIPO\n>and open to the participation of all accredited intergovernmental and\n>non governmental organizations. It will consider and adopt rules of\n>procedure based on the WIPO General Rules of Procedure at its first\n>meeting, which will be convened in the first half of 2008. The number\n>and duration of meetings of the Committee are to be decided by the\n>General Assembly.\n>\n>5.\tFor the first meeting of the Committee, the present Chair of\n>the PCDA is requested to prepare initial working documents, including\n>a draft work program in consultation with Member States and the\n>Secretariat. The draft work program should address, inter alia, the\n>financial and human resources requirements for inclusion in WIPO's\n>budgetary planning process.\n>\n>6.\tThe Committee will report and may make recommendations\n>annually to the General Assembly.\n>\n>7.\tThe PCIPD shall cease to exist and the mandate of the PCDA\n>will not be renewed.\n>\n>\n>ANNEX B\n>DRAFT AGREED PROPOSALS (as at 15 June 2007)\n>\n>CLUSTER A: TECHNICAL ASSISTANCE AND CAPACITY BUILDING\n>\n>1.\tTo assist Member States to develop and improve national IP\n>institutional capacity through further development of infrastructure\n>and other facilities with a view to making national IP institutions\n>more efficient and promote fair balance between IP protection and the\n>public interest. This technical assistance should also be extended to\n>sub-regional and regional organizations dealing with IP.\n>\n>2.\tTo assist Member States to strengthen national capacity for\n>protection of domestic creations, innovations and inventions and to\n>support development of national scientific and technological\n>infrastructure, where appropriate, in accordance with WIPO's mandate.\n>\n>3.\tTo further mainstream development considerations into WIPO's\n>substantive and technical assistance activities and debates, in\n>accordance with its mandate.\n>\n>4.\tWIPO's legislative assistance shall be, inter alia,\n>development-oriented and demand-driven, taking into account the\n>priorities and the special needs of developing countries, especially\n>LDCs, as well as the different levels of development of Member States\n>and activities should include timeframes for completion.\n>\n>5.\tWithin the framework of the agreement between WIPO and the\n>WTO, WIPO shall make available advice to developing countries and\n>LDCs, on the implementation and operation of the rights and\n>obligations, and the understanding and use of flexibilities contained\n>in the TRIPS Agreement.\n>\n>\n>CLUSTER B: NORM-SETTING, FLEXIBILITIES. PUBLIC POLICY AND PUBLIC DOMAIN\n>\n>\n>1.\tIn its activities, including norm-setting, WIPO should take\n>into account the flexibilities in international IP agreements,\n>especially those which are of interest to developing countries and\n>LDCs.\n>\n>2.\tTo urge the IGC to accelerate the process on the protection\n>of genetic resources, traditional knowledge and folklore, without\n>prejudice to any outcome, including the possible development of an\n>international instrument or instruments.\n>\n>3.\tTo initiate discussions on how, within WIPO's mandate, to\n>further facilitate access to knowledge and technology for developing\n>countries and LDCs to foster creativity and innovation and to\n>strengthen such existing activities within WIPO.\n>\n>4.\tTo promote norm-setting activities related to IP that support\n>a robust public domain in WIPO's Member States, including the\n>possibility of preparing guidelines which could assist interested\n>Member States in identifying subject matters that have fallen into\n>the public domain within their respective jurisdictions.\n>\n>5.\tWIPO shall conduct informal, open and balanced consultations,\n>as appropriate, prior to any new norm-setting activities, through a\n>member-driven process, promoting the participation of experts from\n>Member States, particularly developing countries and LDCs.\n>\n>6.\tWIPO's norm-setting activities should be supportive of the\n>development goals agreed within the UN system, including those\n>contained in the Millennium Declaration.\n>\n>The WIPO Secretariat, without prejudice to the outcome of Member\n>States considerations, should address in its working documents for\n>norm-setting activities, as appropriate and as directed by Member\n>Sates, issues such as: a)  safeguarding national implementation of\n>intellectual property rules [b) competition c) IP-related transfer of\n>technology) d) potential flexibilities, exceptions and limitations\n>for Member States and e) the possibility of additional special\n>provisions for developing countries and LDCs.\n>\n>7.\tTo consider how to better promote pro-competitive IP\n>licensing practices, particularly with a view to fostering\n>creativity, innovation and the transfer and dissemination of\n>technology to interested countries, in particular developing\n>countries and LDCs.\n>\n>CLUSTER C: TECHNOLOGY TRANSFER, INFORMATION AND COMMUNICATION\n>TECHNOLOGY (ICT) AND ACCESS TO KNOWLEDGE\n>\n>\n>1.\tTo include discussions on IP-related technology transfer\n>issues within the mandate of an appropriate WIPO body.\n>\n>2.\tWIPO should cooperate with other intergovernmental\n>organizations to provide to developing countries, including LDCs,\n>upon request, advice on how to gain access to and make use of\n>IP-related information on technology, particularly in areas of\n>special interest to the requesting parties.\n>\n>3.\tTo undertake initiatives agreed by Member States which\n>contribute to transfer of technology to developing countries, such as\n>requesting WIPO to facilitate better access to publicly available\n>patent information.\n>\n>4.\tTo have within WIPO opportunity for exchange of national and\n>regional experiences and information on the links between IP rights\n>and competition policies.\n>\n>CLUSTER D: ASSESSMENTS, EVALUATION AND IMPACT STUDIES\n>\n>1.\tTo exchange experiences on open collaborative projects such\n>as the Human Genome Project as well as on IP models.\n>\n>2.\tUpon request and as directed by Member States, WIPO may\n>conduct studies on the protection of intellectual property, to\n>identify the possible links and impacts between IP and development.\n>\n>3.\tTo strengthen WIPO's capacity to perform objective\n>assessments of the impact of the organization's activities on\n>development.\n>\n>\n>CLUSTER E: INSTITUTIONAL MATTERS INCLUDING MANDATE AND GOVERNANCE\n>\n>1.\tTo consider how to improve WIPO's role in finding partners to\n>fund and execute projects for IP-related assistance in a transparent\n>and member-driven process and without prejudice to ongoing WIPO\n>activities.\n>\n>2.\tIn accordance with WIPO's member-driven nature as a United\n>Nations Specialized Agency, formal and informal meetings or\n>consultations relating to norm-setting activities in WIPO, organized\n>by the International Bureau, upon request of the Member States,\n>should be held primarily in Geneva, in a manner open and transparent\n>to all Members. Where such meetings are to take place outside of\n>Geneva, Member States shall be informed through official channels,\n>well in advance, and consulted on the draft agenda and program.\n>\n>\n>And here are the 24 \"Annex A\" proposals agreed at the third session\n>of the PCDA on 24 February 2007:\n>\n>\n>Cluster A: Technical Assistance and Capacity Building\n>\n>1. WIPO technical assistance shall be, inter alia, development-\n>oriented, demand-driven and transparent, taking into account the\n>priorities and the special needs of developing countries, especially\n>Least Developed Countries, as well as the different levels of\n>development of Member States and activities should include time\n>frames for completion. In this\n>regard, design, delivery mechanisms and evaluation processes of\n>technical assistance programs should be country specific.\n>\n>2. Provide valuable assistance to WIPO through donor funding, and\n>establish Trust-Funds or other voluntary funds within WIPO\n>specifically for LDCs, while continuing to accord high priority to\n>finance activities in Africa through budgetary and extra-budgetary\n>resources, to promote, inter alia, the legal, commercial, cultural,\n>and economic exploitation of intellectual property in these countries.\n>\n>3. Increase human and financial allocation for technical assistance\n>programs in WIPO for promoting a, inter alia, development-oriented\n>intellectual property culture, with an emphasis on introducing\n>intellectual property at\n>different academic levels and on generating greater public awareness\n>of intellectual property.\n>\n>4. Place particular emphasis on the needs of SMEs and institutions\n>dealing with scientific research and cultural industries and assist\n>Member States, at their request, in setting-up appropriate national\n>strategies in the field of intellectual property.\n>\n>5. WIPO shall display general information on all technical assistance\n>activities on its website, and shall provide, on request from Member\n>States, details of specific activities, with the consent of the\n>Member State(s) and other recipients concerned, for which the\n>activity was implemented.\n>\n>6. WIPO's technical assistance staff and consultants shall continue to\n>be neutral and accountable, by paying particular attention to the\n>existing Code of Ethics, and by avoiding potential conflicts of\n>interest. WIPO shall draw up and make widely known to the Member\n>States a roster of consultants for technical assistance available\n>with WIPO.\n>\n>7. Promote measures that will help countries deal with IP-related\n>anti-competitive practices, by providing technical cooperation to\n>developing countries, especially LDCs, at their request, in order to\n>better understand the interface between intellectual property rights\n>and competition policies.\n>\n>8. Request WIPO to develop agreements with research institutions and\n>with private enterprises with a view to facilitating the national\n>offices of developing countries, especially LDCs, as well as their\n>regional and sub-regional IP organizations to access specialized\n>databases for the purposes of patent searches.\n>\n>9. Request WIPO to create, in coordination with Member States, a\n>database to match specific IP-related development needs with\n>available resources, thereby expanding the scope of its technical\n>assistance programs, aimed at bridging the digital divide.\n>---\n>Cluster B: Norm Setting, Flexibilities, Public Policy and Public Domain\n>\n>1. Norm setting activities shall:\n>\n>- be inclusive and member driven;\n>- taken into account different levels of development;\n>- take into consideration a balance between costs and benefits;\n>- be a participatory process, which takes into consideration the\n>interests and priorities of all WIPO Member States and the viewpoints\n>of other stakeholders, including accredited inter-governmental\n>organizations and non-governmental organizations; and\n>- be in line with the principle of neutrality of the WIPO Secretariat.\n>\n>2. Consider the preservation of the public domain within WIPO's\n>normative processes and deepen the analysis of the implications and\n>benefits of a rich and accessible public domain.\n>\n>---\n>\n>Cluster C: Technology Transfer, Information and Communication\n>Technologies (ICT) and Access to Knowledge\n>\n>1. To request WIPO, within its mandate, to expand the scope of its\n>activities aimed at bridging the digital divide, in accordance with\n>the outcomes of the World Summit on the Information Society (WSIS),\n>also taking into account the significance of the Digital Solidarity\n>Fund (DSF).\n>\n>2. To explore IP-related policies and initiatives necessary to\n>promote the transfer and dissemination of technology, to the benefit\n>of developing countries and to take appropriate measures to enable\n>developing countries to fully understand and benefit from different\n>provisions, pertaining to flexibilities provided for in international\n>agreements, as appropriate.\n>\n>3. To encourage Member States, especially developed countries, to\n>urge their research and scientific institutions to enhance\n>cooperation and exchange with research and development institutions\n>in developing countries, especially LDCs.\n>\n>4. Facilitating IP-related aspects of ICT for growth and development:\n>Provide for, in an appropriate WIPO body, discussions focused on the\n>importance of IP-related aspects of ICT, and its role in economic and\n>cultural development, with specific attention focused on assisting\n>Member States to identify practical IP-related strategies to use ICT\n>for economic, social and cultural development.\n>\n>5. To explore supportive IP-related policies and measures Member\n>States, especially developed countries, could adopt for promoting\n>transfer and dissemination of technology to developing countries.\n>\n>---\n>Cluster D, Assessment, Evaluation and Impact Studies\n>\n>1. To request WIPO to develop an effective yearly review and\n>evaluation mechanism for the assessment of all its\n>development-oriented activities, including those related to technical\n>assistance, establishing for that purpose specific indicators and\n>benchmarks, where appropriate.\n>\n>2. With a view to assisting Member States in creating substantial\n>national programs, to request WIPO to conduct a study on constraints\n>to intellectual property protection in the informal economy,\n>including the tangible costs and benefits of IP protection in\n>particular in relation to generation of employment.\n>\n>3. To request WIPO to undertake, upon request of Member States, new\n>studies to assess the economic, social and cultural impact of the use\n>of intellectual property systems in those States.\n>\n>---\n>Cluster E: Institutional Matters including Mandate and Governance\n>\n>1. To request WIPO, within its core competencies and mission, to\n>assist developing countries, especially African countries, in\n>cooperation with relevant international organizations, by conducting\n>studies on brain drain and make recommendations accordingly.\n>\n>2. To request WIPO to intensify its cooperation on IP related issues\n>with UN agencies, according to Member States' orientation, in\n>particular UNCTAD, UNEP, WHO, UNIDO, UNESCO and other relevant\n>international organizations, especially WTO, in order to strengthen\n>the coordination for maximum efficiency in undertaking development\n>programs.\n>\n>3. To conduct a review of current WIPO technical assistance\n>activities in the area of cooperation and development.\n>\n>4. To enhance measures that ensure wide participation of civil\n>society at large in WIPO activities in accordance with its criteria\n>regarding NGO acceptance and accreditation, keeping the issue under\n>review.\n>\n>---\n>Cluster F - Other Issues\n>\n>1. To approach intellectual property enforcement in the context of\n>broader societal interests and especially development-oriented\n>concerns, with a view that \"the protection and enforcement of\n>intellectual property rights should contribute to the promotion of\n>technological innovation and to the transfer and dissemination of\n>technology, to the mutual advantage of producers and users of\n>technology knowledge and in a manner conducive to social and economic\n>welfare, and to a balance of rights and obligations\", in accordance\n>with Article 7 of the TRIPS Agreement.\n>_______________________________________________\n>Random-bits mailing list\n>Random-bits@lists.essential.org\n>http://lists.essential.org/mailman/listinfo/random-bits\n\n\n--\nGwen Hinze\nInternational Affairs Director\nElectronic Frontier Foundation\nEmail:gwen@eff.org\nTel.: + 1 415 436 9333 x110\n\nPlease support EFF - Working hard to protect your digital rights and\nfreedom of speech since 1990\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}