{"category": "spam", "to_address": "catchall@flax9.uwaterloo.ca", "from_address": "\"BancoPosta\" <info@poste.it>", "subject": "Poste.it chiede il vostro contributo !", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n                                                      \n \n \nPoste.it chiede il vostro contributo:\n \nPer i possessori di carta PostePay o di un conto BancoPosta, a seguito di verifiche nei nostri database clienti, si è reso necessario per l'utilizzo online la conferma dei suoi dati. Le chiediamo perciò di confermarci i dati in nostro possesso entro 7 giorni dalla presente, accedendo al seguente form protetto:\n                                                    Accedi ai servizi online di Poste.it e verifichi il suo account » \n             \nL'Assistenza Clienti, dopo aver ricevuto la documentazione e averne verificato la completezza e la veridicita, provvedera immediatamente ad attivare il suo \" Utente Verificato \".\nPer chi non fosse ancora cliente di Poste.it .... \n\nDa oggi la possibilità di usufruire dei servizi online di Poste.it anche ai titolari di carte di creditodebito di altri gestori, potendo così tenere sempre sotto controllo il proprio saldo, gli ultimi 40 movimenti, potendo ricaricare carte postepay, pagare le sue bollette direttamente da casa e moltissimo altro! \nSarà inoltre possibile per tutti i possessori di carte di creditodebito dei circuiti VISA Electron, Mastercard, American Express, ricaricare il proprio telefono cellulare * senza alcun costo aggiuntivo *\n \nContact Center\nNumero gratuito 803.160 (dal lunedi al sabato dalle ore 8 alle ore 20). \n\n\n \n© Poste italiane 2007\n"}