{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "5p 6/13 Update: Array retracted nearly 50 feet; spacewalkers turn to other tasks", "body": "\n\n\n\n\n5p 6/13 Update: Array retracted nearly 50 feet; spacewalkers turn to other tasks\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 51\nPosted: 4:54 PM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-48 (06/13/07): Solar array retraction work begins\n   SR-49 (06/13/07): Solar array retracted 7.5 bays; EVA on tap; Russian computers down again\n   SR-50 (06/13/07): Spacewalk begins\n   SR-51 (06/13/07): Solar array pulled in nearly 50 feet; more work Thursday but flight controllers pleased with progress\n\n=================================\n\n4:54 PM, 6/13/07, Update: Solar array pulled in some 45 feet; more work Thursday but flight controllers pleased with progress\n\nAfter crewmates robotically retracted the P6-2B solar array some 28 feet, spacewalkers Steve Swanson and Pat Forrester, anchored to the end of the space station's robot arm, used insulated tools and a gentle touch to free bunched-up blanket slats so the panel could be pulled in an additional 17 feet or so.\n\nGiven problems retracting the other side of the array last December, flight controllers were elated with the result of today's work. While more time will be needed to complete the job Thursday and Friday, if necessary, it was clear the step-by-step approach based on lessons learned from the December mission had paid off.\n\n\"OK, Pat and Swanny, here's the big pictyure plan,\" astronaut Jim Reilly radioed from inside the Destiny lab module. \"We're going to fluff these (blankets) as best you can get them and set up for a retract tomorrow. We're going to call it quits on this part of your job today. Excellent job. And we'll press on with the rest of our SARJ tasks.\"\n\nHe was referring to the solar alpha rotary joint in the S3 truss segment that is just inboard of the new S4 solar arrays installed Monday. The SARJ uses a large gear and two drive motors to rotate the outboard arrays so they can stay roughly face-on to the sun as the station circles the planet.\n\nForrester and Swanson plan to engage the second of the two drive motors - the first was engaged during a spacewalk Monday - and to remove a variety of launch locks. They also will reposition internal braces to stiffen the truss segment.\n\nThe spacewalkers spent about 45 minutes longer on the solar array retraction work than originally planned. But in the end, they pulled the array in five or so additional bays.\n\n\"Pat and Swanny left them in a really nice config for (in-cabin retraction) attempts later on,\" Sturckow radioed.\n\nWorking at computers inside Destiny, the astronauts successfully retracted the 115-foot-long solar panel 28 feet or so before stopping when grommets began hanging up on guidewires. Forrester and Swanson then floated up to the array and used insulated tools to free the blanket's slats and to cut away a spring in the tension system that had popped off its connector.\n\nFinally, an hour and 26 minutes after the spacewalk began, the astronauts were ready for another retraction cycle. As before, the plan was to command the motor-driven central mast to pull in one 45-inch-deep bay and then to stop for an assessment.\n\n\"Retract on my mark... three, two, one, mark,\" Reilly radioed at 4:02 p.m.\n\n\"Looks good so far,\" Forrester observed from his perch on the robot arm just a few feet from the panel.\n\n\"Yeah, looks great,\" Swanson agreed.\n\n\"OK, abort command is sent,\" Reilly said. \"And Houston, Atlantis, if you like what you see, we're ready to continue the retraction.\"\n\nFlight controllers did not have live video, but gave the crew permission to press ahead.\n\n\"Sunset's coming in just a few minutes,\" Reilly told the spacewalkers as the station sailed high above northern Europe. \"But we're going to retract one more bay. OK, retract on my mark... three, two, one, mark.\"\n\n\"It's looking pretty good to me,\" Forrester said after another bay had been retracted.\n\n\"It looks good,\" Swanson agreed.\n\n\"Then we're going to try one more,\" Reilly said. \"Retract on my mark... three, two, one, mark.\"\n\nAgain, the blankets folded smoothly. But on the next retraction cycle, shuttle commander Rick Sturckow interrupted the movement after a half-bay when some of the slats appeared to be bunching up. Forrester and Swanson quickly resolved the problem.\n\n\"OK, there we go,\" one of the astronauts said. \"That's what was holding it up.\"\n\n\"And Houston, Atlantis, for retract,\" Reilly called down. \"We're going to press in one bay with your concurrence.\"\n\n\"JR, we're ready,\" astronaut Megan McArthur replied from Houston.\n\n\"In work. Retract on my mark,... three, two, one, mark.\"\n\nAgain the blankets folded smoothly but during a final retraction cycle, more blanket slats bunched up and Sturckow stopped after about a half bay. The spacewalkers were asked to \"fluff up\" the blankets and to press ahead with work to activate the SARJ.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}