{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: The GPL and soundfonts", "body": "Andrew Sidwell wrote:\n> I'm sorry, I didn't make myself clear.  That last paragraph was meant to\n> indicate WAV files which were derived from MIDI files via use of\n> non-free soundfonts, not the original MIDI file itself.\n\nThe DFSG would require that the soundfont license be \"DFSG free\" in\norder for the WAV to be considered DFSG free, IMHO.\n\nThe issue of whether the fonts can be combined with the GPL MIDI is\ntrickier. Conservatively, I would say that this requires the soundfont\nlicense to be GPL-compatible. This is based on the idea that the\nMIDI+soundfonts WAV is a \"derivative work\" of both the MIDI and the\nsoundfonts and not merely a \"use\" of the MIDI.\n\nHowever, if the license on the soundfonts is DFSG free so that the\nresulting two entities: MIDI and soundfonts can be distributed under\nDFSG free terms independently, then you might want to simply ask the\nMIDI creator to add an exemption, just like the one GPL graphic fonts\nusually use to allow PS or PDF documents that embed the font without\nhaving to GPL the documents' contents. In fact you could probably lift\nthe boilerplate for that from one of the graphic fonts already in\nDebian. It probably was not their intent to restrict rendering of their\nMIDI.\n\nIMHO, the license of the sequencing software you used is completely\nirrelevant. You USE a toolchain when you create with it, you don't\nDERIVE from it (the exception being things like libraries -- or\nsoundfonts -- that get incorporated into the resulting work).\n\nSo, the soundfont license needs to be very permissive, but I don't think\nthere should be any concern about the tool used to create it.\n\nOf course, the sourcecode requirement would probably insist that both\nthe MIDI and the soundfonts are provided as source for the WAV.\n\nHTH, IANAL, TINLA, etc.\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}