{"category": "spam", "to_address": "<reform@meerschwein.hh.schule.de>", "from_address": "\"Jantana Lavrinenko\" <disclaimingmiddleweights@tlauk.co.uk>", "subject": "[Reform] {LET:Profitieren mit Kronos, Info zum Profitieren, Gewinn mit Filmunternehmen erzielen, Investieren mit Zukunft, Sie suchen nach Gewinnchancen?, Informationsvorsprung, Kronos sensationell guenstig, Kurz vom neuen Ausbruch, Massives Umsatzpotenzial, Potent", "body": "Sehr geehrte Damen und Herren\n\nDie Kronos Media AG  (WKN A0LEK1 / ISIN CH 0027905527), mit Sitz in der Schweiz, ist nicht lange auf dem Boersenmarkt, aber gewinnt ziemlich schnell immer mehr Positionen. Das Unternehmen entwickelt sich rapide, man bekommt immer neue Auftraege, in kuerzerer Zeit hat die Gesellschaft einige wichtige Vertraege abgeschlossen, die Verkaeufe wachsen kontinuierlich, das Unternehmen blickt in die Zukunft mit Sicherheit.  Die Werbungsaktion ist auf Hochtouren.  Immer mehr Leute erfahren die letzten Nachrichten ueber die Taetigkeit der Firma , und ueber den Aufstieg ihrer Aktien auf der Boerse.  Man muss hier sagen, dass bloss in drei Tagen der Umsatz ueber 2,5 Mio Aktien betraegt! Das bedeutet, dass die Kronos Media AG  fuer Investition sehr attraktiv ist. Es ist nicht merkwuerdig, dass am Montag, den 18.06. der Preis bei der Eroeffnung 0,16 Euro pro Aktie wird. Es ist nicht ausgeschlossen, dass der Preis auf 0,21 steigt. Bei solchem Bedarf kann der Preis zum naechsten Wochenende 0,50 Euro betragen. \n\nName: Kronos Media AG\n\n    WKN:   A0LEK1\n    ISIN CH 0027905527\n\nFazit: Die Aktie ist trotz des jüngsten Kursanstiegs sehr günstig bewertet.\n\nDisclaimer: Diese Anlageempfehlung wurde vom Versender auf der Grundlage oeffentlich zugaenglichen Informationen erstellt. Die Mitteilungen dienen lediglich der Information und sind keinesfalls als Aufforderung zum Kauf oder Verkauf eines Wertpapiers zu verstehen. Der Versender hat keine Aktien des empfohlenen Unternehmens. Der Versender  erhaelt eine marktuebliche Provision.\n\nFreundliche Gruesse,\nDr. Jantana Lavrinenko   \nGesellschaft f. Aktien-Analyse\n\n\n\n_______________________________________________\nReform mailing list\nReform@meerschwein.hh.schule.de\nhttp://gsw.dyndns.org/cgi-bin/mailman/listinfo/reform\n\n"}