{"category": "ham", "to_address": "beginners@perl.org", "from_address": "Peter Scott <Peter@PSDT.com>", "subject": "Re: Usenet messages are appearing on beginners@perl.org", "body": "On Tue, 05 Jun 2007 18:03:09 -0500, Mumia W. wrote:\n> A horrible thing has happened recently.\n> \n> Messages from usenet seem to be appearing here.\n> \n> I remember that messages posted to the list were reflected to the \n> newsgroup perl.beginners, but newsgroup posts to perl.beginners didn't \n> seem to show up here. Now they do :_(\n> \n> I hope this is just a configuration mistake--not a change in policy. We \n> definitely don't need usenet participants participating here. We have a \n> pretty nice list. People are good to one another. Some of the junk that \n> goes on on usenet doesn't need to happen here.\n> \n> People who want usenet should subscribe to usenet newsgroups. I \n> shouldn't have to see usenet happen on a mailing list I like. Whoever is \n> in charge, I implore you to change the configuration of the maillist so \n> that these usenet message don't come here any more.\n\nWould you be more specific about how you have observed this and what you\nmean by Usenet?\n\nI have been using a newsreader to read and post to this group ever since\nit was created, because like all the mailing lists hosted on perl.org, it\nis bidirectionally gatewayed with the NNTP server at news.perl.org.  But\nthat server does not, AFAICT, exchange articles with the global network\nknown as Usenet.  I just added news.perl.org to my pan server list.\n\nA few years ago, Google started picking up the perl.org mailing\nlists/newsgroups in Google Groups under the perl.* hierarchy.  I imagine\nat that time it became possible to post to them from Google Groups as\nwell, although I've never tried and have no evidence of it.\n\nI don't see anything 'recent' there.\n\n-- \nPeter Scott\nhttp://www.perlmedic.com/\nhttp://www.perldebugged.com/\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}