{"category": "ham", "to_address": "samba-cvs@samba.org", "from_address": "abartlet@samba.org", "subject": "svn commit: samba r23261 - in branches/SAMBA_4_0: .", "body": "Author: abartlet\nDate: 2007-05-31 05:05:45 +0000 (Thu, 31 May 2007)\nNew Revision: 23261\n\nWebSVN: http://websvn.samba.org/cgi-bin/viewcvs.cgi?view=rev&root=samba&rev=23261\n\nLog:\nMerge WHATSNEW back into the main branch.  Comments/omissions greatly\nappriciated.\n\nAndrew Bartlett\n\nModified:\n   branches/SAMBA_4_0/WHATSNEW.txt\n\n\nChangeset:\nModified: branches/SAMBA_4_0/WHATSNEW.txt\n===================================================================\n--- branches/SAMBA_4_0/WHATSNEW.txt\t2007-05-31 05:05:07 UTC (rev 23260)\n+++ branches/SAMBA_4_0/WHATSNEW.txt\t2007-05-31 05:05:45 UTC (rev 23261)\n@@ -1,70 +1,50 @@\n-'Samba4 TP4' presents you with an opportunity to see a Technology\n-Preview (TP) snapshot of Samba4's development, as at January 2007.\n+'Samba4 TP5' presents you with a snapshot into Samba4's ongoing\n+development, as we move towards our first alpha releases.  This Technology\n+Preview (TP) is snapshot of Samba4's development, as at June 2007.\n \n-In the last few months since TP3 was released in October 2006,\n-significant work has been done across many parts of Samba4.  Since that\n-time, we have added the basis for some new and exciting features:\n+In the time since TP4 was released in January 2007, Samba has\n+continued to evolve, but you may particularly notice these areas:\n \n-  PKINIT support to Samba4's KDC will allow, smart-card login to a\n-  Samba4 domain.  TP4 demonstrates this with static key files, but\n-  work will continue to enable actual hardware cards.\n+  Work has continued on SWAT, the the libnet API behind it.  These we\n+  hope will grow into a full web-based management solution for both\n+  local and remote Samba and windows servers.\n \n-  Clustering support was always a design goal of Samba4, and with TP4\n-  we have the ctdb framework, a cluster-aware shared database.  This\n-  allows Samba4 to share a shared cluster file-system with it's clients. \n-  Presented at this year's linux.conf.au, including a highly rigged\n-  demo, you can expect to see this mature over the next few months.\n+  The DRAUAPI research effort has largely concluded, and an initial\n+  implementation of AD replication is present, included in torture\n+  test-cases.  This includes the decryption of the AD passwords, which\n+  were specially and separately encrypted.  This should be recognised\n+  as vital milestone.\n \n-  Non-blocking and Asynchronous IO support, has always been a design\n-  goal in Samba4, and TP4 will use new Linux Kernel features to\n-  implement event driven asynchronous IO.  This makes Samba more\n-  efficient on systems where some data may be 'further away' than a\n-  local disk, such as HSM systems.  This allows the Kernel to handle\n-  reading the returned data from the disk, only notifying Samba when\n-  the data is ready for dispatch to the client. \n+  Likewise, the LDAP Backend project has moved from a research\n+  implementation into something that can be easily deployed outside\n+  the test infrastructure.  \n \n-  Our web-management console, known as SWAT, is being revamped, and in\n-  TP4 you can find a new Web 2.0 style user interface, being used to\n-  support a web-based ldb browser.  We hope this new system will allow\n-  things simple not possible with the form-submit style of web\n-  management.\n+  Testing has been an area of great work, with renewed vigour to\n+  increase our test coverage over the past few months.  In doing so,\n+  we now demonstrate PKINIT and many other aspects of kerberos, as\n+  well as command-line authentication handling in our testsuite.\n \n-  Using LDB LDAP back-end integration has improved in this release, with an\n-  improved mapping module allowing the start of Fedora DS back-end\n-  support.  \n+  The testsuite infrastructure has been rewritten in perl and\n+  extended, to setup multiple environments: allowing testing of the\n+  domain member, as well as the domain controller, roles.  Samba4's\n+  initial implementation of winbind has been revived, to fill in these\n+  tests.\n \n-In continuing our research effort, TP4 includes the work to better\n-understand and implement the DRSUAPI replication protocols.  By better\n-understanding the needs of replication now, we can structure our\n-databases so that their format will have to change less in future.\n+  In clustering, work on CTDB (an implementation of a clustered Samba)\n+  has moved ahead very well, but the current code has not\n+  been merged into Samba4 in time for this release.\n \n-We hope to use this replication function to replace the SamSync based\n-Vampire process so effectively demonstrated since TP1, and to\n-eventually join an Active Directory domain, as a replicating partner.\n+  To support better management, we have investigated group policy\n+  support, and include the infrastructure required.  Unfortunately\n+  without MMC write support, you will need to place the polices into\n+  the directory by hand.  \n \n-Behind the scenes, much of the core infrastructure of Samba4 continues\n-development:\n+As we move forward, we have many of the features we feel are required\n+for a Samba4 Alpha.  Similarly, we know enough about the data\n+formats (particularly those that are encrypted) to be confident that\n+we won't need to change the LDB format.  Our plan is to publish a\n+Samba4 alpha in the next few months. \n \n-  In Kerberos, we have continued to track the development of the\n-  Heimdal Kerberos implementation, and reduce the custom diff between\n-  our branch and upstream.  Heimdal now provides plug-in APIs for\n-  almost all of the hooks we need, including management and validation\n-  of the PAC.\n-\n-  In testing, our test infrastructure has undergone a quiet\n-  revolution, as we improve our unit test framework.  Likewise, the\n-  tests themselves have continued to expand, as we follow our\n-  test-driven development pattern.\n-\n-  In providing an abstraction above our raw RPC layer, the libnet\n-  library continues to expand, becoming a C and JS management API for\n-  Samba4 and remote servers.\n-\n-  To ensure that, as an administrator and developer, you can easily\n-  read and edit our internal databases, our LDB layer has been\n-  optimised for speed.  The aim here is to avoid needing to use the faster, but\n-  more opaque, TDB layer.  \n-\n These are just some of the highlights of the work done in the past few\n months.  More details can be found in our SVN history.\n \n\n"}