{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community]\n\t=?iso-8859-1?q?Strayform_-_where_artists_and_fansc?=\n\t=?iso-8859-1?q?onnect=09tofund_and_distribute_new_creative_works?=", "body": "On Wednesday 13 June 2007 12:14 pm, Terry Hancock wrote:\n> Kevin Phillips (home) wrote:\n> > This is getting a little OT, but I wonder if anyone else onlist feels it\n> > may make an interesting CC promo project if we (as a group) teamed up\n> > with a distro like UbuntuStudio or Dynebolic (both of which offer a good\n> > range of apps) to start some sort of community open-audio project, \"open\"\n> > from the \"tools up\" ??\n>\n> A friend of mine is involved in a similar project called \"64 Studio\"\n>\n> http://64studio.com/\n>\n> whose focus is precisely a \"tools up\" free software artistic platform.\n> So I think this is already being worked on.\n\nNo, no. If I remember rightly where this came from...\n\nThe deal is this:\n\nProviding music in a different \"package\" so to speak.\n\nInstead of a CD with multiple songs, or singles, provide a bootable DVD (CD if \nthere is enough room) with a multitrack ardour project file, ardour and other \nneeded tools and the underlying OS. Plop the cd in, boot from it, up comes \nardour with the song loaded, with jamin and effects and the rest all hooked \nup and routed in qjackctl and playing automatically.\n\nAt this point, the user has a load of freedom. Stop playback, record a new \nlead vocal and mut the original lead and play the piece with his own vocal.\n\nBacking vocal, guitar solo, whatever.\n\nOr just do a different mixdown with the same original tracks.\n\nOr...\n>\n> Unless what you meant was providing a body of artistic elements --\n> samples and music, for example -- in which case, I would suggest that a\n> more \"open\" solution would be to create a package of such work and offer\n> it to ALL of the free media-focused distributions.\n\nWell, I would want to get a body of Free work created for this purpose. And \nbeing Free, all distributions would be able to do whatever with them.\n\nIs that explained in a partially understandable fashion?\n>\n> Of course, if you're looking for money to support the project, you could\n> try proposing your idea to a commercial distribution. I believe that 64\n> Studio does plan to  go to a commercial support business model at some\n> point (I don't think they have money now) and of course, Canonical still\n> has capital. I don't see that being anywhere near as easy, but it might\n> work.\n\nWell, if we are talking the same thing, I had no thoughts of backing. \nNaturally, non-disruptive backing would be a good thing.\n>\n> Cheers,\n> Terry\n\nall the best,\n\ndrew\n-- \n(da idea man)\nWorking on a Movie Script or two in June 2007\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}