{"category": "spam", "to_address": null, "from_address": "\"Hangzhou Metals Co., Ltd.\" <online603646@telkomsa.net>", "subject": "COLLECTION AGENT WANTED", "body": "\n\n\nHangzhou Metals Co., Ltd.\n67 Elin South Road,\nHuizhou City 516001,\nGuangdong, China.\n\nDear Sir/Madam\n\n                           COLLECTION AGENT WANTED\n\nHangzhou Metals Co., Ltd. is based in China. We  produce and\nexports steel  and other products for world trade. Our company\nremains one of the most successful in the distribution of steel,\nrecently our profit has increased so much, that we decided to\nexpand globally.\n\nThe reason we seek your urgent asisstance is that most of our\ncustomers make  payment in  cheques and  American and\nEurope  cheque takes a longer time to clear here in China thereby\nholding business down for us and our business associates.It is\nupon this note that we seek your assistance to stand in as our\nrepresentative in your country. Note that Details of your account is\nnot needed in this is transaction, Also, as our representative,your\nremuneration (Benefit) is on a percentage basis of 15% of the total\namount you receive from our customers at any time on our behalf.\n\nPlease note that your areas of specialization or occupation is of no\nrelevant to resolve in assisting us and there is no financial\nobligation at your end.All we need from you is total honesty and\nyour committiment to work with us.There are no assles as this is\na work at home opportunity.Should you have a present job,you can\nstill be part of our business as your service to us would not interfer\nwith your working hours at all.\n\nIf you are interested in this transaction please forward to us the\nfollowing information:\n\n1) Your Full names:\n2) Contact address:\n3) Home/office phone number:\n4) Occupation\n5) Age:\n6) Sex:\n\nNote:You are to forward the above information to my private email\naddress:wongchiee@yahoo.com.cn\n\nYours Sincerely\nMr.Wong Chi lee\nChairman & CEO\nHangzhou Metals Co., Ltd\n\n"}