{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Brittany Harrison <valdez@goldplatedpussy.com>", "subject": "Tired of sexual troubles?", "body": "\n\nCan't satisfy your girlfriend? Do you want to?\nEverything for your sexual health\nThere is no need to parade your problems. There is no need to visit your local drug store. Cheapest Viagra and Cialis you can find! \nGo to the site\nYour dick will yell!\nWith best regards,\nBrittany Harrison\n \n \nTy spiatil, ubezhdenno zaiavil korotyshka. U kazhdogo opytnogo mobrista Emocii vsegda nahodiatsia pod zheleznym kontrolem; chtoby postroit sovershennyj Obraz Kliucha, razum dolzhen byt holoden kak led. Eto zh byli Ego liubimye kosachi, s kotorymi mechnik, po sluham, ne rasstavalsia uzhe let Desiat piatnadcat, mechi, izgotovlennye v luchshih masterskih goroda Gabalassy, Ne zria prozvannogo glavnym gorodom oruzhejnikov Vnutrennego Kruga, i stoivshie Izriadnyh deneg. Horoshenkoe zamykanie, probormotal ia, ustavivshis na neestestvenno Zastyvshie tela. \nA sejchas idi, budi voevodu. Kazhetsia, inop tozhe koe-chto Umeet? Eto stanovitsia interesnym. Pohvalnaia nastojchivost, Niksard, no sovershenno izlishniaia, vdrug Progovoril nadmennyj golos u menia za spinoj. Posle udara Bigmana Ia uzhe i ne rasschityval, chto ostanus muzhikom v polnom smysle etogo slova. Nemnogo Strannyj, neprivychnyj, lishennyj obychnyh miagkih obertonov i muzykalnosti, On, kazalos, shel otovsiudu srazu: Ty gotov k razgovoru, El? Ia by vzdohnul, esli by mog. U menia net zhelaniia sporit, poetomu prosto vyslushaj. V storonu tel mertvyh pardov on pozvolil lish sebe mimoletnyj vzgliad, a Sgorevshih zazhivo pancirnikov vraga ne udostoil i togo. Ee krik Vse eshche stoit v ushah. \nIa otpravilsia k vyhodu. Shpory vnov vonzilis v razodrannye do krovi boka drakha, vyrvav u togo iz Glotki uzhe ne rychanie, a skoree pronzitelnyj ston, no tem ne menee skorost Udalos uvelichit eshche nemnogo. Prosto dlia nego eshche ne prishlo vremia. I ia boialsia, chto bolshe ne smogu najti Nori. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}