{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 24 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day:\n\n\n\"I will not do full frontal. I need somewhere to go as an actress\" - Lindsay Lohan.\n\n\nIndeed. In tonight's programme:\n\n\nHow Green is Blair?\n\n\nWe've an exclusive interview with the Prime Minister on the environment. Our environment analyst, Roger Harrabin will be asking the Prime Minister about his record on climate change and the political controversy over the Government's new strategy for getting rid of waste.\n\n\nHousing\n\n\nZombie Brown swept into Number 11 Downing Street ten years ago promising to bring stability to the housing market. In his 1997 budget speech Mr Brown said, \"I will not allow house prices to get out of control\". Ten years on and they have spiralled leaving tens of thousands of people unable to get onto the first rung of the property ladder. \n\n\nSo - do we need a housing crash? Is some kind of soft landing possible? How many more new houses do we need - and where will they be built?\n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nCannes\n\n\nThere have been few Union Jacks flying over the Croisette: in fact the 60th Cannes film festival has been a pretty British film-free zone, apart from two notable exceptions. \n\n\nBoth of them focus on British rock icons - one a biopic, about the lead singer of Joy Division, Ian Curtis, who committed suicide in 1980, and the other, a documentary on the lead singer of the Clash, Joe Strummer, who died aged 50 in 2002. Razia Iqbal reports for Newsnight from  Cannes. \n\n\nAnd finally...\n\n\nStop him before he kills again. Yesterday's abysmal joke by a Newsnight staff member going under the name \"Peter C\" has been followed by one just as execrable, and (I would guess) about 20 years old:\n\n\nWhat's the first sign of madness?\n\n\nSuggs walking up your drive.\n\n\nNewsnight is at 10.30 on BBC2\n\n\nGavin\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nUN FAILS TO STOP CONGO'S VIOLENCE\n\n\t\t\t\t\t\t\tFergal Keane speaks to a Tutsi warlord, whose men stand accused of murder and rape as the UN struggles to keep peace in the Congo.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}