{"category": "spam", "to_address": "<IPLACEREPORTS@flax9.UWATERLOO.CA>", "from_address": "\"JohnLansing@InvestorPlace.com\" <JohnLansing@InvestorPlace.com>", "subject": "Protect Yourself & Profit in the Coming Crash", "body": "\n\nProtect Yourself & Profit in the Coming Crash\n\n \n\n\n\n===========================================\nWe love giving our InvestorPlace.com members benefits\n    like access to this timely message. \nIn order to ensure you keep receiving special alerts\n      and offers like this one, please take a moment to click\n      the link in this message to reconfirm that this is the email address where you want to receive emails from InvestorPlace.com.\n      ===========================================\n\n\n\n\n\n\n\n\nJune 13, 2007\nFellow Investor,\nWhile Wall Street was partying like it was 1999 all over again…\n…I was warning my Trending123 subscribers – and anyone else who would listen – about the “coming crash.”  I closed all our long-side trades – took our substantial profits – and warned everyone to hunker down until the storm clouds cleared.\nNow – with the Dow DOWN more than 400 points at times last week, and continued volatility, I’m getting a lot of “thank-yous” thrown my way.\nBut I’m not resting on my laurels.  The worst isn’t over – not by a long shot.  That’s why I have an urgent video presentation for you to watch now.\nAs you’ll see, all the market charts – from the NASDAQ’s “QQQQ” to the S&P 500, and so on – point to an impending calamity for most investors.  The Dow could drop as much as 2,000 points from its highs before it’s all over.\nStand in the way and you will be crushed.\nWhy should you listen to what I say?   First of all, it’ll only take a few minutes of your time, but could save you many thousands of dollars.\nYou’ll learn how to protect your portfolio — even how to profit through the plunge, as other investors lose their shirts.\nWhat’s more, I have a history with events like this.   I started my Trending123 trading service back in 1999 precisely to warn people about the impending NASDAQ meltdown.\nAnd if it’s profits you’re looking for, consider this: At Trending123, we have closed 67 short-term trades so far this year, and 78% of them have been winning trades.   On an annualized basis, we’re averaged 114% gains on each one of those trades!\nSo please, take just a few minutes now to hear me out.   You owe it to yourself to at least consider what I’m saying.\nClick here to watch now.\nSincerely,\n\nJohn LansingTrending123\n\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.\n        Please tell us if your email has changed by visiting here:\nhttp://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice  from InvestorPlace advisors, you can let us know by visiting\nhttp://www.investorplace.com/u/?p=8FP187-1&e=IPLACEREPORTS@SPEEDY.UWATERLOO.CA\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,\n        2420A Gehman Lane\n        Lancaster, PA 17602\nCopyright (c) 2007 ACP Phillips Investment Resources, LLC.\n        All rights reserved.\n06/13/2007 5:52PM\n\nThank you for subscribing to InvestorPlace.com. Please note  that we cannot be liable for any missed bulletins caused by  overzealous spam filters. To ensure that you continue to receive this  valuable part of your service please take a moment to add (johnlansing@investorplace.com) to your address book. Click here for instructions: \nhttp://www.investorplace.com/whitelist.php?eml=johnlansing@investorplace.com\n\nee==8FP187 \n\n\n\n\n\n\n"}