{"category": "spam", "to_address": "undisclosed-recipients: ;", "from_address": "\"Major B. Harrison\" <officemail@freemail.org>", "subject": "Att:Assistance Needed", "body": "\n\nAtt:Assistance Needed\n\nI am Major B. Harrison , a senior security officer under charles\nTaylor,former Liberian President.Having got great affection and\nabsolute appreciation for your human and personality,I wish to contact you for\nabsolute help to safeguard and bank this sum of $16.1m(Sixteen Million One\nHundred Thousand Dollars)into your account for me,preferably we can split the\nsum into three bank accounts if your account will not accommodate all the\nsum.presently this money is in the security vault in Europe.\n\nSource Of The Funds:\n\nI am a senior security officer in charge of arms and ammunition of\nCharles Taylor troops.I and three officers were assigned to purchase arms and\nammunition in france,on getting to Ghana,we heard a news that U.S.A.  \ngovernment\nhad given an ultimatum for our president,Charles Taylor to leave the country\nfor a political asylum with immediate effect.\nPerhaps,we saw this as a golden opportunities to divert the funds  \n$48.4 for our\npersonal use and for the people of Liberia,then the funds were shared among us\n$16.1m each.\n\nThe arrangement of sharing this money is as a result of helping\nourselves and Liberian people since our president has been sent out by U.S\ngovernment on political asylum in Nigeria. just time back He was arrested by\nthe nigeira Government and handed over to the UN to face war crimes in the\nInternational Court of Justice (ICJ) in the  Hague Netherlands.\n\nWebsite Story\nhttp://news.amnesty.org/index/ENGAFR440092006\nhttp://news.bbc.co.uk/1/hi/world/africa/4858500.stm\nhttp://www.nowpublic.com/tag/Liberia\n\nIn view of this i now decided this is the right time to pull the funds as the\nfuture of my family and Liberians depends on this fund and  i will be very\ngrateful if you can assist me to bank this fund.\nNote:I don't want the leadership of president Charles Taylor to have\nidea of where i am and the fund.When this fund is cleared and banked in your\nnominated account,i will meet with you to establish an investment with your\nassistance.\n\nI am presently on political assylum in London England, and my\npresent status does not allow me to make a trip out of my present jurisdiction\nhence my decision to contact you for help For your reward and expected sevices\n40% will be for you,while 60% will be for my family and the people of Liberia\ninvestment.\n\nFor now, you can contact me through this email address: mharrison500@yahoo.com\nonce we establish good contact i shall then give to you my telephone  \nnumber and\nalso give you information on how to claim the funds. Plesease fill in the\nspaces bellow for better communication.\n\n\nMay happy days & a fair future awaits you as you deserve.\n\nBest Regards\n\nMajor B. Harrison\n\nFull Name:\n\nNationality:\n\nOccupation:\n\nAddress:\n\nAge:\n\nSex:\n\nTel:\n\nFax:\n\n\n\n\n\n\n\n\n\n\n"}