{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Igor Gueths <igueths@lava-net.com>", "subject": "Speakup in mainline was: Gentoo dropping Speakup", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA512\n\nHi all. I have been observing this thread for quite some time, and one question keeps jumping out at me, every time I see another message regarding moving Speakup into userspace. Why is it \nthat instead of discussing ways to get Speakup into mainline, we are contemplating rewriting Speakup as a userspace/hybrid program, thereby introducing entirely new bugs/problems? Imo the only \nthing we are doing by contemplating this possible rewrite, is shifting the focus away from the underlying problem that afaik, has been with us since the Linux-2.4 days. As has probably been \noutlined here various times in the past, having Speakup in the mainline kernel tree has several advantages; first, breakage/building problems would be pretty nonexistent, since \nthe rest of the kernel community would at least have to acknowledge the existence of Speakup in the tree. Also, Kirk's job of constantly rewriting new code/fixing existing code as a result of \nsome change in a later kernel version would probably become significantly easier, since the console/etc code that Speakup relies on for its underlying operation, would have to be written and \nor modified with Speakup in mind, not the other way around. What I am trying to say by all this, is that the advantages to having Speakup in the mainline kernel tree are numerous; however, the \nproblem is and has been getting to that point. \n\nAfaik there is still progress attempting to be made on this front, such as a Git repository being made for Speakup and the driver patches. However, as I understand it, Speakup's code needs \nquite a bit of cleaning up befor it can be considered for inclusion into mainline. Unfortunately, I am not nearly familiar enough with the kernel code to be able to aid in this task; however, \nI believe that if we all work together to achieve this goal, that it in fact can be done. With regard to Gentoo dropping Speakup as of later releases, while it is a setback as far as getting \nSpeakup into as many distros as possible goes, I don't see why it can't be re-included in Gentoo at some later date, once build and possibly other issues are resolved with Speakup patched into \nLinux-2.6.22.\n\nIn summary, imo userspace Speakup is not the only answer, nor is it the correct one. Speakup should remain in the kernel, so as to provide the best screen reading experience possible. However, \nin order to achieve this end, we first need to get Speakup into mainline. This may take quite a bit of time and hacking; however, in time, I think it can be done. Feel free to add any comments \nas necessary, I am curious as to what everyone has to say on this.\n- -- \nIgor\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.7 (GNU/Linux)\n\niQIVAwUBRnmvmae2pgKIdGq4AQrO4BAAgucAkYTewJ76iwtIriNh6gPvZ3dhVWyB\nlKgeryDAjR2W64A+bHiU4eMQifo/5j9TBLYqVqJQYA/CznndMcHPmOnx9vYEt1bz\nmFeMqD6JWOqPnqdY/6GMyqPcFR93jom4555FPzr0Be65XeBHCuUzOphFHb7K+j70\ncgc/jfs0gg7Xa7YX0r3jZaC2tt3XAbXEZX6nylduV0PgrKDu+POs64dEYOh0z0QA\nyumt72iIf8JQDoYLvRu/3zviRC2yTuIM1fkyzyJ5nq6hAOkw/bxM8gkKQT1itWpx\nzzKP9UAkjDeT9Vun+lFz2ylT7I5gIk+Ox4FT1UV3SPUQT4Nh313OWPhxpQoWuImF\n+Kxggj0XvuW8/91xYq8Zj2wiz4joNjRMVHC0XyAwl6x7q+G/0Avu6xdvAwT06wO+\nxFeZ+ujX/UDYdENVSGEUNI47tWGtJNkvgKYlwYi+zcuQ/sxZweSgmDiCOd4ri//A\nezOezo16dV9xekykFzLRR5qHmQDnNGg7NMlGZ5rmKdQoOAJioQyIsa0hdu0q1VDe\nLGJkU12Zai2FzG55Rteq94wgK/XDK/P7xjJdv1IPyoMIrdGe3QCyHLp81rf/CNuK\nQltwWdhZlwGe+K0xUlF7YBtG9zp0ZtRsrTP5YRYZwBZhmLKFrGsa92iWfp77vMXs\n2VoKSJFYXrQ=\n=HhvU\n-----END PGP SIGNATURE-----\n\n-- \nThis message has been scanned for viruses and\ndangerous content by MailScanner, and is\nbelieved to be clean.\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}