{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "240p 6/13 Update: Spacewalk begins", "body": "\n\n\n\n\n240p 6/13 Update: Spacewalk begins\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 50\nPosted: 2:34 PM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-46 (06/12/07): Computer glitches resolved; blanket repair decision deferred\n   SR-47 (06/13/07): Crew awake; prepares for spacewalk, solar panel retraction\n   SR-48 (06/13/07): Solar array retraction work begins\n   SR-49 (06/13/07): Solar array retracted 7.5 bays; EVA on tap; Russian computers down again\n   SR-50 (06/13/07): Spacewalk begins\n\n=================================\n\n2:34 PM, 6/13/07, Update:  Spacewalk begins\n\nAstronauts Pat Forrester and Steve Swanson, floating in the space station's Quest airlock module, switched their spacesuits to internal battery power at 2:28 p.m. to officially kick off a planned six-and-a-half-hour spacewalk.\n\nThis is the 85th spacewalk devoted to station construction and maintenance since assembly began in 1998 and the second of four planned by the Atlantis astronauts. Going into today's EVA, 47 NASA astronauts, 15 Russians, two Canadians and four fliers from Japan, Germany, France and Sweden had logged 515 hours and 20 minutes of spacewalk time building the international outpost.\n\nForrester and Swanson will begin their spacewalk by making their way up to the P6-2B solar array truss to smooth out blanket folds and assist in the panel's retraction. Earlier today, working inside the space station, the astronauts successfully retracted the array 7.5 bays of its 30.5 bays, or about 28 feet, before standing down for the spacewalk.\n\nSeveral grommets on individual blanket slats appeared hung up on guidewires. Using custom non-conducting tools, Forrester and Swanson plan to free any hangups to clear the way for additional retraction attempts.\n\nBut they only plan to spend about 45 minutes or so on the array before turning their attention to completing the activation of a rotary joint needed to turn a newly installed set of solar arrays. Additional time is built into the crew's flight plan Thursday and during another spacewalk Friday to work on the array as required.\n\nHere is a revised timeline for today's spacewalk based on the actual start time (in EDT and event elapsed time):\n\nEDT........HH...MM...EVENT\n\n02:28 PM...00...00...EVA-2: Suits to battery power\n02:38 PM...00...10...EVA-2: Airlock egress\n03:18 PM...00...50...EVA-2: P6-2B retraction assist\n04:03 PM...01...35...EVA-2: Deploy solar alpha rotary joint braces\n04:33 PM...02...05...EVA-2: EV3: Install SARJ drive motor 1\n04:33 PM...02...05...EVA-2: EV4: Remove SARJ locks\n05:33 PM...03...05...EVA-2: EV3: Remove SARJ locks\n08:23 PM...05...55...EVA-2: Cleanup and ingress\n08:58 PM...06...30...EVA-2: Airlock repressurization\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}