{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Addie Cummins\" <powcimabendeq@cimaben.com>", "subject": "Become fit and happy again", "body": "\nWatch the pounds disappear\n\n\n\n\n\n\nAnatrim – The newest and most attracting product for weighty people is now readily available – As could be seen on BBC.\n\n\nDo you remember all the cases when you told yourself you would do any thing for being saved from this desperately growing number of kilos? Happily, now no major sacrifice is required. Thanks to Anatrim, the ground-breaking weight-reducing mixture, you can get naturally health lifestyle and become really thinner. Just look at what our customers write!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily devoured all this trash \n\n\nand could not stop. \n\n\n\n\nThis ruinous passion stopped when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nmood improved and I became the happiest person 21 pounds in 2.7 months. \n\n\n\n\nI can tell you now I became the happiest person in the world!\"\n\n\n\n\n\nLusia R., Las Vegas\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nIt’s pretty hard to imagine how I detested being derided at school. \n\n\n\n\nI hated my plumpness and I detested myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally took me out of this dreadful nightmare! Many thanks and a great respect to you, fellows.\"\n\n\n\n\n\nMikkey Fox, Boston\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – eating more – more depression. My wife was about to leave me as I was turning in overweight psycho. \n\n\nMy friend pointed to your web site and I ordered up Anatrim at the time. \n\n\nThe result was excellent, my appetite became normal, I was in good spirits oftener, and, certainly, I tightened my belt with no regrets. And you see, the bedroom became cool also!\"\n\n\n\n\n\nRikky\n\n\n\n\n There many and many sincere gratitudes left by happy people taking Anatrim. Why don't you add yourself to the tens of thousands of slim customers and take this original appetite suppressing energy raising product now!\n\n\nDon’t decline your chance!\n\n\n\n\n"}