{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter June 4, 2007", "body": "\nhowstuffworks® | science & technology June 4, 2007\nRSS\n  \n How Wildfires Work  So far this year, 36,138 wildfires have burned more than 1.3 million acres. Fires recently\nthreatened the resort town of Avalon on Catalina\nIsland and scorched part of Griffith Park, the largest urban park in the United States.\nFires continue to rage in Florida, Georgia and\nseveral other states. In this article, learn about wildfires, their causes and\nthe sophisticated methods used to fight them.\nAlso at HowStuffWorks\n \n\nHow Maps\nWork - Maps are\na convenient method of illustrating a wide variety of data. They're not simply\nlimited to geography and travel routes -- maps can be used to describe numerous\ndifferent types of physical, political and thematic conditions. In this\narticle, learn how maps use a \"graphic language\" to present information in an\neasily understandable way.\n \n\nHow Crop\nCircles Work - Are crop\ncircles the work of alien visitors? Are they a natural phenomenon, created by\nelectrically charged currents of air? Or are they elaborate hoaxes perpetrated by\nsavvy, talented and very determined artists? Find out the theories behind crop\ncircles, see pictures of some famous designs, and learn how to make a crop\ncircle.\n \n\nHow the\nWorld Wildlife Fund Works - The World\nWildlife Fund works to safeguard nature and its ecological processes, preserve\nendangered species and reduce pollution. Find out how this important\norganization works, the strategies it employs and how you can help.\n   \nThis Week's Video \n\n\nHow\nMagazine Printing Works - Have you\never wondered how millions of magazines are printed every year? Watch this\nvideo from HowStuffWorks to see how modern-day magazine printing works.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved "}