{"category": "ham", "to_address": "\"Kuhn, Max\" <Max.Kuhn@pfizer.com>, Cody_Hamilton@edwards.com,\n   r-help@stat.math.ethz.ch", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] R vs. Splus in Pharma/Devices Industry", "body": "I am happy to say nice things about odfWeave.  Before it was released I\nwas looking at the RTF spec to see if I could write an RTF driver for\nsweave.  But the task was a bit daunting and I doubt that I would have\nhad time for it.  So, I was (and still am) exited when odfWeave came\nout.  It is a big time saver for  me and I have shown it to several\nother people as well.\n\nI have looked at ooconvert, but unfortunately the current version is\nlimited to *nix, and I am currently in a MS windows world.  I tried\ngetting it to run under cygwin at one point, but did not succeed at the\ntime.  Once it is available more generally, I will just set up Makefiles\nso that I can automatically produce either .doc or .pdf documents from\nmy templates and data.\n\nThanks for the great package,\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: Kuhn, Max [mailto:Max.Kuhn@pfizer.com] \n> Sent: Thursday, June 14, 2007 3:11 PM\n> To: Greg Snow; Cody_Hamilton@edwards.com; r-help@stat.math.ethz.ch\n> Subject: RE: [R] R vs. Splus in Pharma/Devices Industry\n> \n> Greg,\n> \n> Thanks for the kind words about odfWeave.\n> \n> > These reports are usually put out as internal webpages for various \n> > people in the organization to look at, so we could either go the \n> > odfWeave approach and generate pdf files (not as automated \n> as I would\n> > like)\n> \n> I agree that automating the conversion should be easier. My \n> wish would be that the OO binary had a flag to convert from \n> one format to another.\n> \n> On Linux, there is a bash script that uses the open office \n> binaries to do the conversion at the command line by Nathan Coulter at\n> \n>    http://sourceforge.net/projects/ooconvert/\n> \n> Also, there is a Java class called jooconvert out there (if memory\n> serves) that has similar functionality.\n> \n> Max\n> \n> \n> \n> ----------------------------------------------------------------------\n> LEGAL NOTICE\n> Unless expressly stated otherwise, this message is \n> confidential and may be privileged.  It is intended for the \n> addressee(s) only.  Access to this E-mail by anyone else is \n> unauthorized.  If you are not an addressee, any disclosure or \n> copying of the contents of this E-mail or any action taken \n> (or not taken) in reliance on it is unauthorized and may be \n> unlawful.  If you are not an addressee, please inform the \n> sender immediately.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}