{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal editorial: Abbott's Bad Precedent", "body": "Abbott's Bad Precedent\nApril 30, 2007; Page A14\n\nNational borders don't mean much to diseases, but they do when it comes\nto drug patents. Most governments respect patents because without them\ndrug companies would have no incentive to develop new therapies. So\nwhat happens when a country seizes patents, heedless of the broader\nconsequences?\n\nWe're about to find out. Earlier this month, Thailand browbeat Abbott\nLaboratories into reducing the price of an HIV/AIDS drug, Kaletra, by\nthreatening to seize its patent. The action goes against every\nprinciple of intellectual property protection under the World Trade\nOrganization.\n\nYou'd think such a frontal attack on property rights would upset the\nWorld Health Organization, whose objective is \"the attainment by all\npeoples of the highest possible level of health.\" But you'd be wrong.\nThe WHO helped broker the Thai deal, bowing to intimidation from\nincreasingly loud \"non-governmental organizations,\" or NGOs.\n\nAbbott had initially responded to Bangkok's threats by withdrawing all\nof its applications to market new products in Thailand. The NGOs\nanswered with their own denunciations of Abbott, with Oxfam calling its\nwithdrawal from Thailand a \"nasty game,\" while Doctors Without Borders\nlabeled it \"a major betrayal to patients.\" (Abbott kept selling the\ndrugs already on the Thai market.)\n\nUnder this political assault, WHO Director General Margaret Chan asked\nAbbott if it could \"improve access and affordability\" to drugs for\nmiddle-income countries. So Abbott did a reversal and said it would\nre-enter the market and sell a newer version of its AIDS drug at a\nlower price. The WHO then quickly praised Abbott for \"significantly\"\nlowering the price. And its representative in Thailand, P.T.\nJayawickramarajah, added that \"what the Thai Ministry of Public Health\nhas done is quite appropriate.\"\n\nThe truth is closer to the opposite, as a matter of law and policy.\nThailand has launched campaigns against three drug companies so far --\nAbbott, for Kaletra; Merck, for Stocrin, another HIV/AIDS drug; and\nSanofi-Aventis's Plavix, a blood thinner for heart patients. Bangkok's\nmilitary government justified its actions under WTO rules that allow\ngovernments to seize drug patents in cases of \"national emergency\" or\nfor \"public non-commercial use.\"\n\nThese vague terms are open to interpretation, but Thailand is\nstretching \"national emergency\" beyond reason. As the American\nEnterprise Institute's Roger Bate points out, less than 1% of the Thai\npopulation suffers from chronic coronary disease and a little over 1%\nfrom HIV/AIDS. The latter is terrible but also far less than in most of\nsub-Saharan Africa.\n\nThe \"public non-commercial use\" justification also doesn't hold up.\nBangkok intends to seize the patents and ship them to the Government\nPharmaceutical Organization, a for-profit state-owned company. The Thai\ncompany, by the way, has never been certified by the WHO as a safe drug\nproducer and has a track record of graft. Yet now the WHO has allowed\nthe company to smash and grab a patent to make money.\n\nThe stakes here are far larger than Thailand's greed and WHO's\npolitical opportunism. Anti-pharmaceutical activists have looked for\nyears for a government pliable enough to test WTO rules on compulsory\nlicensing. They want to set a precedent that erodes property rights,\nwith a goal of selling drugs at cut-rate prices everywhere. In the NGO\nnirvana, governments would share the burden of paying for drug\nresearch, and then create some kind of \"reward\" scheme for companies to\ninnovate. This is socialism as alchemy, as if companies will take\nbillion-dollar risks without an incentive to make a profit.\n\nAs for Abbott, we recognize their business and PR dilemmas. But the\nonly real weapon any drug company has in these patent battles is to\nwithdraw from an offending country's market. By threatening withdrawal\nand then reversing itself under pressure, Abbott has undermined its own\ncredibility and made it harder for other companies to take a stronger\nstand. CEOs are paid to make more consistent business judgments.\n\nAlso culpable is the Bush Administration, which has been dozing through\nthis assault on a major U.S. industry. Trade Representative Susan\nSchwab's office has publicly acknowledged Thailand's ability to use\ncompulsory licenses -- subject to WTO law -- and may put the country on\na \"watchlist\" for IPR protection. But what happens when other countries\ndecide to seize patents? Last week, Brazil declared Merck's Efavirenz\n(another name for Stocrin) a drug of \"public interest\" -- a possible\nfirst step toward a compulsory license.\n\nThe large drug companies have become global whipping boys, but their\ntherapies can't be produced on a government whim. The Abbott precedent\nis a bad one for global property rights, and the biggest losers will be\nthe world's poor and sick.\n\nURL for this article:\nhttp://online.wsj.com/article/SB117788209564486267.html\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}