{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, June 8, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLiver cancer patients get hope from kidney cancer drug\nFor the first time, doctors say they have found a pill that improves survival for people with liver cancer, a notoriously hard to treat disease diagnosed in more than half a million people globally each year.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudy: Omega-3 fatty acids reduce blood pressure\nA diet with liberal servings of fish, nuts and seeds rich in nutrients called omega-3 fatty acids can help lower a person's blood pressure, according to a study released Monday.\nFULL STORY\n\n\n\n\n\n\nStudy: Doctors biased in prostate cancer treatment\nThe type of prostate cancer treatment a man gets has a lot to do with the kind of specialist he sees first, a new study says, backing up what many have long suspected.\nFULL STORY\n\n\n\n\n\n\nScientists: Key advance in stem cell research\nThree teams of scientists say they have produced the equivalent of embryonic stem cells, at least in mice, without taking the controversial step of destroying embryos.\nFULL STORY\n\n\n\n\n\n\nCDC: 2006 West Nile virus deaths highest since '03\nDeaths from the mosquito-borne West Nile virus increased last year to their highest level since 2003, a report from the U.S. Centers for Disease Control and Prevention says.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}