{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "\"Anthony W. Youngman\" <debian@thewolery.demon.co.uk>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": "In message <20070417195908.GA4304@doctormoo.dyndns.org>, Nathanael \nNerode  writes\n>MJ Ray wrote:\n>>There may be a few licences that are buggy about this and to which we\n>>want to grant a limited-time exception, but that is not unusual.  Use\n>>a GR for only that, not a permanent foundation document edit.\n>\n>>> Care to craft another solution? [...]\n>\n>>No, I've no interest\n>You just did craft another solution.  Thanks.\n>\n>Alternate suggested GR text:\n>---------------------------\n>The Debian Project notes that many license texts are copyrighted works, licensed\n>only under meta-licenses which prohibit the creation of derivative license texts.\n>\n>We consider this to be undesirable.  License texts are functional works; reusing\n>legal text from an earlier license makes a new license much easier to read and\n>interpret, while brand new legal text is likely to have unexpected results.\n>This is true even of preambles, which can have an effect on the interpretation of\n>the license.  We encourage all authors of license texts to allow the creation of\n>derivative license texts.\n>\n>Currently several very important licenses for free software are licensed under\n>such restrictive meta-licenses.  These include the LaTeX Project Public License\n>and the GNU GPL version 2.  In addition, most license texts have no explicit\n>meta-licenses, which makes their legal situation unclear; the worst case\n>interpretation is that they have a restrictive meta-license.\n>\n>We have promised that Debian will remain 100% free.  License texts which are\n>under restrictive meta-licenses are not 100% free.  While we could ship them\n>alongside Debian rather than in Debian, we do in fact ship them in Debian as a\n>matter of convenience.\n>\n>We wish to clearly inform our users of this temporary exception to the promise\n>in our Social Contract.  We will do our best to resolve this issue.  Until this\n>problem no longer applies to major licenses, license texts applying to works in\n>Debian may be present in Debian even if they are not DFSG-free.  We believe that\n>this is the best choice to serve our users and the free software community.\n\nCue one unsolvable paradox, based on a total mis-understanding.\n\nThe GPL v2 is NOT licenced under such a restrictive meta-licence that \ncan be a *temporary* exception.\n\nLicence documents MUST be invariant. They are legal documents, with \nlegal force, and you're trying to give the recipient the right to mess \nabout with them!\n\nAnd I believe the copyright licence governing the GPL *DOES* allow you \nto mess about with the text, copy it, etc etc (which you're falsely \nclaiming it doesn't, I believe). What the GPL does NOT grant you is the \nright to use name \"GPL\" or refer to the FSF. Which is fine, because they \nare trademarks or company names, so the copyright licence on the GPL \nbasically says \"do what you like, provided you don't commit the offence \nof 'passing off' \".\n\nBasically, your argument is coming over more and more as \"I want to \nrewrite licences to remove all the inconvenient conditions I don't \nlike\". Which is only going to lay you open to criminal charges for \nfraud, copyright piracy, passing off, or other serious offences like \nthat.\n\nJust look at what you're actually going to achieve. You're going to get \nloads of \"rights\" which are worthless because they're illegal. What's \nthe point?\n\nCheers,\nWol\n-- \nAnthony W. Youngman - anthony@thewolery.demon.co.uk\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}