{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 8, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESFresno State Shooting Suspect In Custody\nPolice have arrested the college student suspected of opening fire at an apartment near Fresno State University, killing one\n                        man and wounding two others in a dispute over a video game console. More...Watch: Fresno Student Kills One\n• Feds Arrest Six In Plot Against Army Base\n                     \t\t\t\t\t| Watch• U.N.: Biofuels Could Devastate Environment• Senate Panel OKs 40% Boost In Fuel EconomyU.S.Flood Fears Rise As Rain Pounds Midwest\nHeavy rain from an already-deadly storm system sent the Missouri River and other Midwest waterways over their banks, forcing\n                        thousands of people to evacuate. Missouri's governor has declared a state of emergency in anticipation of major flooding. More...Watch: Missourians Fear Flooding\n• Fresno State Shooting Suspect In Custody\n                     \t\t\t\t\t| Watch• Search Resumes For Kansas Tornado Victims\n                     \t\t\t\t\t| Watch• Rally Clash Leads To LAPD Shakeup\n                     \t\t\t\t\t| Watch• More StoriesWorldChild Survival Rate In Iraq Plummets\nThe chance that an Iraqi child will live beyond age 5 has plummeted faster than anywhere else in the world since 1990, according\n                        to a report that placed the country last in its child survival rankings. More...\n• Mickey Mouse Rip-Off Spreads Hamas Message• Queen Elizabeth Tours NASA Center\n                     \t\t\t\t\t| Watch• Historic N. Ireland Deal Becomes Reality• More StoriesPoliticsHouse Democrats Pitch New Iraq Plan\nHouse Democratic leaders are unveiling a new proposal that would fund the Iraq war through July, then give Congress the option\n                        of cutting off money if conditions don't get better. The White House dismissed the approach as \"just bad management.\" More...Watch: Rangel: Change Course In Iraq\n• Senate Panel OKs 40% Boost In Fuel Economy• Cheney Set To Depart On Mideast Mission\n                     \t\t\t\t\t| Watch• An Exit Strategy For Wolfowitz?\n                     \t\t\t\t\t| Watch• More StoriesHealthFarmed Fish Fed Tainted Meal\nU.S. health officials say farmed fish were fed meal spiked with an industrial chemical linked to the ongoing recall of pet\n                        food. But they add that the contamination level was probably too low to pose a danger to anyone who ate the fish. More...\n• Study: Past Pill Use Won't Lower Fertility• Rating The Best Diets\n                     \t\t\t\t\t| Watch• TV Hurts Kids Of All Ages, Studies Say\n                     \t\t\t\t\t| Watch• More StoriesSciTechSenate Panel OKs 40% Boost In Fuel Economy\nA Senate committee has approved a plan to increase fuel efficiency standards to an average of 35 miles per gallon by 2020.\n                        The full Senate is expected to consider the bill next month. More...\n• U.N.: Biofuels Could Devastate Environment• Archaeologist Finds King Herod's Tomb• Astronomers Spot Biggest Supernova Ever• More StoriesBusinessWarner Music's Losses Widen\nWarner Music Group reported a wider fiscal second-quarter loss, the result of a decline in revenue and costs related to a\n                        restructuring plan that includes the elimination of 400 jobs. More...\n• Auto Loan Rates Higher For Blacks• Gas Prices Keep Climbing\n                     \t\t\t\t\t| Watch• Panel: Wolfowitz Broke World Bank Rules• More StoriesEntertainment\"Free Paris Hilton!\" Petition Begs\nA friend of Paris Hilton has created an online petition that asks California Gov. Arnold Schwarzenegger to pardon the heiress\n                        from jail because \"she didn't hurt or kill anyone, and she has learned her lesson.\" More...Watch: Paris' Jail Term: Not 'Simple'\n• Tom Sizemore In Trouble Again• George Michael Pleads Guilty• Swanson Takes On Anna Nicole On \"L&O\"• More StoriesOpinionWhy '08 Will Belong To The Democrats\nShould Republicans really abandon all hope in their own party and back Hillary Clinton? Given the mediocre crop of GOP candidates\n                        and disunity within the party, Bruce Bartlett of the National Review Online says yes. More...Watch: Republicans Debate\n• Buying Into The Macho Myth\n                     \t\t\t\t\t| Watch• Sarkozy Won't Be Bush's French Poodle\n                     \t\t\t\t\t| Watch• Turning Over A Nouveau Leaf\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Rating The Best Diets\nConsumer Reports surveyed diet plans to find out which was the most effective and easiest to follow. The magazine also talked\n                        to people who have lost a lot of weight, to learn about their strategies. More...Watch: Which Diets Really Work?\n• EARLY SHOW: TV Hurts Kids Of All Ages, Studies Say\n                     \t\t\t\t\t| Watch• EARLY SHOW: Fabulous Mother's Day Gift Ideas\n                     \t\t\t\t\t| Watch• EARLY SHOW: Best Drugstore Beauty Products\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nQueen's U.S. Trip Winds DownQueen Elizabeth has one last day of appearances, including the World War II Memorial and the Children's National Medical Center,\n                                    before heading home. Susan Roberts reports.\nTOP VIDEOS\nFeds Break Up Army Base Plot \nTaiwan Lawmakers Brawl\nFresno Student Kills One\nFeds Nab Suspected Terrorists\nFuture Uncertain After Tornado\nThe Queen Visits NASA\nPaper Publishes After Tornado\nStorm Chaser On Tornado Images\nDennis Haysbert On 'The Unit'\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}