{"category": "spam", "to_address": "warwick@plg.uwaterloo.ca", "from_address": "\"Ted Kramer\" <tugdevogelfaw@devogel.be>", "subject": "Summer is almost here, be ready", "body": "\nLook in the mirror and enjoy the new you\n\n\n\n\n\n\nAnatrim – The latest and most exciting lose flesh product is now easily available – As you could see on CNN.\n\n\nCan you hold in your memory all the times when you told yourself you would do any thing for being saved from this desperately growing pounds of fat? Happily, now no big sacrifice is necessary. Thanks to Anatrim, the earth-shaking weight-reducing mixture, you can achieve healthier life style and a really slender figure. Have a look at what people state!\n\n\n\n\"I hate to admit it but I was terribly addicted to food. \n\n\nI greedily ate all this rubbish \n\n\nand could not stop. \n\n\n\n\nThis torment finished after I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly abated, \n\n\nspirits improved and I turned to the happiest person 21 pounds in 2.7 months. \n\n\n\n\nI can tell you now I turned to the happiest person!\"\n\n\n\n\n\nRita R., San Diego\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to imagine how I hated being derided at school. \n\n\n\n\nI hated my plumpness and I detested myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally took me out of this nightmare! Many and many thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, New York\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into the circle, depression – more eating – even more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nOne my best friend pointed at your site and I ordered my pack of Anatrim immediately. \n\n\nThe result was excellent, my appetite became normal, I was in good spirits oftener, and, certainly, I became able to tighten my belt on some holes. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nMike\n\n\n\n\n There are lots of testimonial letters delighted people leave after trying Anatrim. Why don't you join the tens of thousands of slim men and women and try this all-natural appetite-suppressing power boosting product now!\n\n\nDo not decline your chance!\n\n\n\n\n"}