{"category": "ham", "to_address": "James Peach <jpeach@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: [Samba] Support for multiple file streams?", "body": "On Mon, 2007-07-02 at 10:27 -0700, James Peach wrote:\n> On Jul 2, 2007, at 9:53 AM, Jeremy Allison wrote:\n> \n> > On Mon, Jul 02, 2007 at 04:50:54PM +0000, simo wrote:\n> >\n> >> I was thinking if it couldn't be better to use just one directory  \n> >> in the\n> >> root of the filesystem and within it create a directory for each file\n> >> where we want to write an alternate stream. The idea would be to  \n> >> use the\n> >> files inode as the dir name 0x123456 and inside it the stream name as\n> >> file name for the stream. This way renaming or moving the file  \n> >> wouldn't\n> >> loose the streams. Does it make sense?\n> \n> Ted T'so presented a very similar streams implementation at  \n> linux.conf.au in 2006:\n> \thttp://www.linux.org.au/conf/2006/abstract1f24.html?id=384\n> \n> > That's a pretty good idea - we'd have to do some recursing up the\n> > tree to find the filesystem root of each share - maybe we could\n> > do this at share connection time....\n> \n> A variation on this would be to store the streams metadata in a Samba- \n> private EA. This would give you something analogous to the streaminfo  \n> data link back to the hidden streams data files. You would be able to  \n> quickly determine the stream status for a file and you'd have a lot of  \n> flexibility in evolving the implementation. You'd also be able to  \n> reconstruct the EA metadata from the hidden streams data (slowly), and  \n> verify the hidden streams data from the EA (quickly). If you  \n> standardised the EA format, you would be able to add non-Samba tools  \n> to manipulate streams.\n\nUsing the EA to store a file path to the /.streams dir would be very\ngood, that would avoid the unix side delete/create problem as we have a\nway to validate it is the right stream.\nSounds a nice mix :-)\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}