{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "George Patel <hood@getfitfoods.com>", "subject": "Say \"NO\" to erectile dysfunction!", "body": "\n\nThere is no need to let everybody know that you have health problems. \nClick here to become a sex giant\nUse licensed Viagra and Cialis pills from our drug store. Now you are the best, you have perfect sex in your life! That is Online Drug store with quality ED medications!\nEverything for your health\nSecure, confidential purchase!\nWith best regards,\nGeorge Patel\n \n \nIa tvoj opekun Na segodniashnij den. Horoshaia ideia, vdrug uhmylnulsia Nkot. Itak, chto my imeem? Kto-to nanial ohtana po moiu dushu? Togda pochemu tot Nichego ne popytalsia sdelat? Mozhet byt, ia videl prosto nabliudatelia, prichem Obnaruzhil togo neozhidanno dlia nego samogo, tak chto emu prishlos retirovatsia Nesolono hlebavshi? Ia podumal, chto, vozmozhno, mne eshche pridetsia stolknutsia s nim S Neureje. Gront prishel v sebia polnostiu. \nTak chto shire shag, Niks! Toroplivo topaia za borodachom, ia podumal, chto bolno gladko uzh vse Poluchaetsia. I Ostanovilsia, prisvistnuv ot udivleniia. Nikogda ranee Drahub ne znal Porazhenij i poetomu perestal byt ostorozhnym. Proshlo vsego neskolko sekund, i chelovek bezzvuchno ruhnul v zarosli Daleko pozadi nas, treska padeniia iz-za gula dvigatelia ia ne uslyshal. Medlenno, ochen Medlenno, skvoz skovyvaiushchij myshcy mysleobraz, ia usmehnulsia emu v lico. Potomu Chto eshche nichego ne konchilos. Neskolko Tiaguchih sekund stol raznye po obliku i po sposobnostiam dvoe chuzhih Neotryvno, napriazhenno smotreli v glaza drug drugu, skreshchivaia vzgliady, slovno Klinki: vysochennyj, pod dva s lishnim metra groznyj krylatyj leshuk, srazit Kotorogo okazalos ne pod silu dazhe shefiru, poveliteliu shelty, so vsemi ego Podruchnymi, v chisle kotoryh byli i sheptuny-dorriksy, sposobnye razorvat Soznanie prostogo smertnogo v klochia, i puhloshchekij, ne vyshe moego poiasa, Koro!\ntyshka-trans, bezobidnyj tolko na pervyj vzgliad, umeiushchij govorit na Ravnyh so staruhoj-smertiu. K gorlu podstupila toshnota, pered glazami vse poplylo, i on Pospeshil opustitsia na kortochki, vzhavshis spinoj v stenu i pytaias s soboj Spravitsia. \nI ochen uzh uzkoj byla eta rasselina Shirinoj vsego v paru shagov, ona vesma nepriiatno smahivala na gigantskie Kamennye ladoni, postavlennye na rebro i gotovye v liubuiu sekundu ozhit i Somknutsia. Eto byl svoego roda stil, ot kotorogo ona ne otstupala ni na shag. V etot moment ia zametil, chto telo starika melko zadrozhalo, a ot ego Golovy i plech vverh potianulis serye strujki. Zlost ot porazheniia raspirala ego iznutri, trebovala vyhoda. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}