{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "drew Roberts <zotz@100jamz.com>", "subject": "Re: [cc-community] Strayform - where artists and fans connect to\n\tfund and distribute new creative works", "body": "On Saturday 02 June 2007 12:17 pm, Christopher Budnick wrote:\n> On 6/1/07, dream dream  wrote:\n> > What we would like to see is a new way that media is\n> > created and funded.  It is designed to replace the\n> > purchasing of CDs.  Buying CDs is inefficent.  With\n> > current peer-to-peer technology their is no cost for\n> > distribution.  The real value is in the process of\n> > creation.\n>\n> I partially agree with this, but I think it's also important to\n> consider that the CD as an object, an artistic package, is a cultural\n> artifact itself and of some value to a lot of us still.\n\nI agree, personally, as I think I have said on this list recently, I would \nlike to see CDs start comming in the format that LPs came in in my younger \ndays.\n\nSay the complete \"Goodby Yellow Brick Road\" package, full LP size, just with \nCDs in place (or even as well as) LPs in the purchase.\n>\n> > So pay artists for creation.  Funding the creation process\n> > has many benefits.  It is more efficent, resulting in\n> > higher profits for artists and lower costs for consumers,\n> > it removes the threat of piracy as a revenue drain on\n> > artists, it allows fans to take part in the creation\n> > process.\n>\n> I am not sure I follow this last bit, but I often see the conflation\n> theft, piracy, and filesharing, even when well-intentioned. Right now\n> I do not think there is much of a threat of music piracy as a revenue\n> drain, as it stands, piracy unimpeded has had many positive effects\n> and, to some extent, has inserted fans into the creation process in a\n> way they haven't previously been, for better or for worse.\n\nI agree with the conflation problem. Also there is the terminology problem. It \nis not theft or piracy, it is copyright violations if anything. Loaded words \nand all. File sharing happens to involve copyright violations at times but \ncan, and often does, happen without copyright violations.\n\nI think the point that was being made is that if we paid up front for \nproduction of music, and allowed free copying (and I would add, make the \nmusic Free) then that copying would not deprive the artists of income. They \nwould have already been paid for making the music before the copying started.\n>\n> best\n> c\n\nall the best,\n\ndrew\n\n-- \n(da idea man)\nWorking on a Movie Script or two in June 2007\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}