{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Madge Winters\" <mawchemfilscientificsfig@chemfilscientifics.info>", "subject": "Control your weight and appetite", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting lose flesh product available – As seen on BBC.\n\n\nCan you hold in your memory all the cases when you told yourself you would do anything for being delivered from this desperately growing pounds of fat? Happily, now no great offering is expected. Thanks to Anatrim, the ground-breaking pound-melting blend, you can get naturally health mode of life and become really thinner. Take a look at what our customers say!\n\n\n\n\"It’s quite difficult to acknowledge it but I was a junk food addict. \n\n\nI devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis suffering left off when I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nspirits improved and I became the happiest person in the world 23 pounds in 2.8 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nLusia R., Colorado\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't imagine how I detested being derided at school. \n\n\n\n\nI hated my weight and I abhorred even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this dreadful nightmare! A plenty of thanks to you, fellows.\"\n\n\n\n\n\nMike Brown, Las Vegas\n\n\n\n\n\n\"Know what? Anatrim kept my marriage intact! I fell down into this circle, depression – more eating – even more depression. My wife had thought to leave me as I was turning in overweight psycho. \n\n\nOnce my friend pointed to your web site and I ordered pack of Anatrim right away. \n\n\nThe results were magnficent, my appetite came to normal level, I was in a good mood oftener, and, be sure, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nFrank\n\n\n\n\n There many and many gratitudes left by delighted people taking Anatrim. Don’t you gonna add yourself to the thousands and thousands of slender customers and take this all-natural appetite-suppressing energy increasing product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}