{"category": "ham", "to_address": "myl@cis.upenn.edu, r-help@stat.math.ethz.ch", "from_address": "\"Liaw, Andy\" <andy_liaw@merck.com>", "subject": "Re: [R] R in cron job: X problems", "body": "This is in the FAQ, if I remember correctly...  However, alternatively:\n\nAs Jeff Horner recently pointed out on the list, the Cairo package is a\ngood way of generating png without needing an X display.  You may want\nto look into that.  I've just installed cairo on our CentOS boxes and\nthe Cairo package from CRAN.\n\nAndy \n\nFrom: Mark Liberman\n> \n> I'd like to use an R CMD BATCH script as part of a chron job \n> that is set up to run every hour.\n> \n> The trouble is that the script creates a graphical output in \n> a file via png(), and apparently this in turn works through X.\n> \n> When cron invokes the job, no X server is available -- I \n> suppose that the DISPLAY variable is not set -- and so R \n> exits with an error message in the output file. (If I run the \n> same script in an environment where an X server is properly \n> available, it works as I want it to.)\n> \n> I tried setting DISPLAY to thecomputername:0.0 (where \n> \"thecomputername\"\n> is the X.Y.Z form of the computer's name as names it for ssh \n> etc.), but that didn't work.\n> \n> Any advice about how to persuade the graphics subsystem to \n> bypass X, or how to set DISPLAY in a safe way to run in a cron job?\n> \n> This is a linux system (a recent RedHat server system) with R 2.2.1.\n> \n>     Thanks,\n> \n>     Mark Liberman\n> \n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide \n> http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n> \n> \n> \n\n\n------------------------------------------------------------------------------\nNotice:  This e-mail message, together with any attachments,...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}