{"category": "ham", "to_address": "\"Jason Spiro\" <jasonspiro4@gmail.com>", "from_address": "\"Jason A. Spiro\" <jasonspiro@gmail.com>", "subject": "Re: Could you please forward this proposed license to Teosto? (was: Re: Choosing a license for Frets on Fire songs)", "body": "2007/4/27, Jason Spiro  wrote:\n> 2007/4/27, Matthew Johnson  wrote:\n> > [...] How about using:\n> > http://creativecommons.org/licenses/by-nd-nc/1.0/legalcode with 4. d.\n> > added saying:\n> >\n> >   You may not distribute, publicly display, publicly perform, or\n> >   publicly digitally perform the Work except as part of the game.\n> >\n> > and 1. g.:\n> >\n> >   \"The Game\" means the game Frets on Fire or a derivative work of\n> >   Frets on Fire.\n> \n> Sounds like a better idea than using the license I wrote :)\n> \n> Though if we want to distribute the game in main and the music in\n> non-free shouldn't we write the 4. d. clause more liberally?  How\n> about \"You may not distribute the Work except in a form meant to be\n> used with The Game.\"  (That'd mean \"except e.g. with frets data\n> included alongside the music\"; can anyone suggest a better phrasing?)\n> \n> Or, how about this phrasing instead?  \"You may only distribute the\n> Work if You intend that the work be used with game software.\"  This\n> allows for the possibility of the Work to be used in other computer\n> games.\n> \n> What do you all think?\n\nHi all.  After I wrote the above message I quoted above, Tommi replied\nto me privately.  He'd prefer that the music only be used in either\nFoF, or maybe in FoF and its derivatives.  If we allow use in FoF\nderivatives, he wants to look over the license to check that he's OK\nwith it.  So, for now, let's use the terms Matthew proposed above.\n\nBut one question:\n\nDo those license terms allow the songs to be distributed in a separate\nDebian package from the primary \"fretsonfire\" package?  What if the\nsong package Depends on fretsonfire?[1]  What if it Recommends it?[2]\n\nRegards,\nJason\n\n[1] This, of course, will cause Debian to install fretsonfire if it\nisn't already installed.\n\n[2] This usually will cause Debian to pull in fretsonfire, unless\nusers tell aptitude not to, or unless they use a package manager that\ndoesn't automatically pull in Recommends.\n\n-- \nJason Spiro: Linux consultant, web developer, Windows corporate trainer.\nNo job too big or too small, whether 2 hours or 2 months.\nContact me for info; to see my resume, send email with subject line \"resume\".\n+1 (416) 781-5938 / Email: info@jspiro.com / MSN: jasonspiro@hotmail.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}