{"category": "ham", "to_address": "Ip-health <ip-health@lists.essential.org>", "from_address": "James Packard Love <james.love@keionline.org>", "subject": "[Ip-health] Harvard Graduate Holds X-PRIZE for ALS Research", "body": "http://blog.wired.com/wiredscience/2007/05/harvard_graduat.html\n\nHarvard Graduate Holds X-PRIZE for ALS Research\n\nBy Steven Edwards EmailMay 28, 2007\n\nPrize4life -- an X-PRIZE-style competition intended to stimulate\ninnovation and produce tangible results in ALS research -- recently\nawarded its first prizes: Five researchers each received $15,000 to\ndevelop a biomarker for tracking the progression of ALS, a fatal\ndisease.\n\nIf they, or anyone else, succeed in developing a verifiable biomarker\nby November 6, 2008, they will win $1 million. Such a biomarker would\nenable scientists to test for ALS before the visible onset of\nsymptoms, similar to markers in the blood of AIDS patients. If the\nbiomarker could be detected early enough, researchers may be able to\ntreat patients with neuroprotective drugs to delay or prevent the\ndisease's progression.\n\nThe founder of Prize4Life is Harvard Business School graduate Avichai\nKremer, who was diagnosed with ALS in the fall of 2004. A 2006\narticle in the Wall Street Journal provides this portrayal of him --\nwhich seems to fit most people his (our?) age:\n\n     Avichai Kremer arrived at Harvard Business School in the fall of\n2004, a cocky 29-year-old with a computer-science degree, a few years\nexperience as a platoon commander in the Israeli artillery corps and\nanother few as a manager for an Israeli defense-electronics company.\n\n     \"I felt like a diamond in the rough that only needed the M.B.A.\npolish to fulfill its destiny: conquer the business world,\" he wrote\nin the school's student newspaper in February 2005. \"I thought all I\nwould have to do is choose between the Fortune 500 companies that\nwould offer me the opportunity to become their next CEO.\"\n\nAn article from today's The Boston Globe offers an updated description:\n\n     Avi Kremer's thoughts and words are locked in a constant hare\nand tortoise race, words unable to keep pace with thoughts.\n\n     It is the singular burden of ALS: The mind remains fiercely\nactive, even as the connections from brain to mouth fray. Kremer,\ndiagnosed with the disease just months after enrolling in Harvard\nBusiness School , begins a sentence and stops. Then starts again. And\nstops. Sometimes, when a word proves especially recalcitrant, he\nshakes his head and smiles.\n\n     \"I have developed a lot of patience,\" he said.\n\n     Kremer, whose wheelchair sports a Borat the comedian\nbumpersticker, has not let the disease steal his humor, his\ndetermination, his deep desire to be innovative.\n\nSimilar X-PRIZE-style competitions across multiple conditions and\ndiseases could bring cures for many -- capitalism at its finest.\n\n\n----------------------------------------------\nJames Packard Love\nKnowledge Ecology International\nmailto:james.love@keionline.org\ntel. +1.202.332.2670 / U.S. mobile+1.202.361.3040, Geneva mobile\n+41.76.413.6584\n\n\"If everyone thinks the same: No one thinks.\" Bill Walton\"\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}