{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Hewlett-Packard <us-bulletins@your.hp.com>", "subject": "U.S. Online HP Privacy Statement Update", "body": "\n\n                     Serving you better                               HP offers personalized newsletters, driver and support alerts, and relevant service emails for our products and services that you can unsubscribe from at any time.         »    Learn More                                   Updated HP Privacy Statement                 At HP, we continually strive to serve you better. We recognize that when you want information from us, you want it fast, to the point and relevant. You don’t want to waste time digging for what you need.  With that goal in mind, HP continuously evaluates tools and approaches to improve our ability to get you what you need. \n\n We recognize that trust is at the core of any relationship and that respect for your privacy is a basic component of that trust. To that end, HP has recently revised our Online Privacy Statement for the United States. \n\nThe revised statement includes descriptions of how HP collects personal information to better understand your needs and interests in order to provide customized web and email services, such as Technology at Work and HP’s Promotional Newsletter.   Revisions to the statement include HP’s use of tools, such as cookies, web beacons, and embedded web links to collect data in order to increase the relevance of our communications to you, improve our service to you, and to protect the online experience. \n\n As we believe that a good business dialog is established only when both parties want to engage, we will continue to offer easy profile or preference changes and the ability to unsubscribe from HP communications at any time.  \n\n Learn more by viewing our revised Online Privacy Statement. \n                          You may update your profile update your profile or change your HP communication preferences at anytime. \n\nNote: If you have received more than one email from us related to this revision it is because you are signed up to more than one email service at HP. If updating your preferences, be sure to update your preferences for each email service. \n                                     HP respects your privacy.  If you'd like to discontinue receiving e-mails from HP regarding special offers and information, please click here. \n\n For more information regarding HP's privacy policy or to obtain contact information please visit our privacy statement privacy statement or write to us at: Privacy Mailbox, 20555 SH 249, Houston, Texas 77070, ATTN: HP Privacy Mailbox.           \n\n\n \n\n\n"}