{"category": "spam", "to_address": null, "from_address": "info@updateonline.info", "subject": "your response is needed", "body": "your response is needed\n\n I am Mr. Chen Yuan, a foreign operations manager of the BANK OF \nCHINA,HONG KONG. \n\nI have a obscured business suggestion for you.On May 6 ,2002, an Iraqi \nOil consultant/contractor with the Chinese  Petroleum and Chemical \ncorporation. Major Fadi Basem made a numbered time(Fixed) Deposit for  \ntwelve calendar months, valued at US$8,000,000.00  (Eight Million  \nDollars only) in my branch.  \n\nUpon maturity, I sent a routine  notification to his forwarding \naddress but got no reply. After a month, we sent a reminder and \nfinally we discovered from his contract employers,  the Hong Kong \nPetroleum and Chemical Corporation that the Major and his family had \nbeen killed during the war in bomb blast that hit their home.\n\nOn further investigation, I found out that he died without making a \nWILL and all attempts to trace his next of kin were fruitless. And he \nalso confided in me the last time he was at my office that no one \nexcept me knew of his deposit in my bank\n\nI therefore made further investigation and discovered that Major. \nBassem did not declare any kin or relations in all his official \ndocuments, including his Bank Deposit paperwork in my Bank. This sum \nof US$8,000,000.00 is still sitting in my Bank and the interest is \nbeing rolled over with the principal sum at the end of each year. No \none will ever come forward  to claim it.  \n\nAccording to Laws of Hong Kong, at the expiration of 5(Five) years, \nthe money will revert to the ownership of the Hong Kong Government if \nnobody applies to claim the fund. \n\nConsequently, my proposal is that I will like you as a foreigner to \nstand in as the next of kin to Mr. Fadi Bassem so that the fruits of \nthis old man's labor will not get into the hands of some corrupt \ngovernment officials. \n\nThis is simple, I will like you to provide immediately your full names \nand addresss that the attorney will prepare the necessary documents \nand affidavits that will put you in place as the next of kin. \n\nI want you to know that I have had everything planned out so that we \nshall come out successful. I have contacted an attorney that will \nprepare the necessary document that will back you up as the next of \nkin to Mr Bassem. \n\nThe money will be paid into your account for us to share in the ratio \nof 50% for me and 45% for you and 5% for  any Expenses Incurred in the \ncourse of the transaction. \n\nThere is no risk at all as all the paperwork for this transaction will \nbe done by the attorney and with my position as the foreign operations \nmanager guarantees the successful execution of this transaction. \n\n\nUpon your response, I shall then provide you with more details that \nwill help you understand the transaction. \n\nYou should observe utmost confidentiality, and rest assured that this \ntransaction would be most profitable for both of us because I shall \nrequire your assistance to invest my share in your country. \n\nAwaiting your urgent reply to my very private email address \nchen_gyuan5@yahoo.com.hk . \n\nThanks and regards. \n\nMr. yuan \n\nIf you are really interested in doing this business with me please \nreply immediately via \nmy most confidential email address: \nchen_gyuan5@yahoo.com.hk \n\n\n"}