{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Susie Hickman\" <paxenormousgamestuf@enormousgames.com>", "subject": "Stop being obese and unhappy", "body": "\nWomen will love your new figure\n\n\n\n\n\nAnatrim – The newest and most attracting flesh loss product available – As told on BBC\n\n\n\nDo you realize that superfluous body kilograms kill a plenty of people for every new year? We believe that you hate the unattractive look of those people and the low status they have in society. \n\nMoreover, you have not the will to resist an assault of your pernicious eating habits. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nWe’re proudly introduce you Anatrim, the recent product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life, making you crave less food and always cheering you up. Read what people say about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of eating everything close at hand and watching TV \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am more fit now and there are lots of men around me!\"\n\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but with little result. This terrible appetite would just kick in and spoil everything. \n\n\nOne day I heard on Anatrim from my very best friend and I was really effected at the information.\n\n\n I had attempted using it, and my wife said that I look very good now, 3 months later. \n\n\n26 pounds off and it is not a limit! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMike Brown, Bellevue WA\n\n\n\n\n\nAnatrim helps your mind to understand you doesn’t have such a great need for the constant eating. It raises your spirit, supplies you with extra energy, and attacks unnecessary kilos. Especial thanks to its mighty newly-elaborated formula!!\n\n\n\nPry out latest news!\n\n\n\n"}