{"category": "spam", "to_address": "producttestpanel@speedy.uwaterloo.ca", "from_address": "Navigation System <NavigationSystem@cudgelsolutions28.com>", "subject": "Find your destination with the new Garmin Nuvi GPS System", "body": "You registered to receive this and similar offers from 24.57.130.245 on 03/25/2007 15:03.\n\nDo you have a bad sense of direction?  Let the Garmin Nuvi lead your way! It's the new portable GPS System that can make your travels a lot easier!  \n\nhttp://cudgelsolutions28.com/gkfri/1kk5q/yojuyh?\n\nThe Garmin Nuvi GPS System is our gift to you when you complete our member incentive program.  Register and get started today!\n\nhttp://cudgelsolutions28.com/gkfri/1kk5q/yojuyh?\n\n\n\n\n\n\nThis is an advertisement. Promotion sponsored exclusively by Product Test Panel and is subject to terms and conditions. Please see website for complete details. Participation eligibility is restricted to legal US residents 18 and over. ProductTestPanel is an independent rewards program and is not affiliated with, sponsored by, or endorsed by any of the listed products, retailers, or manufacturers. Trademarks, service marks, logos, and domain names are the property of their respective owners. This email was sent by an affiliate of Product Test Panel. Product Test Panel authorizes \naffiliates to promote its offers to permission based email lists subject to our affiliate terms which include (but are not limited to) providing a working unsubscribe mechanism, not using any third party trademarks such as the names of the manufacturers of the gift items we offer in email from lines, and a subject line which accurately describes the content of the promotional message. If you wish to unsubscribe from this affiliate's list, please use the instructions provided by the affiliate. If you would like to place your email address on Product Test Panel's do not contact list, please visit http://cudgelsolutions28.com/gkfri/1kk5q/yojuyi? and input your email address, or you may write to us at \nProduct Test Panel 3830 Forest Drive, Suite 207, Columbia, SC 29204. Offer not valid to residents of Ohio, and is void where prohibited by law.\n\n\n\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://cudgelsolutions28.com/gkfri/1kk5q/22xuos/0?, or by calling our unsubscribe hotline at 888-243-2870. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\nYou may also contact us by writing to us at our postal address: Wilmot| 3830 Forest Dr., Suite 207| Columbia, SC 29204.\n\n"}