{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Tatiana Wong <istelman@goette.us>", "subject": "Pharmacy evolution", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nVisit us\nMake your life better. Even your sexual partner won't know you are using Viagra if you buy it here.\nClick here to be the best lover in the world!\nAnd no one will know that you have some problems.\nWith best regards,\nTatiana Wong\n \n \nKorotkij otvod ruki k grudi dlia udara energiia pylaet na konchikah Palcev. Navernoe, moe bormotane etomu magu peredal sam Sozdatel, Potomu chto uzhe cherez neskolko sekund ia oshchutil, kak v nashi spiny chto-to letit, i Letit s ustrashaiushchej skorostiu. Ne tak-to prosto vytashchit pushku v lezhachem polozhenii. U Otshelnika, vozmozhno, i to Poluchilos by luchshe. \nReshit i Ischeznut otsiuda okonchatelno. Ispytannoe eiu sovsem nedavno Mimoletnoe rodstvo ih dush ischezlo, ustupi, mesto nepriiazni. Tolko Chto ona byla vdali i vdrug uzhe navisla nad nami, kolodec v ogromnoj gore Kolyshushchejsia sirenevoj massy oblakov, spustivshihsia do samoj zemli. Somneniia ischezli. Vse zhe na serdce u menia pristroilsia bulyzhnik kilogrammov etak v Piat, nesmotria na beschuvstvennuiu broniu, odolzhennuiu mne chuzhim. Na stol shlepnulas miska s melko narezannym miasom, ot kotorogo ishodil Goriachij appetitnyj aromat, riadom opustilsia bokal s vodoj. S vnezapnoj toskoj ia podumal, chto ne sledovalo by sejchas ni o chem Govorit, chuvstvoval ia sebia i tak dostatochno parshivo: gorlo sadnilo, po telu Slovno proshelsia vzvod soldat, no vse-taki ne smog uderzhatsia. V centre komnaty, na zastlannom korotkovorsovym kovrom polu stoial Nebolshoj prizemistyj stolik, nakrytyj beloj skatertiu, s paroj udobnyh stulev Po bokam. \nDa chto Proishodit?! Vtoroj etazh nochiu, tesak? Bred kakoj-to. No spasitelnyj son prishel i smezhil ej Veki, izbaviv na vremia ot dushevnyh terzanij i tiazhkih zabot, tak neozhidanno Svalivshihsia na ee hrupkie plechi. Sperva ia uzrel lish massivnuiu shirochennuiu spinu udaliavshegosia Kengsha, Zaslonivshuiu soboj vse prostranstvo, tesnivshuiusia sredi sten nepodhodiashchego dlia Nee razmera. A zatem Etot merzavec udaril menia po licu. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}