{"category": "spam", "to_address": "gnitpick@flax9.uwaterloo.ca", "from_address": "\"Owen Busby\" <wufescopespab@escopes.com>", "subject": "Stop being obese and unhappy", "body": "\nLess weight - more pleasure and joy\n\n\n\n\n\n\nAnatrim – The latest and most exciting product for over-weight people is now readily available – As shown on CNN.\n\n\nCan you count up all the times when you appeal to yourself to do anything to get rid of this quickly growing number of kilos? Fortunately, now no great price is to be paid. Thanks to Anatrim, the earth-shaking pound-melting medley, you can get healthier mode of life and a really slender figure. Just look at what our customers write!\n\n\n\n\"It’s rather difficult to confess but I was extremely addicted to food. \n\n\nI greedily devoured all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis torment ceased after I started taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food abated, \n\n\nspirits improved and I’m the happiest person in the world 21 pounds in 2.1 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nMaria H., Boston\n\n\n\n\n\n\"I had weight problems since a boy. \n\n\nIt’s difficult to imagine how I detested being derided at school. \n\n\n\n\nI detested the weight and I detested even myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nIt literally pulled me out of this fearful nightmare! Lots of thanks to you, my friends.\"\n\n\n\n\n\nSteve Doubt, Washington\n\n\n\n\n\n\"You know what? Anatrim kept my marriage intact! I went into this circle, depression – more eating – even more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nOne of my friends pointed to your web page and I asked for Anatrim as soon as it was possible. \n\n\nThe results were splendid, my appetite came to normal level, I was often in a good mood, and, of course, I tightened my belt with no regrets. And you see, the bed became cool, too!\"\n\n\n\n\n\nJoe\n\n\n\n\n There are lots of gratitudes happy people leave after taking Anatrim. Don’t you wanna add yourself to the tens of thousands of slim buyers and try this all-natural appetite-suppressing energy raising product now!\n\n\nDo not decline your chance!\n\n\n\n\n"}