{"category": "ham", "to_address": "debian-legal@lists.debian.org, debian-devel@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Anthony Towns  wrote: [...]\n> and a vaguely interesting note is:\n> \n> \t* actually suing based on the license might be complicated by a\n> \t  choice of venue\n> \n> That you can argue the latter is analogous to a \"fee\" isn't really\n> very interesting. That some people are concerned about it is more so,\n> though so far the only concrete concern I've seen is MJ's comment --\n> \"A possible arbitrary lawyer-fee-bomb, depending on the venue specified\n> and its sanity.\" and that's not really very concrete either.\n\nHow about a reference for that quote?  I suspect it's from an analysis\nof the CDDL rather than a package, so it's not concrete because this\nneeds to be checked for each venue used by an actual package.\n\nAIUI, star specifies Berlin, Germany, so I think\nMessage-ID: <20070604080248.GA51694@stack.nl>\nis maybe relevant and any EU venue could be a problem for us.\n\nSo the other thing that needs checking is how those courts will behave\nif an unjustly-accused distributor does not attend court or employ a\nrepresentative to attend.  Any German-speakers willing to point us at\na relevant gov.de document?  My German language skills are not up to\nnavigating legal German safely.\n\nI'm also worried by '3.4. Application of Additional Terms' discriminating\nagainst commercial support, but it only becomes a concrete problem if the\nInitial Developer or any Contributor has authorised support agents.\n\n> No, punting to a GR [...] ends up with -legal\n> folks complaining that the resolution doesn't make sense.\n\nI think that most are reasonable and do that only if the resolution\nincludes no explanation.\n\n\n> ] From: Anthony DeRobertis \n> ] Subject: Re: Results for Debian's Position on the GFDL\n> ] Date: Sun, 12 Mar 2006 17:15:40 -0500\n> ] [...]\n> ] Alas, now that pi != 4*atan(1), how shall we proceed? Interpreting\n> ] licenses and the DFSG is nowhere near as clear as mathematics and,\n> ] unfortunately, just ignoring the GR would, I think, make us look like\n> ] sore losers.\n> \n> because clearly everyone who voted for the winning option is the sort\n> of person who would think pi can be redefined willy-nilly, or that the\n> only reason to respect the GR is to avoid looking like sore losers...\n\nAnthony DeRobertis himself seemed to accept the above quote was hyperbole:\n] It isn't quite as bad as pi = 3, as there is certainly some abiguity in\n] both the DFSG and the GFDL.\nMessage-ID: <44149F64.90808@derobert.net>\n\nCan't we can both respect the GR as a project and let individual Developers\nnote that they don't understand it?  As I wrote at the time:\n\n] It should be noted that even though the Standard Resolution\n] Procedure resolved the disagreement, a 211:145 (roughly 3:2) split\n] when comparing the first two options is hardly a great consensus.\n] There remains a deep division over whether FDL'd works follow DFSG.\n\nAnyway, I welcome aj's realisation that giving good references is vital\nand I ask everyone to do that.  I just wish his posts had more!\n\nRegards,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}