{"category": "spam", "to_address": "<iplacereports@flax9.uwaterloo.ca>", "from_address": "\"JohnLansing@Investorplace.com\" <JohnLansing@Investorplace.com>", "subject": "Trade Talk Weekly May 29: Do You See What I See", "body": "\n\nTrade Talk Weekly Update\n\n\n\n\n\n\n\n\nMay 29, 2007\n“Do you see what I see?”\nIt has now been a month since I directed my traders out of the market.   But we’re not in hiding.   We’re not following the crowd that lives by the mantra “Sell in May and go away.”   We’re smarter than that.   And you are too.\n\nI fancy myself a magician — one who has not yet mastered pulling a white bunny out of a black top hat — but nonetheless a magician.   And I claim that only because I know the tricks of the market.   There are few people that can see behind the ‘oohs’ and ‘aahs’ and truly understand what is happening.\nI am one of them.   But unlike a masterful magician who keeps his tricks to himself, I am more than willing to share.   In fact, I am begging for you to listen — and listen closely.\nThe market is doing just what I thought.   I am not backing down from my call of a correction.   I am still 110% sure that it will happen.   I’m not a fortune-teller.   If I were, I could tell you what day and what time.   But I can tell you that there are things that have already happened or are currently evolving in the market that show a clear picture of the correction to come.\n\n\n\n\nThe Shorter They Were, the Harder They Fell\nThere’s been a lot of talk in the media lately about short interest, with short interest in the NYSE hitting record highs in May.   Many traders believe that high short interest is a bullish sign.   They assume that if short interest is at an all-time high, then the stock has already reached its low.   But that’s a lie.\nLet’s take a look at two stocks on the NYSE: Newmont Mining Corporation (NEM) and Coeur d’Alene Mines Corporation (CDE).   As of May 15, NEM has 16.7 million shares short, and CDE has 38.9 millions shares short.   Also, keep in mind that short interest in the NYSE has hit new highs for three months in a row, not just in May.   Did these new highs prevent the stocks from dropping?\nNo, it didn’t.   It turns out that both of them just hit new 52-week lows, with NEM dropping to $38.64 last Tuesday and CDE dropping to $3.47 last Friday.   The lesson to be learned: high short interest isn’t bullish in itself, it just means there are more shorts in the stock.   The only time high short interest is bullish is when the stock is in an exceptionally bullish pattern that could break out—and even then, the only effect it will have is to exacerbate the move and make it faster than it would be otherwise.\nHigh short interest alone is not enough of a reason to buy—and it’s not stopping stocks from hitting the 52-week low list.\nThere are plenty of myths like this in the market.   Let me be your guide to what is really going on — it’s all there in the charts!   Sign up for Trending123 today.\n\n\n\n12 Charts Show Us the Way\nToday I’m going to give you access to a special alert I sent to my Trending123 members last week, explaining all of the different pieces of the puzzle and how they are coming together to paint the picture of “Correction, Dead Ahead!”\nWatch it now to learn about all of the different factors I’m tracking and how they are going to affect your portfolio, including:\n\nWhy the rally in unleaded gas (and only unleaded gas) is a danger sign\nTwo examples of carry trades fixing to unwind\nHow the QID (the inverse to the NASDAQ’s QQQQ) is going to help us profit off the reverse symmetrical triangle (RST)\nA look at the Bullish Percent Index for the NASDAQ and the S&P500 — the market may be making new highs, but it is forgetting to take stocks with it!\nA bearish cross in the Aroon indicator for the Dow Jones Utilities Average Index that sends shivers down my spine\nSix other charts and the stories that they are telling me right now.\n\nI cannot say this strongly enough — all the evidence still points to a correction.   And yes, I do feel a little bit like I’m stuck out on an island yelling “correction” while everyone else parrots “new highs, new highs.”   All I can tell you is, they aren’t looking at the whole picture.   But you can be.   Watch my special alert on what is happening in the market today.\nNow that you’ve had a peek behind the curtain, you’re ready to learn the rest of the story.   Right now, Trade Talk Weekly subscribers like you can try my Trending123 service at a special rate.\n\nSincerely,\n\nJohn LansingTrending123\n\nP.S. I know it is 80 degrees outside and I’m calling for a blizzard.   But believe me, when the blizzard hits, I’m going to be doing the “I told you so” dance.   I called the correction back in February.   I’m calling this one too, and I want you to be doing that dance with me.   Try out my Trending123 service at $50 OFF the regular price!   Click here to give it a try today!\n\n\n\n\n\nMANAGE YOUR INVESTORPLACE ACCOUNT:\nWe hope this timely investing advice is valuable to you.   Please tell us if your email has changed by visiting here: http://investorplace.com/ipi/e/\nIf you would rather not receive actionable investing advice from InvestorPlace advisors, you can let us know by visiting \nhttp://www.investorplace.com/u/?p=8BM261-1&e=iplacereports@speedy.uwaterloo.ca\nWe will honor your request within 7-10 days.\nACP Phillips Investment Resources, LLC,2420A Gehman LaneLancaster, PA 17602\nCopyright © 2007 ACP Phillips Investment Resources, LLC.\nAll rights reserved.\n05/29/2007 7:50PM\n\nThank you for subscribing to InvestorPlace.com.   Please note that we cannot be liable for any missed bulletins caused by overzealous spam filters.   To ensure that you continue to receive this valuable part of your service please take a moment to add (JohnLansing@InvestorPlace.com) to your address book.   Click here for instructions:\nhttp://www.investorplace.com/whitelist.php?eml=JohnLansing@InvestorPlace.com\n\nee==8BM261\n\n\n\n\n\n\n"}