{"category": "ham", "to_address": "431883@bugs.debian.org", "from_address": "Don Armstrong <don@debian.org>", "subject": "Bug#431883: dcraw license does not give permission to distribute modified versions or source alongside", "body": "On Fri, 06 Jul 2007, Steve King wrote:\n> > You'll notice that we have no permission to distribute modified\n> > versions of dcraw.c as required by the DFSG.\n> \n> I don't agree with you here. It seems to me that we do have\n> permission to distribute modified versions, provided source is\n> included.\n\nThe license does not explicitely grant the ability to create a\nderivative work and distribute that work. It merely talks about\n\"lawfully redistributing this code\".\n\nSince it fails to specifically grant that right, we must assume that\nthe default state (\"All rights reserved\") applies.\n\n> > Secondly, it appears that we must include full source code if\n> > we've modified dcraw.c, but we don't do that. We distribute source\n> > alongside.\n> \n> All that is required in this license is a link to David's home page.\n> The build process does not modify the file dcraw.c, so the footnote\n> clause is applicable to this version of dcraw that would be included\n> in debian.\n\ndcraw.c itself isn't currently modfied, but the package does form a\nderivative work at some level. You can likely argue either way, but\ngiven that a need to apply a security patch to dcraw would cause us to\nrun afoul of the license makes it rather problematic from where I'm\nsitting.\n\nIf the intent is to create a patch only clause, see the LPPL for an\nexample of a patch clause which is permissible.\n\nIn any case, please contact the upstream author and have him clarify\nthe license situtation.\n\nAn explicit licencing under the GPL would resolve all of this for us;\nDave Coffin would still be free to offer it under additional terms if\nhe so desired.\n\nIf you need help drafting the message, let me know.\n\n\nDon Armstrong\n\n-- \nAn elephant: A mouse built to government specifications.\n -- Robert Heinlein _Time Enough For Love_ p244\n\nhttp://www.donarmstrong.com              http://rzlab.ucr.edu\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}