{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "920a 6/13 Update: Crew preps for spacewalk", "body": "\n\n\n\n\n920a 6/13 Update: Crew preps for spacewalk\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 47\nPosted: 9:12 AM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-44 (06/12/07): S4 solar array wings deployed\n   SR-45 (06/12/07): False alarms on station\n   SR-46 (06/12/07): Computer glitches resolved; blanket repair decision deferred\n   SR-47 (06/13/07): Crew awake; prepares for spacewalk, solar panel retraction\n\n=================================\n\n9:12 AM, 6/13/07, Update: Crew awake; prepares for spacewalk, solar panel retraction\n\nAstronauts Patrick Forrester and Steve Swanson are gearing up this morning for a planned six-and-a-half-hour spacewalk to finish rigging a massive rotary joint that will slowly turn a newly installed set of solar arrays to keep them face on to the sun. They also will assist, if necessary, the retraction of the P6-2B solar array extending at right angles to the long axis of the station and the newly installed S4 arrays. The 115-foot-long P6-2B array must be retracted 40 feet or so to provide the clearance necessary for the S4 arrays to rotate and stay face-on to the sun.\n\nBut a partial retraction, while acceptable for a brief period, is not acceptable over the long haul. P6 must be moved by the station's robot arm in October to the left end of the main power truss and the solar array support masts are too fragile to withstand the sort of side-to-side forces they would experience if the move was attempted with more than just a few of the mast bays extended.\n\nDuring a shuttle flight last December, astronauts retracted the left-side blanket of the P6 array - P6-4B - but ran into major problems and had to stage an unplanned spacewalk to fold the balky panels back into their blanket box.\n\nThis time around, controllers are taking a slower, more deliberate approach. Commands were sent early today to pull the central mast supporting the right-side blanket in two feet or so to release tension on springs holding the blind-like panels taut. Starting around 10:43 a.m., an attempt will be made to retract the blankets a full mast bay. If the blankets fold properly, retraction will continue. If not, the mast will be re-extended and another attempt made.\n\n\"Because we think it's very likely that the panels are not going to fold up properly, we initiate the retract (from the ground), we're going to start the morning of flight day six, right before our second spacewalk,\" said station Flight Director Kelly Beck. \"The ground will actually do some configuration to try to minimize the tension on that array to hopefully give us the best chance for getting that panel to fold right.\"\n\nIf that doesn't work, Forrester and Swanson will provide manual assistance at the start of their spacewalk. They have about an hour built into the timeline for P6-2B retraction but after that, they will shift gears and turn their attention to the right-side solar alpha rotary joint, removing launch locks, installing internal braces and positioning a drive motor to engage the main gear.\n\nAdditional P6-2B retraction time is built into the flight plan Thursday and, if necessary, astronauts Jim Reilly and Danny Olivas will provide more manual assistance Friday during a third planned spacewalk. A fourth excursion by Forrester and Swanson is on tap Sunday.\n\nFor identification, Forrester's call sign today is EV-3 and his spacesuit features vertical dash marks on the legs. Swanson's call sign is EV-4 and his suit features diagonal dashes.\n\nHere is an updated timeline of today's activities (in EDT and mission elapsed time; includes rev. F of the NASA TV schedule):\n\nEDT........DD...HH...MM...LAUNCH\n\n06/13/07\n07:48 AM...04...12...10...MCC: P6-2B retracted 1/2 bay\n09:08 AM...04...13...30...STS/ISS crew wakeup\n09:48 AM...04...14...10...EVA-2: Crew lock repress to 14.7 psi\n10:00 AM...04...14...22...NASA Video File on NTV\n10:03 AM...04...14...25...EVA-2: Hygiene break\n10:38 AM...04...15...00...EVA-2: Crew lock depress to 10.2 psi\n10:43 AM...04...15...05...Station robot arm set for retraction viewing\n10:43 AM...04...15...05...P6-2B retraction operations\n10:58 AM...04...15...20...EVA-2: Campout EVA preps\n12:28 PM...04...16...50...EVA-2: Spacesuit purge\n12:43 PM...04...17...05...EVA-2: Spacesuit prebreathe\n01:03 PM...04...17...25...Robot arm maneuvers\n01:33 PM...04...17...55...EVA-2: Crew lock depressurization\n02:08 PM...04...18...30...EVA-2: Airlock egress\n02:48 PM...04...19...10...EVA-2: P6-2B retraction\n03:33 PM...04...19...55...EVA-2: Deploy SARJ braces\n04:03 PM...04...20...25...EVA-2: EV-3: Install SARJ drive motor\n04:03 PM...04...20...25...EVA-2: EV-4: Remove SARJ launch locks\n05:03 PM...04...21...25...EVA-2: EV-3: Remove SARJ launch locks\n07:58 PM...05...00...20...EVA-2: Cleanup and ingress\n08:33 PM...05...00...55...EVA-2: Airlock repressurization\n08:48 PM...05...01...10...Spacesuit servicing\n10:00 PM...05...02...22...Mission status briefing on NTV\n\n06/14/07\n12:08 AM...05...04...30...ISS crew sleep begins\n12:38 AM...05...05...00...STS crew sleep begins\n06:00 AM...05...10...22...Flight director update on NTV\n08:38 AM...05...13...00...Crew wakeup\n\n\"We were going to go out there and remove a series of launch locks and launch restraints on that SARJ, that rotary joint, that would allow that external portion to turn,\" Forrester said in a NASA interview. \"But the program, knowing that we might have some problems retracting that other solar array wing up there, which is 2B, they’d like to look ahead at that and so while Swanny and I are putting our suits on and in the airlock, they will begin to try and retract that solar array.\n\n\"If it turns out that they have some problems, they’ll let us know that before we come out of the hatch and we’ll grab a different set of tools and we’ll head up that direction and be prepared to help with that. If things are going well, we probably are still going to go up and get into that vicinity for about the first hour of our spacewalk and be ready to help out, give direction, maybe, if we need to, help the solar array panels fold the right way.\n\nThe P6 arrays were installed in 2000 to provide power during the early stages of space station assembly. The plan all along was to eventually move them to the left end of the power truss but the 2003 Columbia disaster interrupted station assembly and the P6 blankets were left extended much longer than originally intended.\n\n\"It’s almost like folding a map in your car - you know, once you’ve unfolded the first time you think it would be easy to get it back but it’s not, and these things have been extended for a while and they have a tendency to want to fold the wrong direction back on themselves. And so we’ll just be ready to help out with whatever is required.\"\n\nUsing custom-built, insulated tools, the spacewalkers can push the blankets along creases to help them fold or manually push grommets along guide wires should any hang ups be spotted.\n\n\"I would push along the hinge line if it’s trying to fold the wrong way,\" Forrester said. \"The other thing is. that sometimes there’s a possibility that these guide wires that help guide the solar array down into the box can get hung up on the panels themselves, in which case I’ll use this same tool or another tool that they have kind of manufactured and help that, assist that along the hinges or the where the guide wires run through the panels themselves. And the other part is just watching and being up there to help direct as they’re doing the commands inside the space station.\"\n\nBut Forrester and Swanson will only spend an hour or so on the P6 retraction. After that, even if the array remains hung up, they will turn their attention to getting the starboard SARJ activated.\n\n\"Even if we run into a lot of problems, we’re only going to devote about the first hour of our spacewalk to (P6-2B retraction),\" Forrester said. \"At that point, they’ll have enough information on the ground to begin to prepare for the next spacewalk, and we will move out to the SARJ and begin the spacewalk that we had already trained for.\"\n\nThe S3 solar alpha rotary joint, or SARJ, is equipped with two redundant motors that drive a large gear to slowly spin the outboard solar arrays at 4 degrees per minut so they can stay roughly face on to the sun as the station flies through each 90 minute orbit. Power from the arrays, along with data and computer commands, passes through the center of the SARJ without regard to orientation.\n\nBefore the SARJ can be activated, both motors, called drive lock assemblies, must be manually engaged and then precisely positioned by flight controllers to ensure the drive teeth mesh properly with the main gear. Braces must be positioned, launch locks and thermal shrouds removed, along with a keel pin used to help mount the S3/S4 truss segments in the shuttle's cargo bay.\n\nIn addition, the astronauts must prepare rails on the front face of the new segments to extend the \"track\" used by the mobile transporter to carry the station's robot arm to and from various work sites.\n\nDuring today's spacewalk, Forrester and Swanson will concentrate on positioning the second DLA, removing the remaining launch locks and installing the necessary braces to stiffen the truss segment as required.\n\n\"We are going out to remove a series of launch locks,\" Forrester said. \"There’s 16 of them that are holding this rotary joint, keeping it from turning. That’s mainly because of the launch loads in the shuttle. And so once we get out there, they’re all covered by thermal covers, and we’ll remove those covers then reach in and remove those launch locks. They are basically about a 10-by-12 steel plate being held on by four bolts. We’ll remove those launch locks and then we’ll put those thermal covers back on for protection, and we’ll bring those 16 launch locks in.\n\n\"There are also six launch restraints that we will remove,\" he said. \"There are several other pieces of structure that help just strengthen the actual truss section. Those were not installed for launch also, so there’s a little flexibility as the shuttle kind of shakes and bends on the way up there, that the truss would not be damaged. So it’s really just preparation to be able to rotate the solar array.\"\n\nDuring installation of the P3/P4 truss segments last September, spacewalkers Dan Burbank and Steve MacLean rain into problems with supposedly captive washers that floated away during removal of the port SARJ launch locks. More troubling, it took all their combined strength and about a half hour of work to free one stuck bolt that could have prevented the SARJ from rotating.\n\nThis time around, Forrester and Swanson will be equipped with a custom-built \"torque multiplier\" to permit them to apply the force necessary to free tight bolts without stripping the any threads.\n\n\"They took a torque multiplier that’s in the inventory, that was used for shuttle payloads, and we have modified it so that it will fit on these bolts,\" Forrester said. \"Using that, we don’t think we’ll have any problem pulling any of the launch restraints off.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}