{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Brent Harding\" <bharding@doorpi.net>", "subject": "Re: VmWare", "body": "I tried this with VMWare Player. I was going to load up the Ubuntu 6.10 iso \nand install it on a virtual machine this way. I used easyvmx.com to generate \nthe proper files and chose the ES whatever sound card it would use by \ndefault. Everything seemed to go OK until Orca loaded, and I got odd \nstatic-like noises instead of speech. I think sound is definitely broken \nsome how in VMWare Player. I might uninstall that and try server instead.\n\n----- Original Message ----- \nFrom: \"Jeremy\" \nTo: \nSent: Wednesday, April 18, 2007 2:27 AM\nSubject: Re: VmWare\n\n\n> Late reply to one of the earlier posts on this subject. I had asked a\n> question about how to get a installation of linux running in a vm,\n> and, I have to say that I did get it working. It Turned out to be\n> very easy, but, I was wondering about sound support in the vm as I\n> was just using speakup through my serial port. It was kind of cool\n> when I got it working as I was on skype on the windows host and it\n> never gave me any trouble, but, I am guessing that getting some sort\n> of software synth working would not work unless I had another\n> soundcard to rout it through? I am not even sure if I can find\n> drivers for my soundcard that is built into this laptop, but, that is\n> a question for another time I suppose. If someone can tell me more\n> about how this kind of thing works, that would be wonderful. I\n> noticed that someone did get software speech going with a vm, so,\n> figured I would ask.\n> Thanks bunches.\n>\n>\n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}