{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Revsurge\" <kq83xqldg@corpfan.com>", "subject": "Your =?UTF8?Q?=24?=10,000 line of credit has been approved.", "body": "Urgent*Urgent*Urgent*Urgent\n\nGet a $10,000 line of credit and up to $1500.00 casn advance.\n\n24 Hour Processing Notice:\n\nUrgent, we are obligated to inform you that you are pre-approved to receive a guaranteed $10,000.00 line of credit PLUS and opportunity to receive a cash advance in the amount of up to $1500.00.  \n\nYour pre-approval status has been provided to your regardless of your past credit history.  \n\nThis offer comes to you from national Platinum Plus, the nation's fastest growing providers of credit services.  \n\nRespond within 7 days and not only will you be granted a $10,000.00 line of credit, but we will also allow you to apply for a Cash Advance in the amount of up to $1500.00.  Upon Approval, we may be able to deposti these funds within your account within 24 hours!  Don't delay, this offer may only be available for a period of 7 days.  On or after the date we may be foreced to revooke this offer and re-assign this financial package to someone else.\n\nhttp://likesmug.com/t/kq83xqldg/14193\n\nOffer Authorized By,\n\nRudy J. smith\nVice President of Financial Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This is not a debit or credit card. Applicant must be at least 18 years of age and have a valid U.S. checking account. National Platinum allows account holder to make merchandise purchases exclusively from its on-line shopping site. Most purchases from online shopping site will require a small down payment. Offer not available in Wisconsin. This offer is void where prohibited and available to those 18 years and older. Please see website for full details and terms and conditions of this special offer. If you have any questions in regards to this offer please write to us at: National Platinum Plus: 2 Wisconsin Circle Suite 700 Chevy Chase Md 20815.\n\n\n\nTo unsubscribe from this advertisement go to:\nhttp://likesmug.com/t/kq83xqldg/14194\n\nOr Write to:\nNational Platinum Plus: 2 Wisconsin Circle Suite 700 Chevy Chase MD 20815\ntrmedia620071906\n\n______________________________________________________\n\nNo More Mail:\nhttp://likesmug.com/u/51c/producttestpanel%40speedy.uwaterloo.ca/2\nor write to\nPadNeck\n2309 Bel Air Rd.,Suite 311\nFallston, MD 21047\n\n\n"}