{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Michael Mitchell\" <tugdevplanfaw@devplan.net>", "subject": "Stop being obese and unhappy", "body": "\nA simple and safe way to weigh less\n\n\n\n\n\n\nAnatrim – The latest and most fascinating product for over-weight people available – As shown on BBC.\n\n\nCan you recall all the situations when you asked yourself to do anything for being delivered from this fastly growing number of kilos? Luckily, now no great price is to be paid. Thanks to Anatrim, the earth-shaking kilos-melting combination of elements, you can get naturally health life style and become really slimmer. Just look at what people write!\n\n\n\n\"I hate to confess but I was an awful food addict. \n\n\nI greedily swallowed up all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment left off after I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly vanished, \n\n\nspirits improved and I’m the happiest person in the world 24 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nVictoria K., New York\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't even fancy how I abhorred being mocked at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying this and that I learned about Anatrim. \n\n\n\n\nIt literally pulled me out of this nightmare! The greatest respect to you, my friends.\"\n\n\n\n\n\nMike Brown, Bellevue WA\n\n\n\n\n\n\"Do you know what? Anatrim kept my marriage intact! I fell down into the circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed to your web site and I ordered my pack of Anatrim right off. \n\n\nThe result was excellent, my appetite became normal, I was in good spirits oftener, and, be sure, I went some belt holes back. And you see me, the bedroom became cool, too!\"\n\n\n\n\n\nBob\n\n\n\n\n There is a great number of testimonial letters happy people leave after taking Anatrim. Why don't you add yourself to the thousands and thousands of slender customers and take this natural appetite reducing power raising product now!\n\n\nDo not lose your chance!\n\n\n\n\n"}