{"category": "ham", "to_address": "\"Gustavo Franco\" <stratus@debian.org>", "from_address": "\"=?ISO-8859-1?Q?Andr=E9_Luiz_Rodrigues_Ferreira?=\" <andrelrf@gmail.com>", "subject": "Re: Debian GNU/Linux (kfreebsd anyone?) Lenny Desktop wishlist thread", "body": "2007/4/12, Gustavo Franco <stratus@debian.org>:\nHi list,Hi all!First thanks everybody who contributed to Debian Etch Desktop. There's\nno doubt that we've raised the bar with this release and of course theexpectations for Lenny.Really... I'm very happy for this release! :D\nLenny general release goals and schedule is (in a way) being discussedat debian-release. Keep an eye on that. I'm opening this thread topoint out my wishlist in terms of desktop wearing my debian-desktop;pkg-gnome and tasksel hats. Feedback is needed. ;-)\n* Debian Desktop is the sum of important parts: d-i, debian-cd,tasksel, pkg-gnome, pkg-kde and pkg-xfce were directly or indirectlyinvolved during the Etch development cycle. I would like to seepkg-ltsp, XSF and debian live also join us, you will see the reasons\nbelow;* Xorg \"autoconfiguration\": Hopefully it will be into the nextupstream release and since Lenny will be released in something like 18months, we won't need to work hard to push it into.\n* Automount known partitions: People dual booting complained to methat after installing Debian on their desktops/laptops their previoussystems weren't mounted.This is easy. Could be implemented in desktop-base package?\nWe use it in Debian-BR-CDD project. One script detect these partitions and mount in installation.I can help you with it...\n* preseeding for the win on key stuff: We need to work on grubpreseeding definitely to at least push the desktop to use stuff likesplashy/usplash and maybe an init replacement like upstart. Keep inmind that with preseeding support into grub we can do it in a way that\n'regular' installs won't be affected, but only fresh Lenny desktopinstalls.* cliparts: OpenClipart should be added into the desktop tasksI agree...\n* debian-moreblue update contest: I would like to setup a contest to adebian-moreblue update. We don't need something 200% new, but justpeople that wants to tweak the theme for Lenny. (btw, thanks Andre for\nthe work to Etch)I'm happy in help... :DI created (waiting approval) the Debian Artwork project in Alioth. The idea is use the CCHost (used by OpenClipart Project) for this contest and artwork submission.\nDebian Artwork would be a place for high quality artwork and themes for the Debian Desktop.The idea is use for contest, creating an archive of user contributed artwork that can be freely used.All themes and artwork are tested and moderated to ensure a high standard of quality and to make certain they work.\nThese works will be used for the Debian Desktop team in his packages.How about this ? \n* live! There are live desktop images, but they're not official anddon't really match the desktop tasks.* ltsp: We need to work to make sure that the installer will contain apolished ltsp-client-builder udeb and the user will be able to select\n\"desktop environment\" and \"thin(fat, whatever) client server\" and endwith a system able to provide our desktop environment for theseclients. This is harder than you think due to dhcp and nfs servers\nlack of preseeding support. Shame on me, since I'm one of the pkg-ltspfounders. I'll do my best to prepare patches and send them atached tothe bug reports.* menu system: The Debian menu system needs to be reviewed for both\nGNOME, KDE, Xfce usage and what to do to not break others WMs.* website and wiki: I need help with wiki articles general cleanup andwebsite maintenance. The website needs to contain more generalinformation on how to download and use Debian Desktop, Etch\nscreenshots (GNOME, KDE and Xfce in action). The wiki should be ourdashboard and contains our todo, wishlists and some more stuff thatcan be english-only.Well, that's it. The rest is basically make sure we're in sync with\nthe last upstream release where it's possible and with less RC bugsaround testing.regards,-- stratushttp://stratusandtheswirl.blogspot.com\n--To UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.orgwith a subject of \"unsubscribe\". Trouble? Contact \nlistmaster@lists.debian.org-- Andre Luiz Rodrigues Ferreira (si0ux) <andrelrf@gmail.com> *******************************************************************\nOrlandia - SP - Brazil\n"}