{"category": "ham", "to_address": "debian-devel@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Anthony Towns writes:\n\n> Uh, dude, \"IANAL\" is a way of indicating that you may not actually have\n> a clue what you're talking about because it's all just amateur opinions.\n> Once upon a time -legal used to be littered with it; now days the concept\n> that regular posters to -legal might be mistaken seems to be rather alien.\n\nIn dealing with areas that I have researched thoroughly and lived\nthrough, I am not afraid to say that facts are facts.  When I am not\nsure, I throw in appropriate qualifiers (such as \"I cannot imagine\nxxx\", \"At least in the US, ...\" or even \"IANAL\").  When I do not think\nI have enough good information to make a useful contribution, I make\nno comment.  When appropriate, I cite the relevant documents.\n\nI am no stranger to the idea that I might be wrong.  When someone\npoints out facts that contradict my position, I pay attention.  When\nthe only critiques are based on me not having a secret decoder ring --\nwhether the ring means \"JD\" or \"DD\" -- I tend to discount them.\n\nI do not pretend Debian should pay much attention to whether I think\nchoice of venue is an appropriate tradeoff for the DFSG, for the\nreasons you mention.  I do believe that many of the arguments in favor\nof choice of venue clauses are factually wrong[1], that those should\nbe corrected before a decision is made, and that the decision should\nnot be a casual one.\n\n[1]- e.g. http://lists.debian.org/debian-legal/2007/05/msg00140.html\n\n[snip]\n>> Nitpick: The plaintiff would need to issue a summons to the defendant.\n>> A subpoena is for testimony or other fact discovery[1].  A defendant\n>> does not become a respondent until he responds to a particular\n>> filing[1]; the plaintiff would usually also be a respondent to certain\n>> motions[1].\n>> \n>> [1]- Ask Wikipedia, Google, or whatever floats your boat.  These are\n>> not obscure legal facts or specific instances, they are basic terms.\n>> Would you take someone seriously who had strong programming opinions\n>> but thought \"CC\" was the name of a C compiler or claimed to know the\n>> Pearl _scripting_ language?\n>\n> It's interesting that you started the mail offended about the \"ad hominem\n> attack\" of noting you're not a developer; yet somehow you think a computer\n> expert who tries to avoid paying attention to legal arguments getting\n> \"subpoena\" and \"summons\" confused is an ignoramus who shouldn't be\n> taken seriously.\n>\n> And that is exactly an ad hominem fallacy -- attacking the person in\n> order to discredit their arguments, even though the flaws the person\n> may have don't actually affect their argument.\n\nI have not attacked your position by attacking you.  I have pointed\nout where and why your posts were wrong, stated why I did not think my\ncorrections needed to be backed up by specific citations, and asked if\nyou would take seriously someone who made analogous errors of fact in\na different area.  You asserted in another post that -legal was often\nnot taken seriously by the rest of Debian; it seems fair to point out\nwhy there may be similar feelings in the other direction, at least as\nfar as legal analysis goes.\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}