{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] Cong Daily: Thailand Put On List Of Top Intellectual Property Violators\n ...", "body": "Thailand Put On List Of Top Intellectual Property Violators ...\n\nMartin Vaughan\nCongress Daily\nApril 30, 2007\n\n     China and Russia remain the most egregious global producers of\npirated and counterfeited goods, while U.S. trade officials elevated\nThailand to their list of the world's worst intellectual property rights\noffenders, according to an annual report released today. U.S. officials\nadded Thailand to the Priority Watch List in their Special 301 report,\npartly because of Thailand's handling of compulsory licenses it issued\nto import generic versions of two HIV/AIDS drugs and a heart medication.\nThe report cited an overall deterioration of intellectual property\nrights protection in Thailand, including piracy of optical discs and\nbooks, and cable and signal theft. Regarding Thailand's decision to\nbreak drug patents, U.S. officials confined their criticism of the\nprocess by which Thailand reached that decision, avoiding any assertion\nthat the compulsory licenses themselves violated international trade\nrules. \"I'm not going to comment on whether or not Thailand's actions\nare consistent with the WTO,\" said Victoria Espinel, assistant U.S.\nTrade Representative for intellectual property rights. \"We have a lot of\nconcerns about the process Thailand has used, and the transparency of\nthe situation.\" Health activists and advocates of fewer restrictions on\nthe use of intellectual property criticized the move. One of them, James\nLove, executive director of Knowledge Ecology International, said, \"The\nsanctioning of countries for using legitimate and important\nflexibilities in the [WTO] agreement brings shame to all U.S. citizens\nwho are increasingly seen in Thailand and elsewhere as bullies and\nhypocrites.\"\n\n[snip]\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}