{"category": "ham", "to_address": "srkhasru@bdcom.com, ip-health@lists.essential.org", "from_address": "\"Anne St. Martin\" <annestm@gmail.com>", "subject": "Re: [Ip-health] Export of under patent medicine by Bangladeshi pharmaceutical industries", "body": "--\n[ Picked text/plain from multipart/alternative ]\nDr Md Sayedur Rahman Khasru,\n\nI have provided some answers to your queries to the best of my knowledge,\nbut I welcome any comments criticisms ect from the list serve for\nclarification of certain issues. Bangladesh is in a very unique and\nunprecedented position as the only LDC with pharmaceutical manufacturing\ncapability.\nI was in Bangladesh last spring for public health conference with\nGonoshasthaya Kendra, and I must say you have a very beautiful country.\n\nSincerely,\n\nAnne\n\n\n1. Can Bangladesh as an LDC, produce and export medicines (to LDCs or\nDeveloping\ncountries or all countries) until 2016 that are still under patent without\nany\nroyalties or any agreement with the patent holder?\n\n    Although Bangladesh is a WTO member and signatory to the Trade Related\nAspects of Intellectual property Rights Agreement (TRIPS) since 1995, the\n2001 Doha Waiver granted Least Developed Countries (LDC's) an extension\nuntil 2016 to implement the TRIPS agreement. Bangladesh is currently the\nonly LDC with Pharmaceutical manufacturing capability, and has been\napproached by developed countries with Bilateral Trade Agreements that\ncontain some of the intellectual property standards required under TRIPS.\nHowever, under WTO law Bangladesh is not required to maintain these\nstandards, and is not subject to the WTO Trade Dispute Mechanism for any\nactions that would be in violation of TRIPS if performed by WTO signatory\ndeveloping and developed countries. So essentially, Bangladesh is free to\nmanufacture and export drugs legally under the WTO even if such actions in\nany other pharmaceutical producing country would not be allowed. This puts\nBangladesh in a very unique position. However, if Bangladesh is party to\nBilateral Investment Treaties (BITs) with any other country that includes\nTRIPS or TRIPS plus intellectual property standards, the production of under\npatent medicines would likely draw Bangladesh into arbitration with the BIT\nparty. I was unable to find any existing BIT's with Bangladesh and a major\ndeveloped country, but not all BIT's are public and I must point out the\npossibility.\nWith specific respect to WTO law, as a result of the 2003 waiver and the\nsucceeding 2005 TRIPS amendment, WTO members who have sufficient\npharmaceutical manufacturing capability are now allowed to apply for\ncompulsory licenses to produce medicines for either 1) distribution within\ntheir individual boarders, or 2) for export to another country who has also\nissued a compulsory license for that product. Correspondingly, a WTO member\nwith no production capability can issue a compulsory license and then import\nfrom a manufacturing member state who has also issued a compulsory license\non the named product.\nHowever, due to the 2001 Doha waiver, all 50 Least Developed Countries\n(LDC's) have until 2016 to implement the TRIPS agreement, and therefore need\nnot issue a compulsory license for production, but would need to issue a\ncompulsory license if they wished to import from a developing country that\nproduced the desired medicine under compulsory license. However, Bangladesh\nis the only LDC with pharmaceutical manufacturing capability. This puts\nBangladesh in a very promising position of being allowed to manufacture\nmedicines for use within its own boarders or exportation to other LDC's\nwithout having to first issue a compulsory license. However, in order to\nexport to a developing country that has adopted TRIPS, Bangladesh would have\nto issue a compulsory license or such an action would violate WTO and the\nimporting country would be subject to WTO trade dispute settlement.\n\n2. Does the importing country, if an LDC; needs to issue any license\n(voluntary\nor compulsory) or negotiation with the patent holder?\n3. Does the importing country, if NOT an LDC; needs to issue any license\n(voluntary or compulsory) or negotiation with the patent holder?\n\nThe importing country would need to issue a compulsory license if it is a\ndeveloping country or if it is a LDC who has adopted TRIPS or TRIPS plus\nprovisions through BITs or Multilateral agreements. However, if it has not\nsigned any IP related trade agreements, an LDC would not have to issue any\nlicense.\n\nAs reinforced by the Doha Declaration, WTO member states \"have the right to\ngrant compulsory licenses and the freedom to determine the grounds upon\nwhich such licenses are granted.\" (1)  In essence, a compulsory license is\nauthorization by a national government given to a person or entity to\nexploit the subject matter protected by a patent with or without the consent\nof the patent holder (2).  Article 31 of the TRIPS Agreement titled \"Other\nUse Without the Authorization of the Right Holder\" outlines the conditions\nnecessary for the granting of compulsory licenses, including the obligation\nof the licensing member to make efforts to \"obtain authorization from the\nright holder on reasonable commercial terms and conditions\" for a reasonable\nperiod of time before issuing a voluntary license. However, this requirement\n\"may be waived by a member in the case of a national emergency or other\ncircumstance of extreme urgency or in cases of public non commercial use.\"\nAccording to the Doha Declaration, \"every member has the right to determine\nwhat constitutes a national emergency or other circumstances of extreme\nurgency, it being understood that public health crisis, including those\nrelating to HIV/AIDS, TB, malaria, and other epidemics, can represent a\nnational emergency or other circumstances of extreme urgency.\" Therefore,\ncountries are free under TRIPS to define threats to public health as\nnational emergencies and introduce compulsory licenses into their\nlegislation in the case of an extreme urgency without having to first\nnegotiate with the patent holder for a voluntary license.\nRegardless of prior negotiation before issuing of the compulsory license\n(3), TRIPS Article 31 states that \"the right holder shall be paid adequate\nremuneration in the circumstances of each case, taking into account the\neconomic value of the authorization,\" however it does not define \"adequate\nremuneration\" or \"economic value,\" and countries are free to make this\ndetermination provided they follow a reasonable process. Royalty rates\naround the world for pharmaceutical products vary from 5 percent to less\nthan one percent, and the following royalty guidelines have been recommended\nby the Indian domestic competitive industry: Innovative products 3 to 5\npercent; Production with modest Innovation 2 to 3 percent; Minor Patents 1\npercent or less (4).\n\n4. Can Bangladeshi pharmaceutical industries utilize (import) raw materials\nof\nunder patent medicines procured from any developing countries (like India or\nChina) for export purpose?\n\nWith respect to the importation of raw materials of under patent medicines,\nBangladesh would have to issue a compulsory license through the mechanism\noutlined above if it wanted to import a product that is under compulsory\nlicense in a developing country. Otherwise, the developing country's\nexportation of that product to another country where no compulsory license\nhas been issued would constitute a violation of TRIPS, even if that\nimporting country is an LDC.\nI must emphasize, however, that your first step should be to verify that\nBangladesh is not party to any international trade agreements that contain\nTRIPS or TRIPS+ IP standards. Breaking such regulations would likely result\nin a large suit or arbitration as outlined in the specific agreement\n(arbitration clauses are standard practice in BITs and Multilateral Trade\nagreements).\n\nReferences:\n1) Doha WTO Ministeral 2001: Declaration on the TRIPS Agreement and Public\nHealth. Adopted on 14 November 2001.\nhttp://www.wto.org/english/thewto_e/minist_e/min01_e/mindecl_trips_e.htm(accessed\nDec 4, 2006)\n2) Carlos Correa, Intellectual Property Rights and the Use of Compulsory\nLicenses: Options for Developing Countries. Trade-Related Agenda,\nDevelopment and Equity (T.R.A.D.E.) Working Paper, South Center (1999)\n3) TRIPS Article 31, Other Use Without Authorization of the Right Holder,\nhttp://www.cptech.org/ip/health/cl/cl-art31.html (accessed Dec 10th, 2006)\n4) James Love, Compulsory Licensing: Models for State Practice in Developing\nCountries, Access to Medicine and Compliance with the WTP TRIPS Accord:\nPrepared for the United Nations Development Program, January 21, 2001.\nhttp://www.cptech.org/ip/health/cl/recommendedstatepractice.html\n\n------------------------------------------------------------------\n\nFrom:   srkhasru@bdcom.com\nSubject: [Ip-health] Export of under patent medicine by Bangladeshi\npharmaceutical industries\nDate: May 31, 2007 2:53:30 AM EDT\nTo:   ip-health@lists.essential.org\n\nOn May 31, 2007, at 2:53 AM, Dr Md Sayedur Rahman Khasru wrote:\n\nExport of under patent medicine by Bangladeshi pharmaceutical industries.\n\nWould anybody of this mailing list take the trouble to reply to the\nfollowing\nqueries? We need this information to develop a proposal explaining the\nopportunity of Bangladeshi pharmaceutical industries to export under patent\nmedicine to other LDCs or developing countries.\n\nWe will be highly obliged, if anyone please answer the queries with some\nexplanation, analysis and suggested references.\n\n1. Can Bangladesh as an LDC, produce and export medicines (to LDCs or\nDeveloping\ncountries or all countries) until 2016 that are still under patent without\nany\nroyalties or any agreement with the patent holder?\n\n2. Does the importing country, if an LDC; needs to issue any license\n(voluntary\nor compulsory) or negotiation with the patent holder?\n\n3. Does the importing country, if NOT an LDC; needs to issue any license\n(voluntary or compulsory) or negotiation with the patent holder?\n\n4. Can Bangladeshi pharmaceutical industries utilize (import) raw materials\nof\nunder patent medicines procured from any developing countries (like India or\nChina) for export purpose?\n\nLooking forward to hear from you.\nWith sincere regards,\n\nDr. Md .Sayedur Rahman\nAssociate Professor\nDepartment of Pharmacology\nBangabandhu Sheikh Mujib Medical University\nShahbag\nDhaka 1000\nBangladesh\nTel: 00880-1199840757\nEmail: srkhasru@bdcom.com\n\n-------------------------------------------------\nBDCOM Online Limited. http://www.bdcom.com\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}