{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "countervail: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Friday, June 22, 2007\ncountervail \\kown-tur-VAYL\\, transitive verb:\n1. To act against with equal force, power, or effect; to counteract.\n2. To compensate for; to offset; to furnish or serve as an equivalent to.\n3. To exert force against an opposing, often bad, influence or power.\nIn spite of its keel's weight, and even without the countervailing underwater resistance of its mast, Dubois's boat seemed comfortably stable upside down. -- Derek Lundy, Godforsaken Sea\nThe failure also tended to countervail his undoubted gifts as an international negotiator and his achievements as Foreign Secretary. -- Alden Whitman, \"Career Built on Style and Dash Ended with Invasion of Egypt\", New York Times, January 15, 1977\nUntil the middle of the 1920s Hook's commitment to revolutionary action and passion for philosophy acted as countervailing forces and ambitions, pulling him first one way, then the other. -- Christopher Phelps, Young Sidney Hook\nCountervail derives from Old French contrevaloir, from contre-, \"counter-\" (from Latin contra, \"against\") + valoir, \"to be worth\" (from Latin valere, \"to be strong, to avail\").\nDictionary.com Entry and Pronunciation for countervail\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10004339-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}