{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "840a 6/17 Update: Computer update; final spacewalk on tap", "body": "\n\n\n\n\n840a 6/17 Update: Computer update; final spacewalk on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 68\nPosted: 8:39 AM, 6/17/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-66 (06/16/07): Russians activate revived computers; continue tests and troubleshooting\n   SR-67 (06/16/07): Two more computers recovered after additional bypass work\n   SR-68 (06/17/07): Crew awake; final spacewalk on tap\n\n=================================\n\n8:39 AM, 6/17/07, Update: Astronauts prepare for final spacewalk\n\nFlight controllers have re-activated most of the major systems in the Russian segment of the international space station, keeping four of six revived primary computers on line and two on standby for use as needed.\n\n\"Things are looking very good,\" Flight Director Holly Ridings said early today. \"In real generic terms, everything's back on except for our Elektron (oxygen generator) and they just wanted to wait and watch the computers for another day or two and make sure everything was good before they brought it back up. But that's almost nominal in terms of all the systems.\"\n\nU.S. and Russian mission managers plan to test the station's attitude control system Monday, between 9 a.m. and 10 a.m., to make sure the revived Russian guidance, navigation and control system computers can maintain the proper orientation using rocket thrusters. If that test goes well, the recovery from last week's computer problems will be virtually complete and the Atlantis astronauts likely will be cleared to undock as planned on Tuesday.\n\n\"From a data standpoint, there are a couple of things we want to look at,\" Ridings said. \"We obviously haven't used the thrusters on the Russian segment since we had this (computer) issue. And so before we undock, which requires having our computers on the U.S. side and the Russian side talk to each other, we're going to do some checkout on (Monday).\n\n\"The current plan is to go over on Russian thruster control and just hold our nominal ... attitude for 45 minutes or so, in which the thrusters have to fire to hold that attitude. And then we'll have checked out the communications at a very detailed level, make sure the thrusters are still talking to the computers and prove to ourselves we've done everything we can in order to undock safely.\"\n\nThe shuttle astronauts today are gearing up for a fourth and final spacewalk to complete the activation of a powerful rotary joint on the right side of the station's main solar power truss that was installed last week along with the new S4 solar arrays. The solar alpha rotary joint, or SARJ, is designed to slowly turn outboard arrays like a huge paddlewheel to keep the solar blankets face-on to the sun. An identical joint on the left side of the main truss turns the port-side P4 arrays.\n\nFlight controllers plan to put the starboard SARJ through its paces Monday.\n\n\"The flight control team is going to do some checkout a little bit at the end of the day, they're going to turn on the busses, make sure they work, we're actually going to move the SARJ just a tiny bit, five degrees, we're not going to rotate all the way around. So we'll do a little bit of check out.\n\n\"We don't want to do it during crew sleep. Moving the SARJ, as you might imagine, creates a torque, it's a big joint. Because we haven't done the (attitude control) test, handover to the Russian segment to try out the thrusters, we don't want to create a lot of torque during crew sleep just in case it all doesn't work out the way we want it to and we've got to wake up the crews.\"\n\nOn Monday, \"we'll put the SARJ in an auto-track mode where it tracks the sun continuously,\" Ridings said. \"We're going to do that kind of integrated with our attitude control plan. So if we see a very large torque in our control moment gyros, we've got a plan in place to hand over and have the orbiter control attitude for us and then do our thruster test and then go ahead and get back to our normal CMG attitude control.\"\n\nBefore the SARJ can be activated, spacewalkers Steve Swanson and Patrick Forrester must verify the operation of a toothed gear drive motor called a drive lock assembly and remove a final few launch restraints. During initial checkout of the SARJ last week, flight controllers discovered commands to DLA-1 were actually going to DLA-2 and vice versa.\n\nBefore beginning the SARJ work,Swanson and Forrester plan to install a television camera stanchion. After the SARJ activation is complete, the spacewalkers will stow a shuttle payload bay mounting pin called a drag link and install a rail stop on the end of the robot arm mobile transporter rails that run along the forward face of the S3/S4 truss segments.\n\nTurning to a variety of assembly get-ahead tasks, Swanson and Forrester plan to route a computer network cable along the outside of the Unity module that eventually will allow commands to be sent to Russian systems from the U.S. segment of the station. After that, the spacewalkers will adjust an S-band antenna system, open a newly installed hydrogen vent valve to permit the future operation of a new U.S. oxygen generator and tie down a debris shield.\n\nAirlock egress is scheduled for 12:38 p.m. For identification, Forrester's call sign is EV-3 and his suit features vertical dashes on the legs. Swanson's call sign is EV-4 and his spacesuit is marked with diagonal dashes. Astronaut James Reilly will serve as the spacewalk coordinator inside the shuttle Atlantis. Cosmonaut Oleg Kotov will assist Forrester and Swanson in the Quest airlock module.\n\nHere is an updated timeline of today's activities (in EDT and mission elapsed time; includes rev. M of the NASA TV schedule):\n\nDATE/EDT...DD...HH...MM...EVENT\n\n06/17/07\n\n07:38 AM...08...12...00...STS/ISS crew wakeup\n08:18 AM...08...12...40...EVA-4: Airlock repress to 14.6 psi\n08:33 AM...08...12...55...EVA-4: Hygiene break\n09:08 AM...08...13...30...EVA-4: Airlock depress to 10.2 psi\n09:18 AM...08...13...40...EVA-4: Campout EVA prep\n10:58 AM...08...15...20...EVA-4: Spacesuit purge\n11:13 AM...08...15...35...EVA-4: Spacesuit prebreathe\n12:03 PM...08...16...25...EVA-4: Airlock depressurization\n12:33 PM...08...16...55...EVA-4: Spacesuits to battery power\n12:38 PM...08...17...00...EVA-4: Airlock egress and setup\n01:18 PM...08...17...40...EVA-4: EV3: SARJ DLA-2 verification\n01:18 PM...08...17...40...EVA-4: EV4: SARJ restraint removal\n02:03 PM...08...18...25...EVA-4: EV3: SARJ restraint removal\n02:33 PM...08...18...55...EVA-4: Stow S3 drag link stow\n03:33 PM...08...19...55...EVA-4: Debris shield bolt release\n04:03 PM...08...20...25...EVA-4: EV3: Mobile transporter rail stop\n04:03 PM...08...20...25...EVA-4: EV4: S3 cleanup\n04:33 PM...08...20...55...EVA-4: Node/SM LAN cable routing\n05:33 PM...08...21...55...EVA-4: SASA gimbal locks\n06:03 PM...08...22...25...EVA-4: EV3: Vent valve opened\n06:03 PM...08...22...25...EVA-4: Debris shield fix\n06:23 PM...08...22...45...EVA-4: Cleanup and airlock ingress\n07:03 PM...08...23...25...EVA-4: Airlock repressurization\n07:18 PM...08...23...40...Spacesuit servicing\n09:00 PM...09...01...22...Mission status briefing on NTV\n10:38 PM...09...03...00...ISS crew sleep begins\n11:08 PM...08...03...30...STS crew sleep begins\n\n06/18/07\n\n12:00 AM...09...04...22...Daily video highlights reel on NTV\n06:30 AM...09...10...52...Flight director update on NTV\n07:08 AM...09...11...30...Crew wakeup\n\nThis will be the 87th spacewalk devoted to space station assembly and maintenance since construction began in 1998. Going into today's excursion, 48 U.S. astronauts, 15 Russian cosmonauts, two Canadians and four astronauts representing Japan, Germany, France and Sweden had logged 530 hours and 34 minutes of EVA time building and maintaining the space station.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}