{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Robert Mckenzie <donnac@goldenhorn.com>", "subject": "Simple way to enhance your sexual life.", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nClick here to become a sex giant\nAbsolutely legal, licensed and CHEAP pills at your choice. Confidential purchase. Instant shipping\nGo to the site\nThere is no need to have a prescription, just visit our store and buy the pills you want.\nWith best regards,\nRobert Mckenzie\n \n \nUchastok kamennogo pola, Nad kotorym plyl cherep, dymilsia i plavilsia, rastekaias po kraiam bagrovoj Puzyriashchejsia massoj. Ty otkazyvaesh v nabliudatelnosti masteru mecha? Posle togo kak Niksard stol neosmotritelno pribil ego k stenke sobstvennymi mechami? Zria. Dazhe ustalost i tupaia bol v izranennom Lice ne privodili ego v takoe beshenstvo i otchaianie, kak odnorukost. Tak ty govorish, nam neobhodimo Popast na Fermu? Dumaiu, ona nedaleko. \nProshchaj! I ia ostalsia odin. Tak chto vyiasniat otnosheniia Predstoialo golymi rukami. K tomu zhe Spustia neskolko let on nachal stremitelno staret. Veteranam bylo Ne privykat k podobnoj pogode. Ne iz-za togo li, chto ty zabrala u Dosa bankos, kotoryj prinadlezhit mne? S chego eto ty vzial, chto on prinadlezhit tebe? ona, kazalos, Udivilas. Chuvstvuia Sebia krajne omerzitelno, ia zubami otodral svoiu mertvuiu kist ot rukoiatki Klinka i, uroniv ee na kover, vzialsia za rukoiatku levoj rukoj. Telo mertvyj komok Izranennoj ploti, v golove bezumnaia iasnost predshestvuiushchego konca. Esli ne bylo znamenij, esli Krug Prichastiia ne Zval tebia v svoe lono lichno, posylaia veshchie sny, da eshche otsutstvovali Priznaki To i nechego bylo tuda sovatsia v nadezhde na to, chto on vdrug priznaet tebia svoim Zabludshim synom. \nDa, na serdce bylo Mutorno, no, po suti dela, vybora u menia ne bylo idti s Nkotom ili Vernutsia. No v etoj Istorii est mnogo neponiatnogo. Inogda, korotko otvetil Nkot, uzhe ischezaia za chernymi stvolami Lesnyh ispolinov. Uspeh podobnoj ataki zakliuchalsia imenno v slazhennosti, odnovremennosti dejstvij. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}