{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tMONDAY 23 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tToday's Quote for the Day comes from this morning's speech from David Cameron on what he claimed is the increasingly yobbish and unpleasant nature of British society. \n\n\n\"All these are sad signs of a culture that is becoming decivilised - and the terrible thing is, we're getting used to it.\"\n\n\nIn tonight's programme: \n\n\nYELTSIN\n\n\nWhen he was in power his colourful attitude to life led to regular predictions of demise from heart failure. \n\n\nToday some seven years after his resignation from office, we finally received news of the death of the former Russian leader Boris Yeltsin - a transitional figure, some might say, between Gorbachev's reforms and the new authoritarianism of Putin. But what really is his legacy? \n\n\nCHALLENGER TANKS \n\n\nMark Urban joins us from Baghdad, where the MoD has confirmed that insurgents have succeeded in penetrating the hide of a Challenger tank with a roadside bomb. \n\n\nWhat does this now mean for the safety of British troops? \n\n\nSOCIAL RESPONSIBILITY \n\n\nOn the day David Cameron makes a keynote speech about the need of government to balance rights with responsibilities, school teacher Angela Mason faces a lifetime ban from teaching from the General Teaching Council, the teacher's equivalent of being 'struck off.'\n\n\nHer crime? She secretly filmed the bad behaviour routinely encountered in a school for a TV documentary. We'll be speaking to her live.\n\n\nFRANCE \n\n\nSpeaking of what government is for, this is clearly a watershed election for the French Republic and - by extension - for all of Europe. Now we know it is Sego vs Sarko in the final round - what difference will it make?\n\n\nWiFi\n\n\nSome people seem to be super-sensitive to low level microwave radiation. \n\n\nSo on the day the City of London switches on the Europe's single largest wireless Internet zone, we meet the people who, unless they want to spend their lives wracked with migraines and nausea, will have to walk around with tin foil wrapped around their heads in this brave new world. \n\n\nAND FINALLY ...\n\n\nToday's Joke Fit For an Eleven Year Old comes from (occasional) Newsnight viewer James (aged 13):\n\n\n\"Why is Arsenal FC like a three pin plug? Because they're both useless in Europe.\"\n\n\nNewsnight is at 10.30pm on BBC2.\n\n\nGavin\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}