{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Public Eye <cbsnews___publiceye_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "PE Today: Media Hearts Mike", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\nMike \n      Bloomberg, You FlirtMike Bloomberg may not be running for \n      president, but don't tell that to the press corps. They're going ga-ga \n      with anticipation, and it might just break their heart. [+ Read More]\n\nFox \n      News Declines C-SPAN's Request To Carry DebateIf you're \n      interested in catching Fox News Channel's GOP Presidential Debate tonight, \n      you better make a point of tuning in or TiVo'ing it. Unlike the two \n      earlier debates hosted by MSNBC, you won't be able to find the debate \n      anyplace else on the TV or radio dial. Public Eye has learned that Fox \n      News Channel refused C-SPAN's request to simulcast the debate on C-SPAN \n      radio, as well as the opportunity to rebroadcast replays on any of the \n      C-SPAN television channels. [+ Read More]\n\nRigging the \n      Popularity ContestWe’ve just gotten acclimated to the fact \n      that – in order to keep those ratings up – cable networks have changed the \n      definition of news from “vital information you must know to be an informed \n      citizen” to “hey, check this out!” And now we find out that the \n      articles that “everybody’s talking about” could very well be ho-hum \n      stories that mischievous online souls are trying to peer-pressure you into \n      reading.  [+ Read More]\n\n E-mail us your questions, tips, \n      concerns Public Eye RSS Feed\n\n\n\n\nAdvertisement\n\n\n\nEditor's \n      Picks\nHoles \n      in the Gatekeepers’ Fence?\n \nWho You Calling \n      Narcissistic?\n \nCBS News \n      Reaches Out To The Anna Nicole Judge\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}