{"category": "ham", "to_address": "jdaviestx@tx.rr.com", "from_address": "Luis Matos <a26652@alunos.mec.ua.pt>", "subject": "Re: congratulations to all Debian  contributors", "body": "Dom, 2007-04-15 às 14:15 -0300, André Felipe Machado escreveu:\n> Hello,\n> Please, read the reviews at  http://wiki.debian.org/PressCoverage2007 >\n> Debian GNU/Linux 4.0 reviews :\n> \"Debian redefines itself with new release\"\n> \"Installing Debian Etch on Toshiba Tecra M5\"\n> Congratulations.\n> Andre Felipe Machado\n> \n> \n> \njust a point ...\n\nfrom the reviews i read i found that all of them had the same\nsupposition: debian is only the main repository.\n\nin the tecra M5, for example, the DVD rom i don't have a work, but there\nare nvidia drivers and the ipw3945ABG ... i have one of this is my own\nlaptop and worked out of the box ( after i added non-free and installed\nit, of course)\n .. and there is xsupplicant in debian ( and it is installed i think by\nnetwork-manager) no need to download nd install it from source.\n\n\nThere ARE nvidia drivers, packaged from nvidia.com in non-free ... \n\ni am pointing this out because:\n\n1) maintainers packaged this nd maintain good quality solutions in terms\nof stability and ompatibility with the system\n\n2) it's easier for the user to add non-free and install the packages.\n\n3) Debian is a fine quality distribution that includes TONS of\nsoftware... and people thinks that it does not have some of the more\nimportant support for wireless and video).\n\n\nother comments directly to the tester of the M5 laptop:\n\n - cdrecord is not even in debian.\n - please use debian tools to check the description of the package named\ncdrecord.\n\nseems to me that you are  console kind of guy. (apt-cache show cdrecord\nis your friend)\n\nalso, i think there are some issues that are found to be important:\n - gdm overlaps xorg.conf\n - hwclock issue.\n\nbest regards\n\nLuis Matos\n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}