{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Re: Request for GR: clarifying the license text licensing / freeness issue", "body": ">Nathanael Nerode  wrote: [...]\n>> Without this exception, if the DFSG were followed literally, most \n>> license texts could not be shipped in Debian and would have to be \n>> shipped alongside Debian instead, which would be very annoying.\n>\n\nMJ Ray wrote:\n>Most?  I thought most licence texts were covered by themselves, being\n>shipped as part of the software,\nYou're correct; although that is implicit permission, not explicit.  I \nwas wrong; \"most\" is incorrect.  That should be fixed. How about \n\"Several important license texts\"?\n\n> but we can't modify the ones shipped\n>in debian because we need to accurately pass on the permissions given\n>to users.\nRight.  I was very careful with my proposed text: the emphasis on \nderivative works makes it clear that it's the ability to create new\nlicense texts which is important here.\n\n>AFAIK, the few which have different terms for modifying the licence\n>rather than the rest of the software (such as the GPL) come with \n>explicit permission to modify.\n\nHere, you're *wrong*.  The preamble to the GPL must be included with all\ncopies -- but the separate permission to modify does not extend to the \npreamble.  Likewise the LGPL.  The Academic Free License does not have \npermission to modify.  The LaTeX Project Public License does not have \npermission to modify.\n\n>> Historically, this exception has been an unwritten assumption; [...]\n\n>Has it?  I've seen a few people write down this assumption, but I've\n>usually disagreed with them.\nThere you go, Wouter.  :-)\n\n>We don't need this exception.  It would allow another way for people\n>to argue for including non-free software in debian ('but it's part of\n>the licence'), just like some use the current non-free logo licences\n>to argue for inclusion of their non-free logos.\n\nWe've already *got* non-free software in Debian, namely the license \ntexts above.  In fact people are already arguing exactly what you said.  \nThis would simply be more honest about it.\n\nCare to craft another solution?  I don't think we actually want to go to \nthe trouble of kicking those license texts out. (If however you'd like \nto devise a technical scheme for detached licenses, living alongside\nthe .debs and .tar.gzs rather than in them, that would be great.  It\nwould also require a change to policy, of course.)\n\nI also think (from experience) that it's going to be a very long slog to \nget the license text licenses changed (commentary on this is in the \nGPLv3 comments system but being ignored), and that the opinion of Debian\nthat they should be changed, as expressed in the DFSG, would help with \nthat.\n\nThe current situation is dishonest (or, to be polite, \"misleading\") to \nDebian's users, and it should be  fixed.  I have proposed a compromise \nwhich I consider akin to the patch clause compromise.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}