{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Faith Stovall\" <wufesndcpab@esndc.org>", "subject": "Check out the wonders of pound melting", "body": "\nSummer is almost here, be ready\n\n\n\n\n\nAnatrim – The latest and most attracting product for corpulent people is now readily available – As you could see on ABC\n\n\n\nDid you see superfluous body kilos kill a plenty of people around the planet? We believe that you hate the ugly look of people like those and the low status they have in society. \n\nOr, maybe, you have not the will to resist a pressure of terrible eating habits of yours. Does it all sound familiar? Then we have something for you!\n\n\n\n\n\nHere comes Anatrim, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, soothing your feeling of hunger and giving you gay spirit. Here you may see some e-mails from our customers:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV constantly and eating everything close at hand \n\n\nI became keen on doing sport.\n\n\n\n\n\n\n Anatrim made me stride on confidently.\n\n\n I have a great form now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nRita R., New York\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but to no purpose. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOnce I heard on Anatrim in the media advertisement and I was really effected by the information.\n\n\n I had attempted taking it, and my wife said to me that I had changed for the better since then, 4 months later. \n\n\n27 pounds have gone away and it is not a limit! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSteve Burbon, Chicago\n\n\n\n\n\nAnatrim helps you to realize that you don't need that much food. It raises your spirit up, supplies you with extra energy, and attacks unnecessary kilos. All thanks to its powerful distinguished formula!!\n\n\n\nElicit more information!\n\n\n\n"}