{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"Health Week\" <mailings@mail.cnn.com>", "subject": "This Week in Health", "body": "\n\n\n\n\nCNN.com - Health Week\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, June 1, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRare TB leaves doctors with less-effective treatment options\nThe highly dangerous form of tuberculosis that has infected a man whose international travel put dozens of others at risk resists almost all drugs used to treat TB, leaving only less effective options.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStrength training may reverse muscle aging\nIt's well known that resistance exercises improve muscle strength and function in young and old alike, but the new research suggests that strength training also affects older muscles genetically, essentially turning back the clock on muscle aging.\nFULL STORY\n\n\n\n\n\n\nContrary to popular thought, obesity is bad for bones\nNew research does not support the general belief that obesity increases bone mass and is therefore good for bone health. A study, in which investigators corrected for the mechanical loading effect of increasing body weight, suggests the opposite.\nFULL STORY\n\n\n\n\n\n\nResearchers find big batch of breast cancer genes\nA genetic mutation that raises the risk of breast cancer is found in up to 60 percent of U.S. women, making it the first truly common breast cancer. Researchers identified changes in four other genes that raise the risk of breast cancer significantly.\nFULL STORY\n\n\n\n\n\n\nStressed-out moms at risk of poor mental health\nMothers of young children who feel they lack emotional support or help in caring for their children have more than three times the risk of mental health problems compared with their peers who feel adequately supported, a new study shows.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the Health Week email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}