{"category": "spam", "to_address": "\"Subscriber\" <producttestpanel@flax9.uwaterloo.ca>", "from_address": "\"Reference #TAR-1030\" <q_tdw9y7j@disksnap.com>", "subject": "TARGET 500 Dollar Gift Card Inside - Use Instore or Online ", "body": "\n\n\n    \n<!--DURHAM, N.C. - Duke University has reached an undisclosed financial settlement with three former lacrosse players falsely accused of rape, while a judge said late Monday he would order the disbarred prosecutor to leave office immediately. \n\nADVERTISEMENT\n \nDuke had suspended Reade Seligmann, Collin Finnerty and Dave Evans after they were charged last year with raping a stripper at an off-campus party. The university also canceled the team's season and forced their coach to resign.\n\n\"We welcomed their exoneration and deeply regret the difficult year they and their families have had to endure,\" the school said Monday in a statement. \"These young men and their families have been the subject of intense scrutiny that has taken a heavy toll.\"\n\nThe allegations were debunked in April by state prosecutors, who said the players were the innocent victims of a \"tragic rush to accuse\" by Durham County District Attorney Mike Nifong. He was disbarred Saturday for breaking more than two dozen rules of professional conduct in his handling of the case.\n\nThe players' families racked up millions of dollars of legal bills in their defense, and appear likely to file a lawsuit against Nifong.\n\nThe players said in a joint statement that they hoped the agreement would \"begin to bring the Duke family back together again.\"\n\n\"The events of the last year tore the Duke community apart, and forcibly separated us from the university we love,\" they said. \"We were the victims of a rogue prosecutor concerned only with winning an election, and others determined to railroad three Duke lacrosse players and to diminish the reputation of Duke University.\"\n\nEarlier Monday, Nifong said he planned to leave office next month in a resignation letter to Gov. Mike Easley and to Superior Court Judge Orlando Hudson, who is overseeing a pending request to remove Nifong from office.\n\n\"It is my fervent hope that this action will spare this community the further anguish a removal hearing would entail and will allow the healing process to move forward,\" Nifong wrote.\n\nBut Nifong's July 13 departure date wasn't soon enough for Hudson, who decided late Monday to suspend Nifong from office.\n\n--!>         This is an independent offer from MediaShaperz.com, Target is not a sponsor or co-sponsor of this promotion. Target is a registered trademark. This offer may contain errors and inaccuracies and therefore we reserve all rights.Participation in advertiser surveys are required and you will have to meet the Terms and Conditions to receive your free gift. If you no longer wish to receive MediaShaperz.com emails please visit here or Print a copy of this email and send a postal mail to: MediaShaperz.com, 2263 Boca Raton Blvd, Boca Raton Fl 33431.     Privacy PolicynnnTerms and Conditions    \n\n\n\n\n\n"}