{"category": "ham", "to_address": "<roland.rproject@gmail.com>", "from_address": "<ngottlieb@marinercapital.com>", "subject": "Re: [R] R Book Advice Needed", "body": "Roland:\n\nThanks for your reply.\n\nI have sort of pay my \"dues\" with statistics and doing the hard math\nreading of\nProofs.\n\nYears ago reading lots of books on Multi-variate Methods such\nAs Principal Components, Cluster Analysis, Discriminant Analysis,\nMulti Dimensional Scaling(MDS), Optimization both LP and QP and more.\n\nAt this point, want to jump in avoiding all the\nMathematical proofs and just apply R and the packages for what I want to\ndo.\n\nSo as example, How to set-up a dataset (timeseries of returns),\nformatted so I can do\nA cluster Analysis and nicely format a dendrogram.\n\nI am hoping the right books can show me, not concerned about\nwhich distance measure and cluster method (i.e. Ward's, Single Linkage\netc)\nDone this and know based on type of data what works best.\n\nJust some simple books to jump start me right into practically applying\nR.\n\n\nThanks for your response.\n\nRegards,\nNeil\n\n-----Original Message-----\nFrom: Roland Rau [mailto:roland.rproject@gmail.com] \nSent: Wednesday, June 13, 2007 10:14 AM\nTo: Gottlieb, Neil\nCc: R-help@stat.math.ethz.ch\nSubject: Re: [R] R Book Advice Needed\n\nHi,\n\nngottlieb@marinercapital.com wrote:\n> I am new to using R and would appreciate some advice on which books to\n\n> start with to get up to speed on using R.\n> \n> My Background:\n> 1-C# programmer.\n> 2-Programmed directly using IMSL (Now Visual Numerics).\n> 3- Used in past SPSS and Statistica.\n> \n> I put together a list but would like to pick the \"best of\" \n> and avoid redundancy.\n> \n> Any suggestions on these books would be helpful (i.e. too much \n> overlap, porly written etc?)\n> \n> Books:\n> 1-Analysis of Integrated and Co-integrated Time Series with R (Use R) \n> - Bernhard Pfaff 2-An Introduction to R - W. N. Venables\n> 3-Statistics: An Introduction using R - Michael J. Crawley 4-R \n> Graphics (Computer Science and Data Analysis) - Paul Murrell 5-A \n> Handbook of Statistical Analyses Using R - Brian S. Everitt \n> 6-Introductory Statistics with R - Peter Dalgaard 7-Using R for \n> Introductory Statistics - John Verzani 8-Data Analysis and Graphics \n> Using R - John Maindonald; 9-Linear Models with R (Texts in \n> Statistical Science) - Julian J.\n> Faraway\n> 10-Analysis of Financial Time Series (Wiley Series in Probability and \n> Statistics)2nd edition - Ruey S. Tsay\n\nas one other message says, it depends a lot on your ideas what you want\nto do with R. And, I'd like to add, how familiar you are with\nstatistics.\nOne book I am missing in your list is Venables / Ripley: Modern Applied\nStatistics with S. I can highly recommend it.\nIf you are going to buy yourself only one book, then I would say: buy\nVenables/Ripley\n\nBest,\nRoland\n--------------------------------------------------------\n\n \n \nThis information is being sent at the recipient's request or...{{dropped}}\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}