{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Spie Sutherland\" <spie@proficio.ca>", "subject": "Re: Definitely unslung", "body": "There is nothing wrong with Intel. The discussion was comparing\nx86 compatible with ARM, two different animals that serve two\ndifferent purposes. The x86 architecture is CISC and has more \ninstructions and generally many more transistors and higher clock\nspeed, more RAM, more peripherals, and requires a lot of power\nrelative to ARM which uses RISC, less instructions, simpler bus\narchitectures, lower clock speed, usually much less transitors\nand therefor much lower power and less heat generated.\n\nThe x86 architecture is actually preferrable if you can deal with\nthe power and heat requirements, especially for the application\ncompatibility reasons. Linux on ARM works great but you can't\nexpect drivers, and therefore many applications to just work.\nAt minimal they need to be compiled, and in many cases they \nwill not work without re-writing drivers. There is no ISA or PCI\nbus on ARM, you have ABI or EABI or some proprietary bus\ndepending on manufacturer. Most phones use ARM processor\nin fact ARM owns that whole space. ARM is desireable for \nsmall portable devices, but in the sub-notebook category it \nstill makes sense to use x86.\n\nI am working with ARM specifically for the low power and \nlow heat benefits, but as I said it's a completely different class\nof applications. Even if you're not dealing with graphics like\nx-windows, there is little source compatibility, except where\nno hardware specific drivers are involved. There is no such\nthing as BIOS on ARM, most systems boot from a kernel\nloaded onto flash with embedded file system and scaled \ndown versions of standard tools for example busybox. \nThere is lots to learn and more work to do when developing\nsoftware, setting up a cross platform development toolchain,\noften JTAG is required to flash the kernel, you're generally \nmuch more concerned about memory limitations and other\nimplications of using a smaller scale architecture.      \n\nAlso, Intel is a brand name, they made StrongARM which\nevolved to X-Scale, also RISC and uses the original ARM \nas core with Intel specific extensions. So using the name \nIntel is only a brand, the discussion was x86 versus ARM,\nin general x86 is preferrable for anything larger than PDA,\nARM for PDA and smaller. \n\n  -- Spie\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}