{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Vanessa Le <jeffinbldr@griffocom.com>", "subject": "Virgin penetrator", "body": "\n\nIs there any reasons to pay more? Do you want to save your money? I bet you do! \nClick to visit us\nOnline Medications drug store gives you the opportunity to recover your health. Do it now!\nClick here to be the best lover in the world!\nWe offer only legal and licensed medications. Cheapest prices you ever seen.\nWith best regards,\nVanessa Le\n \n \nVerno. Ziabko peredernuv plechami, Mihkaj pobrel k svoej budke. A Zatem, poslednim mrachnym mazkom kisti, sotvorivshej kartinu ada, vse Zahlestnula rashodivshaiasia ot cilindra raskalennaia volna plazmy, i Predsmertnye vopli smolkli. Vernutsia dlia revansha on smozhet teper tolko pod vecher, i togda Uzh luchshe ozabotitsia nastoiashchim uzhinom. \nTak kak platoj dlia menia iavliaetsia Uzhe samo lechenie. Nu? V chem delo? Kakogo Zla Ia zdes delaiu, v chem smysl tvoego i moego prisutstviia v etom strannom kolodce? Ty hochesh, chtoby ia napomnil tebe o tvoej boli. Bochonka v koridore uzhe ne bylo, no odna iz dalnih Dverej sleva byla raspahnuta, tam on, po-vidimomu, i skrylsia. Sleduj za mnoj. Mozhet, risknut i zaglianut v Mezhkabak? beznadezhno predlozhil ia. Mogushchestvennyj Nkot zarabotal ot Prokolda takoj Smertonosnyj udar, chto ot nego ostalis odni vospominaniia, a bankoschetchik Vyderzhal, perezhiv svoego prezhnego hoziaina. Sredi nih osobo mozhno bylo vydelit Tri sluchaia. Esli zhelaesh, ia mogu Ih vyzvat, no ty ved ne hochesh uvidet ih vseh riadom s soboj? Ia uzhasnulsia, predstaviv sebia v okruzhenii sonma klykastyh fizionomij, Pod pristalnymi vzgliadami soten zvezd-glaz. \nNo Razgovor s toboj menia rastrogal, i ia, naoborot, rasshiriu granicy sfery. Oni byli zelenye i golubye, oni byli zheltye, i sovsem malo bylo krasnyh Gde-to v centre sela, kuda my napravlialis, prisutstvovala strannaia anomaliia. U Celitelia i Nkota ia tozhe Chislilsia v spiske dolzhnikov. So Strazhem bylo pokoncheno, i tam, vperedi, menia zhdal hkasi-teleport. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}