{"category": "spam", "to_address": null, "from_address": "LOTTO SPANISH <joyphillips2@wmail.saigonnet.vn>", "subject": "INTERNATIONAL PROMOTIONS/PRIZE", "body": "INTERNATIONAL PROMOTIONS/PRIZETICKET NUMBER:\n46939894427LOTTO SPANISH. AWARD DEPARTMENTRESULTS FOR CATEGORY\n\"A\" DRAWS  Dear Winner,  We are pleased to inform\nyou of the result of the just concluded annual final draws of the LOTTORIA\nSPANISH. INTERNATIONAL PROMOTIONS/PRIZE. LOTTORIA SPANISH draws was\nconducted from an exclusive list of 25,000,000 e-mail addresses of\nindividual and corporate bodies picked  by an advanced automated random\ncomputer ballot search from the internet as part of our international\npromotions program which we conduct every year. No tickets were\nsold. After this automated computer ballot, your e-mail address\nattached to serial number 25-6565 drew the lucky numbers 6-13-18-24-33-39\nwhich consequently emerged you as one of first fifty (10) lucky winners in\nthis category.You have therefore been approved for a lump sum payout of\n1,000,000.00 (One Million EURO) in cash credited to file LR/19-CH/4310. This\nis from a total cash prize of 10,000,000 (Ten Million) Euro shared amongst\nthe first fifty (10) lucky winners in this category. This year\nLottery Program Jackpot is the largest ever for LOTTORIA SPANISH. The\nestimated 10 million jackpot would be the sixth-biggest in Europe history.\nThe biggest was the 163 million jackpot that went to two winners in a\nFebuary 2000 drawing of The Big Game Mega Millions' predecessor.Your fund is\nnow deposited in an offshore bank with a hardcover insurance. Due to the mix\nup of some numbers and names, we advice that you keep this award from public\nnotice until your claim has been processed and your money remitted to you as\nthis is part of our security protocol to avoid double claiming or\nunwarranted taking advantage of this program by the general\npublic.  NOTE: For easy reference and identification,\nfind below your Reference and Batch  numbers. Remember to quote these\nnumbers in your correspondence with your paying bank.Also give them the\nfollowing informationsNameTelephone numbers and\nfaxAgeAddressOccupationREF Number: \nNM/BC921245/KY14BATCH No: NM/207161/WOP. \nCONGRATULATIONS!!!Your fund is now deposited with the\npaying Bank. To begin your claims, kindly contact the paying bank with\nthe below information: \n***********************************************Contact\nperson:Mr RAUL PETERSInternational Remittance\nOfficer     E-mail: unioncrbnk11@aim.comTel:00\n34 6773 88541 Tel:00 34 6340 92050Fax: 00 31\n847246903\nYour claims agent will assist you in the processing and\nremittance of your prize funds into your designated bank account.Note that\nall prize funds must be claimed not later than One month. After this date\nall funds will be returned to the LOTTERY TREASURY as unclaimed. In order to\navoid unnecessary delays and complications, please endeavor to quote your\nReference and Batch numbers in every correspondence with your agent.\nFurthermore, should there be any change in your address, do inform your\nclaims agent as soon as possible. Congratulations once again\nfrom all our staffs, and  thank you for being part of our promotions\nprogram. Yours Sincerely,Mrs.Joy\nphillips     \n \n------------------------------------------------------\n**This mail was sent by SaigonNet WebMail 1.0\n------------------------------------------------------\n\n"}