{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "\"Don Parris\" <parrisdc@gmail.com>", "subject": "Roaming Wireless & Laptop-NetConf - Etch", "body": "Hi all, I'm running Debian Etch with KDE (no GNOME), with both KWLan and KWifiManager installed.  If this seems a bit confusing, there's a reason.  Also, I'm not afraid to read a good howto/tutorial, if you know a good one.\nI bought an Edimax wifi card with the RALink chip to replace a problematic bcm4318 card.  I got the RALink card working with my wlan at home, but cannot seem to find the wlan at work.  The job provides a completely open wlan - no WEP/WPA, nothing.  Just give it the essid and go.  The wlan is pretty pervasive - I've watched guys walk around the area where I work with their Windows laptops working just fine.  It *should* be simple.  Well, it isn't.  None of the KDE utilities seem to be of any use in getting the card to detect the job's wlan.  In the boot messages, I see a suggestion that I need to define at least one profile in /etc/laptop-netconf.  I also saw references to waproamd failing.  Can you see where I might be just a wee tad confused?\nMy first question:  Should I attempt to remove waproamd, or would my ra0 be depending on that?  The waproamd website has a big notice that WPA-Supplicant has superceded waproamd.  I'm guessing - and only guessing - that my broadcom card was using waproamd, and that I probably no longer need it, but I am not sure on that point.\nI believe my card is currently configured through /etc/network/interfaces.  So my next question is whether I should really bother with laptop-netconf?Moving right along, I looked at /etc/laptop-netconf to see what I can find.\n/ect/laptop-netconf/opts:My wlan card is correctly listed as \"ra0\".  Everything else is commented out.  At the bottom, there is a note that /ect/laptop-netconf/default will be run if no network is found.  Given there is no profile defined, I'd say laptop-netconf is attempting to run, finding no profile, and quitting.  I might be wrong, but I doubt it.\n/ect/laptop-netconf/default:This file wants me to link /etc/network/interfaces & /etc/resolv.conf to the replacement files in /ect/laptop-netconf/.There are script and interface files for home and office.\nAs a final note, I have no way of establishing the channel, as they seem to use different channels, and the admin would have to look up the channel for the area where I work.  But what if I want to work in a different area, using a different channel?  Also, I would have to ask if I need specific info, such as the gateway, etc.\nIf I use laptop-netconf, and configure interfaces.office to use my job's wlan, I assume I would just set the interface as follows:auto ra0iface ra0 inet dhcpand in 'opts', I have no clue how to set the \"Office\" profile.  They're using WAPs all around the building.  I don't have a clue about the hwaddress or any of those settings.\nThanks in advance for any help.don-- D.C. ParrisMinister, Editor, Free Software Advocatehttp://www.linkedin.com/in/dcparris\n"}