{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Pieter Roosens <pieter@roosensdesign.com>", "subject": "Re: [cc-community] Calling all Dutch: Petition to persuade the\n\tDutch music rights collecting society to allow CC licenses", "body": "Thanks for this information, Bjorn.\nThis same problem occurs in the rest of the EU as far as I know.\nHere in Belgium this discussion is also running anyway.\nA discussion conference to be held after summer with interested  \npeople and organisations, is in the planning stage.\nWe will see what comes out. Maybe a petition could be a good idea  \nhere also ... before or after that.\n\nGood luck,\nPieter\n\nOp 8-mei-07, om 10:29 heeft Burobjorn het volgende geschreven:\n\n> Hi everybody,\n>\n> Last week, Ard Boer of dutch independent music label RaRa Records [1]\n> and Lopend Vuur[2] podcast co-host contacted us (Simuze[3]) if we were\n> interested in joining his petition to allow for more flexible  \n> contracts\n> by the Dutch music rights collecting society Buma/Stemra[4].\n>\n> The current situation in the Netherlands is that by becoming a  \n> member of\n> the collecting society you'll have to transfer all your exploitation\n> rights exclusively to them. Any musician or composer that wants to get\n> the money collected in their name has to become a member of this\n> (actually on paper 2 organizations) organization or else they'll never\n> will get this money. This rights collecting society has been  \n> granted the\n> monopoly right to collect rights by the government. Basically this\n> situation stinks and we want to see it changed:\n>\n> We want to see more flexible contracts (= non-exclusive) for  \n> members of\n> the rights collecting society which allows them to choose the  \n> conditions\n> under which to release their own music and for instance use CC  \n> licenses\n> for this.\n>\n> So, off course we joined his effort and thus I'm sending this email to\n> this list. Although there might not be so many dutch folks on this  \n> list,\n> I would like ask the few available to go an sign the petition.\n>\n> For all non-dutch people, it's a Dutch organization and it would be\n> better for this cause to have loads of affected Dutch people sign it\n> instead of loads of non-affected non-Dutch people.\n>\n> Instead we would like to urge you to start your own petitions, in the\n> hope that we can see a change in the contracts used by the rights\n> collecting societies all over the world and that initiatives like  \n> the CC\n> licenses can be used in conjuction with a rights collecting society\n> membership.\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}