{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"George Heath\" <pytconmbaq@conm.de>", "subject": "Be leaner and slimmer by next week", "body": "\nYou'll love the new, non-obese you\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting product for weighty people is now readily available – As shown on CNN.\n\n\nCan you recall all the times when you asked yourself to do anything for being saved from this fastly growing pounds of fat? Fortunately, now no major sacrifice is expected. Thanks to Anatrim, the earth-shaking pound-melting medley, you can get naturally health mode of life and become really slimmer. Just look at what our customers state!\n\n\n\n\"I hate to confess but I was exceedingly addicted to food. \n\n\nI greedily ate all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis suffering finished when I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite abated, \n\n\nspirits increased and I became the happiest person on the planet 22 pounds in 2.8 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nVictoria K., Bellevue WA\n\n\n\n\n\n\"Since my early childhood I was a weighty boy. \n\n\nIt’s difficult to fancy how I abhorred being ridiculed at school. \n\n\n\n\nI abhorred my weight and I detested even myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nIt literally dragged me out of this terrible nightmare! The greatest respect to you, guys.\"\n\n\n\n\n\nSteve Doubt, Las Vegas\n\n\n\n\n\n\"Know what? Anatrim saved my marriage! I fell down into the circle, depression – eating more – more depression. My wife was about to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed at your web site and I asked for pack of Anatrim at the time. \n\n\nThe results I achieved were magnficent, my appetite came to admissible level, I was often in a good mood, and, of course, I went some belt holes back. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nMikkey\n\n\n\n\n There are lots of testimonials left by happy people taking Anatrim. Don’t you wanna join the thousands and thousands of slender women and men and try this original appetite abating energy increasing product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}