{"category": "spam", "to_address": "<mack@speedy.uwaterloo.ca>", "from_address": "\"Mccray\" <tvssj@cashic.com>", "subject": "estrangement spontaneity", "body": "\n\n\n\n\n\n\n\nOkay, it's time to get back to \npolitics.\nHer memory's convenient, On Libby she's lenient. \nBill's claims are specious. Let's replace his court robes with tuxedos.\nWanting right-wing nominees With creds quite \nclearly sound. Store signs must twinkle \"Merry Christmas.\nBill's on a mission: To battle his faux war prime \ntime.\nA Rep From Ohio Quite Dour  By Madeleine Begun Kane \nA Rep from Ohio quite dour Had the nerve to call Murtha a coward.\nMitch Wade was the owner. He's fond of state \npowers.\nHere's what we're gonna do.\nSo  I felt especially honored to be among the ten \nbloggers selected for the inaugural edition. There Once Was A Writer Named Miller  \nBy Madeleine Begun Kane There once was a writer named Miller, Whose war mong'ring \nstories were killers. The Dems were quite riled At her unprovoked bile.\n(I'll update this entry when the show's been posted \nthere. \" You can find my  Traitorgate Song here and my previous media humor \nhere.\nand  is also streamed on the Net.\nAnd after wading through both, my opinion of Judy \nMiller and the New York Times has sunk even lower.\nThey lied us into war.\n\" For more humor on this topic, be sure to read \nWilliam Rivers Pitt's very funny Diary of a Plamegate Junkie. nicknamed \"Duke\" \nClaimed at first, it's a fluke, Duke confessed he the law did evade.\nBill's rarely proper.\nSo free speech rights don't flow To George Dub \naction foes? O'Reilly goes to church? They plundered our great nation's wealth. The \nfacts she ignored.\ncom unless otherwise noted.\nThese evil men must be locked up For all their many \ncrimes.\nI expect this Thursday will be very similar to  \nlast year's Thanksgiving festivities.\nOkay, I'm trying very hard not to get overly \nexcited or optimistic about this.\nThey say she's just a crony,  Who Dub picked cause \nhe is down.\n(I'll update this entry when the show's been posted \nthere.\nYou are the smartest living man. And for late \nrisers (like me) it'll be archived at WFUV.\nIf you'd like to listen to the audio version of \nthis post, just click here. Ode Bob Woodward  By Madeleine Begun Kane Bob Woodward \nhad an ax to grind When Plamegate he critiqued. What they wanted, they didn't \nget.\n"}