{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "Bank Holiday Weekend on BBC Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHAZEL IRVINE ON THE WORLD SNOOKER\nStephen Maguire and John Higgins are embroiled in a fascinating all-Scottish semi-final at the World Snooker Championship.\n\n\nMaguire's career has taken a backward step after he burst onto the scene by winning the UK Championship in 2004.\n\n\nBut he really has lived up to his \"On-fire Maguire\" moniker at the Crucible and is producing some fearsome snooker. \n\n\nHis concentration and determination is so fierce you can almost feel it.\n\n\nHe is a real animal at the table and is so menacing you simply can't take your eyes off him.\n\n\nAnyone who knocks Ronnie O'Sullivan out must be bang in form and that certainly applies to Higgins.\n\n\nHe has arguably come through the toughest section of the draw and is playing fantastically well.\n\n\nI always think it's surprising that he has never added to the solitary world title he won way back in 1998, but perhaps this year we will see him lift the trophy again.\n\n\nThe winner of that tie will take on either former world champion Shaun Murphy or the unheralded Mark Selby.\n\n\nSelby has been nicknamed \"the Hoover\" by my colleagues Steve Davis and John Parrott for his ability to vacuum up every opportunity he gets at the table.\n\n\nHe is also known as \"the Jester from Leicester\" for his sense of humour, but we haven't seen any sign of that from him over the past two weeks.\n\n\nHe has had his game face on, he's got his head down and shown no fear to any of his opponents.\n\n\nMurphy produced one of the greatest comebacks in Crucible history in defeating Matthew Stevens in the quarter-finals.\n\n\nWhen you battle back like he did from 11-5 down to win you feel invincible, so he is going to take some stopping.\n\n\nEnjoy the action,\n\n\nHazel\n\n\nHazel Irvine presents coverage of the World Snooker final from the Crucible in Sheffield on the BBC this weekend. Final sessions Monday 2000-2300 BST.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nWORLD SNOOKER\n bbc.co.uk/snooker\nSaturday\n1000-2300, BBCi and BBC Sport website; 1300-1630, BBC ONE and website; 1630-1725, BBC TWO and website; 1900-2200, BBC TWO and website.\nSunday\n1500-1730, BBC TWO and website; 2000-2300, BBC TWO and website.\nMonday\n1500-1730, BBC TWO and website; 2000-2300, BBC TWO and website.\n\n\n\n\n\n\nFOOTBALL ON THE BBC \n bbc.co.uk/football\nSaturday\nFootball Focus (1210, BBC ONE); Rangers v Celtic (1230, Radio Five Live Sports Extra/online); Man City v Man Utd (1245, Radio Five Live/online); Score (1430, BBCi & BBC Sport website); West Ham v Bolton (1500, Radio Five Live/online); Fulham v Liverpool (1500, Radio Five Live Sports Extra/online); Final Score (1630, BBC ONE); Aston Villa v Sheffield Utd (1715, Radio Five Live/online); Match of the Day (2230, BBC ONE).\nSunday\nMatch of the Day repeat (0930, BBC ONE); Score (1230, BBCi and BBC Sport website); Championship commentary (1300, Radio Five Live/online); Arsenal v Chelsea (1600, Radio Five Live/online); Match of the Day 2 (2220, BBC ONE).\nMonday\nFA Women's Cup final: Arsenal v Charlton (1240, BBC ONE; 1300 Radio Five Live/online); Premiership: Charlton v Tottenham (2000, Radio Five Live/online).\n\n\n\n\n\n\nBADMINTON HORSE TRIALS\n bbc.co.uk/tvandradio\nSaturday\nLive Cross Country (1100-1415, BBCi and website); Live Cross Country and Dressage news (1230-1630, BBC TWO and website).  \nSunday\nLive Show Jumping and highlights (1400-1500, BBC TWO and website).\n\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nRugby union: Premiership play-off semi-final - Leicester v Bristol (1730-1910, BBC Radio Five Live Sports Extra); Rugby League: Wigan v St Helens (1910-2045, Radio Five Live Sports Extra).\nSunday\nBoxing: Oscar de la Hoya v Floyd Mayweather Jr (0300-0400, Radio Five Live); MotoGP - China (0735-0900, BBC ONE); Inside Sport (1230-1315, BBC TWO); Rugby union: Premiership rugby semi-final highlights (1315-1400, BBC TWO); MotoGP repeat (1500-1640, BBCi); Rugby league: Bradford v Leeds (1755-1945, Radio Five Live Sports Extra).\nMonday\nInside Sport (2305-2345, BBC ONE); Super League Show (2235-2305, BBC ONE North and BBC Sport website)..\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tWatch Inside Sport\n Download the best bits of the show\n\t\t\t\t\t\n\t\t\t\t\t\tWin FA Cup final tickets\n Enter Inside Sport's photography competition\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}