{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Adam Riggs <bnjason@gridironprospects.com>", "subject": "The way to become a perfect lover", "body": "\n\nDo you want to save your money and get high-quality pills?\nOrder now!\nU can restore your health right now. Doesn't matter what the problem is - we pills to cure everything. Erection Dysfunction, Weight loss, Anti-Depressant, Antibiotics and even more! Fantastic low prices! \nGo to the site\nThere is no need to have a prescription, just visit our store and buy the pills you want.\nWith best regards,\nAdam Riggs\n \n \nO podobnom mne tolko prihodilos slyshat (peredachi po stereovizoru ne v schet), a teper dovelos uvidet letuna Sobstvennymi glazami. I Ia okazalsia prav, sam togo ne vedaia. Teper Taj smotrela na Zhutkuiu zverinuiu lapu, v kotoroj ne ostalos nichego ot chelovecheskoj ruki, ne v Silah podniat vzgliad i posmotret zasferniku v lico, chtoby proverit, kak teper Vygliadit ono. Zato szadi Nego ubereglis ne vse do sluha donessia udivlennyj vozglas Kvina i negromkie Basovitye rugatelstva Altaresa. \nLuchnik eto. Boius, ia nemnogo zabludilas. Magom on Tozhe byl odarennym. No haski verili v svoe Prorochestvo, a moguchaia vera, kak Podskazyval Vladyke opyt ego bolee chem dlinnoj zhizni, mozhet svernut gory. Tugoj vodianoj iazyk, kovarno vyzvannyj magiej dal-rokta, projdias po nastilu, Unes ves mnogoletnij musor i griaz, s kotoroj ne spravlialas metla, unes i Oblomki dosok. Koridor za dveriu, esli eto mozhno bylo nazvat Koridorom, napominal otverstie, probitoe lazernym luchom v ogromnom kuske Dymchatogo stekla. Tak vot, te zheltolicye lish Blednoe podobie etogo leshuka. Temperatura skachkom podnialas edva li ne vdvoe. \nShor-dok Oshelomlenno smotrit v glaza svoego vraga, v kotoryh ugasaet bessilnaia iarost, Guby dal-rokta kriviatsia, silias chto-to proiznesti, iz obrubka shei tolchkom Vypleskivaetsia krov. Ia Nichego ne oshchutil. Ia prodolzhal stoiat. Ia eshche ne videl cveta Tvoej parshivoj krovi, hald. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}