{"category": "ham", "to_address": "IP-Health <ip-health@lists.essential.org>", "from_address": "Benjamin Krohmal <ben.krohmal@keionline.org>", "subject": "[Ip-health] Forbes on Supreme Court Patent Ruling", "body": "Regarding today's decision in KSR v. Teleflex:\n\n\n\n\n\n\n\nFull story:\nhttp://www.forbes.com/feeds/ap/2007/04/30/ap3669575.html\nAssociated Press\nCourt Cases Threaten Weaker Patents\nBy CHRISTOPHER S. RUGABER 04.30.07, 4:25 PM ET\n\nThe Supreme Court on Monday delivered two decisions that experts say\nweaken the value of patents, fueling criticism that technological\ninnovation, particularly in the biotech and pharmaceutical sectors,\ncould be hindered.\n\nIn the more important of the two cases, the court made it simpler for\ncompanies to challenge patents on the grounds that they cover\nproducts that are obvious combinations of existing technologies.\nUnder U.S. law, an invention must be new, useful and not obvious in\norder to merit a patent. The case involved Canada-based KSR\nInternational Inc. and Teleflex Inc., based in Limerick, Penn.\n\nIn the second case, the court curtailed the reach of U.S. patent laws\noverseas, ruling in favor of Microsoft Corp. in its dispute with AT&T\nInc. over Microsoft's sale of Windows software outside the United\nStates that allegedly infringed AT&T's patents. The decision will\nlikely reduce damage awards in patent cases by excluding patent\ninfringement overseas from consideration.\n\nBoston University law professor Dennis Crouch wrote on a popular\nSupreme Court blog, Scotusblog, that \"because of KSR, patents will be\nmore difficult to enforce and easier to invalidate.\"\n\n\"The AT&T case,\" he added, \"cuts in half the value of many of today's\nmost valuable software patents.\"\n\nThe Supreme Court's recent interest in patent law - it has taken up a\nhalf-dozen cases in the field in the past two years, an unusually\nlarge number - reflects the greater role patents play in the U.S.\neconomy, as companies earn more revenue from licensing patents and\npatent litigation has increased by 50 percent in the last ten years.\n\nIBM Corp., which regularly tops the annual list of top U.S. patent\nrecipients, receives approximately $900 million in revenue from\nlicensing its patents and other intellectual property to other\ncompanies. David Kappos, assistant general counsel at IBM, said that\nfigure is an increase from the \"low millions\" in the early 1990s.\n\nMicrosoft is a big winner in the two decisions today. The court's\nruling in the AT&T case throws out the use of worldwide product sales\nas a basis for calculating damages in patent infringement suits, a\nformula that has resulted in large judgments against the company in\nother cases.\n\nA jury hit Microsoft with $1.52 billion in damages earlier this year\nin a suit filed by Alcatel-Lucent, and a separate jury awarded Eolas\nTechnologies Inc. and the University of California $521 million in\ndamages from Microsoft. Both damage awards were calculated based on\nworldwide sales of Windows software.\n\nIn addition, Microsoft and many other high-tech companies, including\nCisco Systems Inc. and Intel Corp., had filed friend of the court\nbriefs in the KSR case, urging the court to ease the standard for\ndemonstrating that a new product is obvious. The court largely\ndecided as the companies had urged.\n\nThe companies wanted a more flexible \"obviousness\" standard that\nwould make it easier for patent examiners to reject applications for\ntrivial innovations or obvious combinations of existing products.\nSpurious patents have contributed to the recent increase in patent\nlitigation, they argued.\n\nKappos said that the court's decision means, \"if you want a patent,\nyou actually have to invent something.\"\n\nThe biotech and pharmaceutical industries, meanwhile, were on the\nlosing end of the KSR case. Groups from both industries filed friend\nof the court briefs in support of the obviousness test that the court\nruled was applied too narrowly.\n\nHans Sauer, associate general counsel at the Biotech Industry\nOrganization, which represents companies such as Amgen Inc. and\nGilead Sciences Inc., said that a weaker patent regime can make it\nharder for new biotech companies to attract venture capital or other\ninvestment.\n\nThat investment can be crucial when a small firm is seeking millions\nof dollars to bring a new drug to market, he said. The first question\ninvestors will ask, Sauer said in a March interview, is whether the\npatent will stand up in court.\n\nSauer said that the biotech industry has already been negatively\naffected by a decision the court made last year in a case involving\neBay Inc. and a small, Virginia-based company known as MercExchange.\n\nIn that May 2006 case, the court said that if a company has been\nfound to infringe a patent, an injunction barring production of the\ninfringing good should be granted on a case-by-case basis, rather\nthan automatically.\n\nAnd in January 2007, the court said in a dispute between biotech\nfirms MedImmune Inc. and Genentech Inc. that a company can challenge\nthe validity of a patent in court, even if it continues to pay fees\nto license the patent. That could make patent challenges more likely,\npatent experts said, by enabling companies to seek to have a patent\ndeclared invalid without having to take the risk of violating the\npatent, which can result in triple damages if a company loses its case.\n\nBut Kappos argued last week that the eBay and MedImmune decisions\nhave resulted in only modest changes to the patent system.\n\n\"I don't think the Supreme Court has overcorrected,\" Kappos said, or\n\"diminished the value of patents.\"\n\nCopyright 2007 Associated Press. All rights reserved. This material\nmay not be published broadcast, rewritten, or redistributed\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}