{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "Rochelle and Bethea<rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, let the spirit of the Archangels change your life...", "body": "\n\n\n\n\nWish Pillow\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\nMEMO, WAKE UP TO RICHES, PROSPERITY, AND SUCCESS!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Memo,\n    Do you know that magical feeling when you are lying in bed at night, snug under your comforter, and you finally let go of all the day's worries, and simply float away on a cloud of wondrous sleep, to dream of new and exciting possibilities? What if I were to tell you that on June 1st, something would help you to do just that, and you could awaken to brand new incredible opportunities in your life, such as a windfall of money, life-changing luck, and a newfound courage and ambition to do your heart's desire...\n\n\n\n\n\n\nMEMO, WHAT I'M ABOUT TO TELL YOU COULD CHANGE YOUR EXISTENCE -- AS SOON AS JUNE 1ST!\n    I literally cannot type fast enough! As you know, I am always looking for opportunities for you that will help you to tap into the greatness that I know awaits you. Memo, I have found something so truly extraordinary that I knew you would want to hear about it immediately!\n    I know that you already know about the fountain of happiness and good fortune that can be possible with the guidance of your own personal angel spirits. But I have found a way for you to call upon the Archangel Raphael -- he belongs to a very special class of angel who can call on other angels to help you transform your life. I wouldn't have believed it myself, except that I have witnessed these very transformations in friends of mine, and I so want YOU to enjoy this very same abundance, prosperity, and success.\n    Why June 1st?  Because this is the date of a phenomenal Full Moon. You probably know that the highest spiritual energy for success occurs at the Full Moon, and this June moon is an especially powerful and unique time for positive spiritual energy for success.\n    That's why, Memo, it's especially important that you pay close attention to what I'm about to say.\nLET THE SPIRIT OF THE ARCHANGEL RAPHAEL WORK HIS MAGIC FOR YOU...\n    Angel spirits can positively shape your life, and are available to everyone all the time, but only if you are able to access them. And, Memo, I have discovered something that will help you to connect to this angel guidance at this auspicious time of the Full Moon -- it's called The Archangel Wish Pillow Invocation Kit. This enchanting Wish Pillow Kit is a special way to communicate your fondest dreams and desires.\n\n\n\n\n    The most amazing thing about the Wish Pillow is that it is so SIMPLE AND EASY TO USE -- all you have to do is go to sleep and let it work for you!\n    Here's how it works -- your beautiful Wish Pillow is made with 100% silk, with a specially sewn pocket and a picture of the Archangel Raphael on the front. Why silk? Because, Memo, silk is a rich natural fiber which has long been associated with personal transformation and wealth.\n\n\n\n\n\n    Along with this pillow, the Invocation Kit contains 3 Archangel talismans printed on parchment paper representing the 3 most important Angels of Abundance under Raphael -- Omael, Lelahel, and Leuviah. I will also send you 3 magical prayers to help you to invoke these angels. But I'm getting ahead of myself!\n    The most important thing to remember is that angels are celestial beings that exist in the spirit realm, beyond our conscious mind, so it's best to invite their power when we are going to sleep -- the conscious logical mind has to retreat from the stress and strain of the day, in order to communicate with the spirit realm. Only then are you truly open and free to receive guidance and knowledge from the angel spirits. \nWRITE IT DOWN, SAY IT ALOUD, AND GO TO SLEEP.\n\t\t\t\t\t\t\t\tMEMO, IT'S THAT SIMPLE!\n    When you consciously picture something you desire, be it wealth, more joy, or greater success, and when you WRITE IT DOWN AND SAY IT ALOUD, you are tapping into the most powerful means of bringing it into existence -- and getting visible, tangible results.\n    What you'll do is write your wish down on the parchment talisman and say the prayer DIRECTLY BEFORE YOU GO TO SLEEP.  I don't think I can stress enough just how important this is -- as I said, the mind is most receptive to angelic intervention at this time. This is an ancient magical practice that has been proven to work, and I've seen just how powerful this technique has shown itself to be in countless lives.\nON JUNE 1ST, ASK FOR YOUR FONDEST WISHES...\n\t\t\t\t\t\t\t\tTHE ANGELS WILL HEAR YOU AND DELIVER! \n    To bring greater prosperity into your life, you should use the Wish Pillow to invoke Raphael, the Archangel of Abundance and Fortune. Raphael is capable of generating wealth and miracles, and is associated with fire and the capacity to enjoy life to the fullest. He is the guardian of the Tree of Life, which provides an eternal bounty of fruit.\n    Raphael, an Archangel, a higher class of angel, will help you to contact the 3 Angels of Abundunce -- Omael, Lelahel, and Leuviah -- who watch over 3 different aspects of abundance in your life: prosperity, good fortune, and success. Each Angel has his own special ancient talisman, which is the way you can invoke their spirits directly.\n    These mystical talismans contain the names of the Angels in both Hebrew and magical \"fire letters\", so-called for their special power of being visible both to the physical and astral planes of existence. Hebrew is the ancient language which appeared for the first time in the 10 commandments. Add to this the inscription of the fire letters, the alphabet of angels, and you basically have a direct line to the ears of the angels... \nThe Angel Omael -- Angel of Prosperity \n\n\n\n    Direct your wish to the Angel Omael when you need blessings of material needs, for he will help to bring you the richness of your innermost desires. This Angel can also provide the strength that you need to banish any negative influences you may have, and bring positive love and fortune in its place.\n\n\n\n\nThe Angel Lelahel -- Angel of Good Fortune\n\n\n\n    When you are in need of luck, the Angel Lelahel is the perfect angel to direct your wish to -- this angel's lucky influence will help you in any endeavor. Lelahel brings harmony and beauty to life, and will help you to experience the true joy of living to the absolute fullest.\n\n\n\n\nThe Angel Leuviah -- Angel of Success\n\n\n\n    The Angel Leuviah is helpful for when you want to turn your dreams into reality, and will help you overcome any obstacles that might stand in your way to achieving stunning successes in all your ventures.\n\t\t\t\t\t\t\t\t\t\t    Once you have written each wish, read it aloud, along with the special prayer to the particular angel you are invoking, and then place the wish in the pocket of your Wish Pillow, contemplating it as you fall asleep on the cloud of the angels' beneficent and enchanted good will.\n\n\n\n\n\nSPECIAL ARCHANGEL RAPHAEL MEDALLION --\n\t\t\t\t\t\t\t\tMY FREE GIFT TO YOU!\n\n\n\n    I am so eager for you to experience the benefits of the Archangel Wish Pillow Invocation Kit that I am including a FREE gift just for you, Memo -- this exquisite Archangel Raphael Medallion! Carry it with you so that it works its powerful magic for you all through the day.\n\t\t\t\t\t\t\t\t\t\t    This magical combination of elements -- the pillow, the 3 Angels of Abundance talismans, the 3 Angel prayers -- along with the Archangel Raphael Medallion, all come together to give you the most potent spiritual advantage I have yet to see! You can harness this magical power on June 1st, the date of the  Full Moon, the most supernatural time of the year! And this is why I couldn't wait to tell you about the Wish Pillow, so that I can pass this supreme opportunity for more wealth, good fortune, and success than you ever dreamed possible!\n\n\n\n\n\n\n    Don't waste another minute without this powerful tool -- who'd have thought that all you have to do is go to sleep to have all your dreams come true!\nREMEMBER, JUNE 1ST IS YOUR DATE WITH GOOD FORTUNE\n    To make it as easy as possible to use the Archangel Wish Pillow Invocation Kit on June 1st, you can review and use it FREE and without committing to anything. Then, only if you are completely satisfied, after 30 days you will be billed at the exclusive price of only $19.95!\n    Naturally, this comes with a Lifetime Guarantee, which means that should you ever at any time feel that you are dissatisfied with the Wish Pillow, you can return it to me, be it a week, a month, or even 10 years from now, with no explanation necessary, and receive a FULL REFUND, which includes the shipping and handling fee. Of course, the Archangel Raphael Medallion is yours to keep, no matter what.\nYOU HAVE NOTHING TO LOSE, MEMO!\n    I am so confident that by using the Archangel Wish Pillow Invocation Kit, all your treasured wishes will be realized. I have written you a letter which explains exactly how to use the Kit to your utmost advantage. As June 1st will be here before you know it, I beg you not to delay in clicking the button, Memo! I don't think I'm exaggerating when I say that this could change your life in ways you can't even imagine right now.\n    Your friend,\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    Bethea\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf you no longer wish to receive any emails from me, you may press on the visit here link. But by doing this, Memo, it means that I will not be able to give you important updates on astrological events and how they'll affect you. To follow good Internet etiquette, once you've asked to be deleted from one kind of email from me, I'm required to stop contacting you completely. So, Memo, if you wish to no longer receive any emails from me, simply visit here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400.\n\n\n\n\n\n\n"}