{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "MJ Ray <mjr@phonecoop.coop>", "subject": "Re: DPL's view of debian-legal (was: Debian Trademarks Summary)", "body": "Anthony Towns  wrote:\n> On Wed, Jun 27, 2007 at 05:38:20PM +0100, Anthony Towns wrote:\n> > On Wed, Jun 27, 2007 at 09:59:50AM +0100, MJ Ray wrote:\n> > > I think the Anthony Towns DPLship was not a fun time for those trying\n> > > to fix legal bugs and it should have been ended sooner.\n> \n> You know, beyond the initial offensiveness, this is actually a pretty\n> remarkable statement.\n> \n> In 2006, we had:\n> \t- a resolution on the DFSG-free status of the GFDL\n\nwhich pulled a decision out of thin air, ignoring problems = not fun.\nIn any case, wasn't that before the 2006-7 DPL term?\n\n> \t- a resolution of the licensing problems preventing us from\n> \t  distributing Java at all, including, eventually, legal advice\n> \t  via SPI to that effect\n\nI think this is about Java-in-non-free?  Non-free is not fun IMO and\nthat happened as a fire-first, ignore policy about asking on debian-legal\nand get legal advice later, which is also not fun.\n\n> \t- DFSG-free updates to creative commons licenses\n\nwhere CC decided to tell us what debian believes.  Not fun, but when the\nDPL shows such contempt, why wouldn't CC?\n\n> \t- new draft of the GFDL resolving Debian's other concerns\n\nA draft does not fix bugs.  Maybe it will do when released.  FSF missed\nvarious due dates, but DPL was curiously silent.  Not fun.\n\nThat draft is still in the terrible FSF Web-2.Null comments system,\nwhich is also not fun.\n\n> \t- a resolution on how we approach sourceless firmware\n\nwhere we agreed to ignore some bugs, didn't we?  Necessary, but\nnot fun for most people.\n\n> \t- Java licensed under the GPL\n\nAnnounced and praised, but not done in 2006.  Not fun.\n\n> \t- a recommendation to SPI on a free copyright license and\n> \t  more free trademark handling for our logos that's since been\n> \t  acted on, and is now just pending an announcement by the DPL\n\nStill pending.  Still not fun.\n\n> All of those have been causing problems for Debian users for years; if\n> you don't find getting actual solutions to those sorts of legal issues\n> \"fun\", maybe you're in the wrong business.\n\n*Actual* solutions instead of the above mix of pending, announced, draft\npossible/maybe *future* solutions might have been fun.  If anyone found\nthe above events fun, that's disappointing if not surprising.  If a DPL\nthinks all of the above were actual solutions, they're definitely in\nthe wrong business!\n\nHope that explains,\n-- \nMJR/slef\nMy Opinion Only: see http://people.debian.org/~mjr/\nPlease follow http://www.uk.debian.org/MailingLists/#codeofconduct\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}