{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for July 9th - July 15th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nNew Moon, July 14, 8:05 AM EST\n\n\n\n\n\n\n\n\n\n\n\nDear Memo,\n\n    In need of a little pick-me-up?  Well, how about some sunshine?  Actually, I'm not referring to soaking up a few rays outside.  I think most of us by now are aware of the skin damage that can be done by unprotected exposure to the sun's rays.  But using the idea of the sun in a visualization can be a great energizing exercise.  This works on a physical level, as well as mentally and emotionally.  It acts like a natural raising of your body's energy level.\n    Here's what you'd do.  Find somewhere comfortable to sit.  Close your eyes and take in some long, deep breaths.  Then imagine the sun, like a small whirling golden globe of heat and light, directly above your head.  As you breathe in, imagine you are breathing in this golden light.\n    Imagine it filling your head and feel its warmth, as it travels from your head, down through your throat, relaxing your muscles as it goes and filling all the cells of your body with light.  Breathe deeply and sense it moving on down through your arms to the tips of your fingers and then back up to your shoulders.\n    Then, follow it as it travels through your chest, bringing its light and warmth.  Feel this golden energy traveling through your abdomen and hips and down through your legs to your toes.  Then let it travel back up again, through your legs, hips and abdomen, your chest, arms, and then back again up your throat into your head.\n    You can keep this light moving up and down through your body as long as you wish, until you start feeling refreshed and energized again.  When you are ready, allow the light to pass through your head and surround your entire body.  Enjoy the feeling, then slowly open your eyes.\n    So, Memo, as the old song goes, \"let the sun shine in\" and boost your energy!\n\n                        Until next week,                            \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n\n                 \n\n\n    Venus takes precedence this week as it makes a superb connection to Pluto at the start of the week and enters fastidious Virgo on the14th.  You can get very close to your loved one on Monday and Tuesday, Memo, and may want to make a generous gesture at the weekend.  Mercury finally turns around on Monday and you can confidently go ahead with contracts and decisions that may have been on hold.  Friday the 13th is an ideal day for sharing confidences and the New Moon in Cancer on the 14th will make the weekend great for family get-togethers.\n\n\n\n\n\nMemo               July 9 - July 15               \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Monday is going to be your lucky day for this period.  And your Lucky Numbers are 10, 13, 21, 16, 34, 46.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJuly 9th for Memo\n\n\n\n\n\n\n\n\n\n\n    Group discussions are apt to favor intellectual subjects today.  Folks you know may be in the mood for deep analysis.  You are apt to get right in there with them, because your opinion matters.\n\n\n\n\n\n\n\n    If you or a friend are feeling any emotional tension today, perhaps exercise, a long walk or a stint in the great outdoors would help to relieve pressure.  Find more enjoyment in living now, dear one.\n\n\n\n\n\n\n\n\n\n\n\n\n    Striking up a friendship with an unusual person feels delightfully refreshing.  This character could introduce you to an art form that's most interesting.  Keep widening your horizons.\n\n\n\n\n\n\n\n\n\n\n\n\nJuly 10th for Memo\n \n \n \n \n \n \n \n    If you encounter of group of folks who seem a bit strange, don't be alarmed, dear one.  You are apt to be feeling more conservative than usual, and might be struck by others' eccentricities right now.\n\n\n \n \n\n \n \n    You could become obsessed with some new technology today.  You might talk on a cell phone or spend much of the day tinkering with a computer.  The Internet can prove particularly interesting to you.\n\n\n  \n \n \n    Group activities are favored today.  Shake hands with strangers and introduce yourself if you don't know anyone.  You never can tell who will share the same feelings as you, my friend.\n\n \n \n\n \n \n\n\n\n\n    Where an important friendship is concerned, remember that today's denial could bring tomorrow's acceptance.  Nothing is lost, but rather you could be in the middle of a transformation.  Ride the tide, dear.\n \n \n\n \n \n\n\n    Meeting the challenges presented by friends or authorities today, could be the springboard to achieving a special dream in the future. Be flexible in your approach to domestic and work requirements now.\n \n  \n\n\n\n\n\n\n\n\nJuly 11th for Memo\n\n \n \n \n \n \n \n    You are likely to be extra charming today, especially in group situations.  You can be the life of the party, even if you're just out to lunch with a group of friends.  Enjoy it, my dear.\n\n\n \n\n\n \n \n    Do you feel a good friend or business acquaintance is too dependent on you for everything?  This is a time for breaking free and finding your own mode for self-expression.  Avoid procrastination and avoidance.\n\n\n \n\n \n \n    A friend's sudden decision could take you by surprise.  Neither encourage nor discourage this move.  Chances are they'll change their mind within a day or two.  Remain patient.\n\n \n \n\n\n\n\n\n\n\n\n\nJuly 12th for Memo\n  \n \n\n\n\n \n \n    A group of friends can provide the comfort and intellectual stimulation you seek today, so go ahead and join them for an outing, or just spend some time in someone's home.  It should be fun.\n\n\n \n\n \n \n    Your dreams and hopes are fervent, and your sensitive soul is likely to need someone to lend an ear today.  Enlist a loved one to come over and listen to the deepest songs of your kind heart.\n\n \n\n \n \n\n\n\n\n    Although you may want to keep your opinions to yourself today, others will appreciate it more if you say what's on your mind.  You have nothing to hide,B516 so share your thoughts, my friend.\n  \n\n \n \n\n\n    You can put the finishing touches on some long awaited project. People will express their admiration at your skill and aesthetic sense.  Don't let all that praise give you a big head.\n  \n\n \n\n\n\n    Your head can get crowded with thoughts about your security and future.  You really have nothing to worry about, though there's nothing wrong with wanting to be sure.\n \n\n\n\n\n\n\n\nJuly 13th for Memo\n  \n \n \n \n \n \n    Passion is the keyword of the day.  Your inner self is likely to be in tune with your more practical needs, and your spiritual side can benefit.  Don't be afraid to penetrate to very center of things.\n\n\n \n\n \n \n    Trips to visit loved ones who are ill or confined in some way could become a family affair today, my dear.  Your sense of home and family unity may become the focus of your energies and thoughts now.\n\n\n\n\n\n\n\n\n\n\nJuly 14th for Memo\n  \n \n \n \n \n \n    Your intuition is simply sparkling today.  You may find that you are ready to explore the deepest reaches of your soul.  Someone in your life can help you with this endeavor, so ask him or her for advice.\n\n\n \n \n\n \n \n    You have some powerful hidden talents, and you can access them today if you focus on your inner self.  Have compassion for yourself, take some time to meditate, and you should figure it all out.\n\n\n \n \n\n \n \n    Keeping a secret could be too much strain on you.  You'll feel much better when you share this information with a trusted friend.  It's not healthy to bottle up your emotions.\n\n \n\n\n \n \n \n\n\n\n\n\n\n\nJuly 15th for Memo\n \n \n \n \n \n\n \n \n    You are simply the star today, my dear.  Your personality is so charming that you attract the attention of everyone you encounter. You are like a magnet for interesting people right now.\n\n\n  \n\n \n \n    Your usual group of friends will come to you today, maybe one at a time or maybe en masse - regardless of their technique, the point will be this: They'll want you to take over.\n\n \n\n \n\n\n\n\n\n\n\n\n    Warm feelings and diplomatic expressions are on the agenda for next week, Memo.\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}