{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: A computer issue, how should I deal with this? Best solution?", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nHi Glen,\n\nOn Sun, Jun 24, 2007 at 08:45:08PM -0500, Glenn Ervin wrote:\n> Keep in mind that the file system manages the mechanics of a drive, \n\nNo, the file system doesn't manage the mechanics of the drive. The\nmechanics of the drive is actually managed by the drive firmware,\nwhich in turn communicates with the ide/scsi/sata/whatever interface\nbios, which in turn communicates with the os, and so on. Let's take an\nanalog cassette tape for example, which is similar to the hard drive in\nthat it also stores data magnetically on a medium, and that the medium\nmoves past a head for reading/writing. To say that the file system\ncontrols the mechanics of a drive is to say that the data on a tape\ncontrols how fast or slow the tape rolls, or how the head comes in\ncontact with the tape. This is obviously not true, since the tape\nrolls at the same rate, regardless of what is recorded on it, and the\nhead coming in contact with the tape is also not controlled by the\nrecording, since the head is in contact with the tape when you press\nplay, and the head loses contact with the tape when you press stop, or\nthe tape player shuts off automatically.\n\n> thus the \n> file system does have an effect on the success of a drive, as does other \n> factors, like how fragmented your data is on the drive, as if your data is \n> very fragmented, the drive will have to work much harder.  This is just one \n> of the ways that the file system, and manner in which data is stored can \n> effect the life expectancy of a drive.\n\nYes, it's true that a file system with lots of fragmented files on the\ndrive could make the drive work more, as it goes through its platters\nlooking for scattered bits of files. However, both fat32 and ntfs can\nhave fragmented files, and I haven't heard of anything stating that\nntfs is more prone to fragmentation than fat32, or vise versa. In\nfact, back when I was running win98 with the fat32 file system, I\nwould defragment my c drive once a week. These defragmenting sessions\nnever completed quickly, lasting 1 hour or more, and the drive wasn't\nvery full. \n\nOn the other hand, I now have an ntfs drive partition with windows xp\non it, which is also not very full, and I check it for fragmentation\nonce a week, and so far, windows tells me I don't need to defragment\nthis drive. Granted, this may be due to the winxp defragmentation\nprogram, vs the win98 defragmentation program, (I don't know if I'd\nsee the same behavior when defragmenting a fat32 partition under winxp\nas with ntfs). The point being, that fragmentation level doesn't\ndepend on the file system as far as I know. Thus, we can't reasonably\nsay that a ntfs-formatted drive is more fragmented than a\nfat32-formatted drive, (thus shortening the drive's life expectancy), and vise versa.\n\nGreg\n\n\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGfzqi7s9z/XlyUyARAkCSAJ9LepmtPUtwroidQQvfHxlrqqVqkACg3BlU\nux7t9HvnvWlUlzyDm5191ZU=\n=A6de\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}