{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"4 inkjets\" <qfie84ezw@presssuch.com>", "subject": "Hurry - Ink and Toner Sale Ends Soon ", "body": "Quality Ink Supplies For Less at 4inkjets\n\nSave Money Off Our Already Low Prices!\n\n\nAct now for a special discount offer.\nCoupon - (Not case Sensitive)\n\n**********************************************************\nCode - INK722XG\n15% Off All Compatible Ink\n10% Off All Other Products (excludes OEM Ink)\nThis coupon is not applicable to OEM products and is only valid for purchases placed online.\n==========================================================\nClicking on this link will automatically add the coupon code to your checkout cart.\n\n\nhttp://untiommielost.com/t/qfie84ezw/534845\n\n\n4inkjets has a large selection of OEM and Compatible ink and Toner Products.\n\nAll our products our backed by a One Year - 100% Guaranty!\n\nSpecial Deals on:\n- Inkjet Cartridges for Epson, Canon, Lexmark, HP, Sharp, Brother, Xerox, more...\n- Laser Toner Cartridges\n- InkTec Refill Kits\n- Inkjet Paper\n\nFree U.S. Shipping on orders over 50.00. Priority Mail Available.\n\nSame day shipping and the highest quality printer supplies!\n\nWhy shop anywhere else?\n\n\nhttp://untiommielost.com/t/qfie84ezw/534845\n\n\nTo be removed from all future emails for 4inkjets and LD Products please click here :\n\nhttp://untiommielost.com/t/qfie84ezw/534846\n\nPlease be aware that it may take up to 10 days for your email address to be removed. You can also send a letter to: \nLD Products 2500 Grand Ave, \nLong Beach, \nCA 90815. \n\nIf after 10 business days from unsubscribing as above you are still receiving email from us, \nplease let us know by contacting manager1567@4inkjetsmailer.com.\n\n\nHi Subscriber! You are receiving this solicitation because cruiseca@speedy.uwaterloo.ca previously agreed to receive correspondence from Splash Tree. If this service should fail to meet your expectations, feel free to disassociate yourself from our service.\nhttp://untiommielost.com/u/17c5/cruiseca%40speedy.uwaterloo.ca/2\n\nShould you want to contact us via the United States Postal Service, our address is as follows: 333 Mamaroneck Avenue Suite 193 White Plains, NY 10605\n\n\n"}