{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Terry Klarich <terry@klarich.net>", "subject": "Re: OT: Directory Services and linux ", "body": "LDAP is not something you can setup in a few minutes.  And, it might be over kill for you.  However, there is no other real options\nwhich are secure.  In my case, I built an ldap solution for my employer; so, have been through the learning curve.  I use it for my\nhome network.  It consists of 4 unix and 3 windows machines.  I wanted to have a single password for all authentication processes.\nSo far, all unix accounts, samba and web access share the same password.  Put on your climbing equipment because the learning curve\nis straight up.\n\nIf you go to http://tldp.org/HOWTO/LDAP-HOWTO/ you can find a step by step approach to install ldap.  I'd be willing to assist if I\ncan.\n\nTerry\nOn Tue, 5 Jun 2007 12:36:58 -0700you write:\n>Is there some good documentation on LDAP? When I looked at the\n>documentation that came with openldap, I got lost in the weeds,\n>overwelmed and my head was swimming.  For whatever reason, it just\n>looked like complete over-kill to me.  I really don't have a good\n>grasp on what LDAP can do for me.  I originally thought it was a\n>litteral directory server like for mail and address books; that was\n>probably my first mistake.:)\n>\n>On Thu, May 31, 2007 at 12:40:53PM -0500, Terry Klarich wrote:\n>> You want to look at openldap.  I am running it here on my personal network.  Id's are shared among all my machines, samba accoun\n>ts\n>> and html accounts.  Works well.\n>> \n>> Terry\n>> On Sun, 27 May 2007 18:55:59 -0400you write:\n>> >Hi,\n>> >\n>> >Have a few  linux machines running here that I'd like to have running a \n>> >directory service to synchronise login information and the like.  I was \n>> >just wondering, what's the best directory service to run these days? I \n>> >had to take an intro to Unix class for school, and that mentioned NIS, \n>> >which I had looked into in the past...though I just read the ORielly \n>> >book on that and it seemed to say that NIS should only be used until \n>> >newer alternatives became stable, and the book was about 5 years old.  \n>> >Being able to interoperate with windows hosts would be nice also, though \n>> >I'm not holding my breath...\n>> >Any help would be apreciated.\n>> >\n>> >-- \n>> >quit   When the quit statement is read, the  bc  processor\n>> >       is  terminated, regardless of where the quit state-\n>> >       ment is found.  For example, \"if  (0  ==  1)  quit\"\n>> >       will cause bc to terminate.\n>> >\t-- seen in the manpage for \"bc\". Note the \"if\" statement's logic\n>> >\n>> >_______________________________________________\n>> >Speakup mailing list\n>> >Speakup@braille.uwo.ca\n>> >http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>> >\n>> \n>> _______________________________________________\n>> Speakup mailing list\n>> Speakup@braille.uwo.ca\n>> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n>-- \n>HolmesGrown Solutions\n>The best solutions for the best price!\n>http://holmesgrown.ld.net/\n>\n>_______________________________________________\n>Speakup mailing list\n>Speakup@braille.uwo.ca\n>http://speech.braille.uwo.ca/mailman/listinfo/speakup\n>\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}