{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "4p 6/10 Update: Atlantis docks with space station", "body": "\n\n\n\n\n4p 6/10 Update: Atlantis docks with space station\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 34\nPosted: 3:50 PM, 6/10/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-31 (06/09/07): MMT reviews initial inspection results\n   SR-32 (06/10/07): Shuttle Atlantis closes in on space station\n   SR-33 (06/10/07): Shuttle begins final rendezvous phase\n   SR-34 (06/10/07): Atlantis docks with space station\n\n=================================\n\n3:50 PM, 6/10/07, Update: Atlantis docks with space station\n\nCommander Rick Sturckow guided the shuttle Atlantis to a picture-perfect docking with the international space station today after a dramatic end-over-end flip across the heart of South America to let the station crew photograph the shuttle's fragile heat shield.\n\nUsing a joystick on the shuttle's aft flight deck, Sturckow deftly closed out a trouble-free two-day rendezvous with a gentle docking at 3:36 p.m. as the two spacecraft sailed high above the east coast of Australia northeast of Sydney.\n\n\"ISS and Houston, from Atlantis. Capture confirmed,\" a shuttle astronaut radioed as the docking systems engaged. A few minutes later, hooks and latches were activated to firmly pull the two spacecraft together. After leak checks to make sure the interface is airtight, hatches will be opened and the station crew will welcome their shuttle colleagues aboard.\n\nRunning three months late because of hail damage to the shuttle's external fuel tank, Atlantis brought two welcome additions to the international lab complex: A $367 million set of solar panels and a fresh crew member - Clay Anderson - to replace outgoing station flier Sunita Williams.\n\nLaunched to the outpost last December aboard shuttle Discovery, Williams will set a new space endurance record for female astronauts and cosmonauts when she lands aboard Atlantis June 19 after 192 days off planet.\n\n\"Great job today, Atlantis, on the rendezvous,\" astronaut Terry Virts radioed from mission control. \"Very nice approach. And welcome to your new home, Clay.\"\n\n\"Thanks a lot, Houston,\" Sturckow replied.\n\nToday's rendezvous and docking included a now-routine but nonetheless spectacular rotational pitch maneuver, or RPM, a key element in NASA's post-Columbia focus on assessing the health of the orbiter's heat shield before a crew commits to re-entry.\n\nSpectacular video beamed down from the space station showed Atlantis performing a graceful pirouette 600 feet directly below the laboratory, a slow-motion back flip against the backdrop of the Brazilian rain forest racing past 220 miles below.\n\nThere were no obvious signs of anything unusual, but engineers will have to wait for station commander Fyodor Yurchikhin and flight engineer Oleg Kotov to downlink zoomed-in digital photographs to get the clarity needed for a thorough assessment.\n\nAfter completing the pitch maneuver, Sturckow piloted Atlantis in a slow loop up to a point about 300 feet directly in front of the station with the shuttle's nose pointing toward deep space and its open payload bay toward a docking port on the front of the Destiny laboratory module.\n\nFrom there, he flew the shuttle straight in for docking.\n\nOn most flights, rendezvous and docking would be the highlight of a busy day in space. But for Atlantis' crew, docking kicked off an equally busy afternoon of work to pull the 36,000-pound S3/S4 solar array truss segment from the shuttle's cargo bay so it can be handed off to the station's robot arm and safely \"parked\" overnight.\n\nThe massive segment will be attached to the right side of the station's main power truss on Monday just before the start of a spacewalk by Jim Reilly and Danny Olivas to make critical electrical connections and prepare the new arrays for deployment Tuesday. Once extended, the panels will stretch 240 feet from tip to tip.\n\nAn identical set of arrays was attached to the left side of the main power truss last September. The new arrays, and the relocation of a third set of solar panels later this year, are required to generate the power needed to support the long-awaited delivery of European and Japanese research modules late this year and early next.\n\nAtlantis' crew plans spacewalks Monday, Wednesday and Friday to complete the outfitting and activation of the new S3/S4 solar array segment and to perform a variety of other assembly tasks. They also will assist, if necessary, work to retract the P6-2B solar panel so the arrays can be moved to the left end of the power truss later this year.\n\nOne wild card in the crew's flight plan is what, if anything, NASA managers might decide to do about a pulled-up insulation blanket on the upper section of Atlantis' left-side Orbital Maneuvering System rocket pod. Engineers have not yet completed their assessment of the blanket or what techniques spacewalking astronauts might employ to address the problem.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}