{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Brandi Mckenzie\" <pofchoriandtyd@choriand.com>", "subject": "Women will love your new figure", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\nAnatrim – The newest and most exciting lose flesh product is made available now – As were told on CNN\n\n\n\nDo you see redundant body kilos kill a plenty of people for every new year? We know you hate the unsightly appearance of people like those and the social bias against them. \n\nMoreover, you can not resist a siege of ruinous eating habits of yours. If this all sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the new product for the elimination of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you feel no hungry and giving you better cheer. Pay you attention to what people write about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV and eating anything close at hand \n\n\nI became more interested in taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great figure now and lots of men fix their eyes on me!\"\n\n\n\n\n\n\nLinda F., San Diego\n\n\n\n\n\n\n\"I tried some passive weight losing, you know, but with no result. It was rather difficult for me to hold back and not to eat something just at hand. \n\n\nOnce I was told about Anatrim the media by and I rather liked the information.\n\n\n I had tried taking it, and my wife told me that I look very good now, 3 months later. \n\n\n34 pounds off and it is still far to an end! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nSteve Doubt, Las Vegas\n\n\n\n\n\nAnatrim helps you to understand you got no such great need for the constant eating. It improves your spirit, gives you energy, and attacks unnecessary kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more useful information about this excellent product now!\n\n\n\n"}