{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "\"Space Update\" <mailings@mail.cnn.com>", "subject": "Space Update", "body": "\n\n\n\n\nCNN.com - Space Update\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational Edition  |\n\n\n\n\n\nMember Services\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome PageWorldU.S.WeatherBusinessSports\nPolitics\nLaw\nTechnology\nScience & Space\nHealth\n\n\nEntertainment\nTravel\nEducation\nSpecial Reports\nVideo\nAutos\n\n\n\n\n CNN Pipeline\n \nE-mail Newsletters\n \nYour E-mail Alerts\n \nPodcasts \n \nRSS \n \nCNNtoGO\n \nContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFriday, April 13, 2007\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOrangutans monkey around with video games\nThe two Sumatran orangutans at Zoo Atlanta are playing computer games while researchers study the cognitive skills of the orange and brown primates. The orangutans use a touch screen built into a tree-like structure that blend in with their zoo habitat. Visitors watch from a video monitor in front of the exhibit.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMonkey genes offer human lesson\nScientists have unraveled the DNA of another of our primate relatives, this time a monkey named the rhesus macaque -- and the work has far more immediate impact than just to study evolution.\nFULL STORY\n\n\n\n\n\n\nEcuador calls for protecting Galapagos\nPresident Rafael Correa ordered his government ministers to meet urgently to discuss ways of preventing environmental degradation in Ecuador's Galapagos Islands, famous for their unique animal life.\nFULL STORY\n\n\n\n\n\n\nNASA aims for June launch\nNASA will try to launch Atlantis on the first space shuttle mission of the year in early June, almost three months later than originally planned, so that technicians can finish repairing its hail-damaged fuel tank.\nFULL STORY\n\n\n\n\n\n\nT. rex thigh reveals chicken family ties\nTiny bits of protein extracted from a 68-million-year-old dinosaur bone have given scientists the first genetic proof that the mighty Tyrannosaurus rex is a distant cousin to the modern chicken.\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.  To manage your settings click here.\n\nTo unsubscribe from the SPACE UPDATE email list, click here.\n\n\n\n\n\n\n\n\n\n\nInternational Edition\n\n\nLanguages\n---------\nArabic\nGerman\nJapanese\nKorean\nTurkish\n\n\n\nCNN TV\nCNN International\nHeadline News\nTranscripts\nAdvertise with Us\nAbout Us\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.Read our privacy guidelines. Contact us.\n\n\n\n\nAll external sites will open in a new browser.CNN.com does not endorse external sites.\n\n\nAdd RSS Headlines\n\n\n\n"}