{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 16, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESAt Least 31 Killed In Va. Tech Massacre\nGunfire erupted in a dorm and classroom at Virginia Tech, killing at least 31 people and wounding at least 20 others, authorities\n                        said. The suspected gunman used two handguns in the shootings and took his own life, CBS News reports. More...Watch: Gunshots Heard On Campus\n• Flooded Homes, Power Outages On East Coast\n                     \t\t\t\t\t| Watch• Al-Sadr Loyalists Quit Iraqi Cabinet• German Army Video Shows Racist Bronx Jeer\n                     \t\t\t\t\t| WatchU.S.Padilla Judge Limits 9/11 References \nA federal judge ruled that prosecutors can make only narrow references to the Sept. 11 terrorist attacks and cannot suggest\n                        that alleged al Qaeda operative Jose Padilla and two co-defendants were involved. More...\n• University Of Texas Tower Sniper Recalled• At Least 31 Killed In Va. Tech Massacre\n                     \t\t\t\t\t| Watch• Flooded Homes, Power Outages On East Coast\n                     \t\t\t\t\t| Watch• More StoriesWorldAl-Sadr Loyalists Quit Iraqi Cabinet\nSix Iraqi Cabinet members loyal to the radical cleric Muqtada al-Sadr resigned today, to protest the Iraqi leadership's refusal\n                        to set a timetable for the withdrawal of American forces. Meanwhile, 2 U.S. soldiers were killed in Baghdad. More...\n• France Knew Of Hijack Plot Before 9/11• German Army Video Shows Racist Bronx Jeer\n                     \t\t\t\t\t| Watch• World Bank Chief On The Ropes\n                     \t\t\t\t\t| Watch• More StoriesPoliticsBush Presses Democrats On Iraq Bill\nPresident Bush accused congressional Democrats of putting U.S. troops in the middle of the policy debate over funding for\n                        the Iraq war. He again called on Congress to send him a bill that does not set a withdrawal deadline. More...Watch: War Fund Delay 'Unacceptable'\n• Pure Horserace: A Few Fundraising Truths\n                     \t\t\t\t\t| Watch• Hillary Banks Big Bucks For Primary• More Post-Crash Surgery For N.J. Governor• More StoriesHealthThe Curse Of The Night Owl\nA new study indicates they have a tougher time getting through the day than others who lack sleep. Dr. Philip Muskin\n                        explained why and discussed possible remedies on The Early Show. More...Watch: A Night Owl's Nightmare\n• Autism: More Treatable Than Thought?\n                     \t\t\t\t\t| Watch• How Safe Is Imported Food?• No More Diets!\n                     \t\t\t\t\t| Watch• More StoriesSciTechAfghans Fear Phones Spread Deadly Virus\nHealth officials in Afghanistan blamed the Taliban for circulating a rumor that warned cell phones users against answering\n                        calls from \"strange numbers\" that would cause blood to pour from their nose and ears, because of a deadly virus. More...\n• NASA: Mars Probe Doomed By Human Error• China Steps Up Online Porn Busts• Google To Buy DoubleClick For $3.1B Cash• More StoriesBusinessFrom Pro Football To Harvard Yard\nNFL players swap their pads for laptops in the off-season, taking classes at Harvard Business School to prepare for life after\n                        football. Wharton, Northwestern's Kellogg, and Stanford offer similar programs. More...\n• Don't Fritter Away Your Tax Refund• Student Loan Provider Sallie Mae Sold• Dreaded Middle-Class Tax May Be Fixed• More StoriesEntertainmentNude Photos Of Kate Moss To Be Auctioned\nNude photographs of Kate Moss will be sold at an auction in London next month among a series of other pictures of the British\n                        supermodel. More...\n• Madonna And Child Visit Village In Malawi\n                     \t\t\t\t\t| Watch• Regis Says He'll Return To TV April 26• Split With Prince \"Devastated\" Middleton\n                     \t\t\t\t\t| Watch• More StoriesOpinionU.S. Military Dangerously Small\nThe wars in Iraq and Afghanistan have pushed U.S. troops to the breaking point, largely because the military is smaller than\n                        it was a few decades ago. National Review Online warns that without bulking up the military, the U.S. is at dire risk. More...Watch: Troops To Stay Longer\n• Oversight Is Torture For Bush• Muddy Waters Still Run Deep For Gonzales• Andy's Trip To The Auto Show\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Celeb Spot: Split With Prince \"Devastated\" Middleton\nPrince William and longtime girlfriend Kate Middleton have called it quits and rumors abound about why. But royal watcher\n                        Katie Nicholl says that Middleton can stand on her own two feet, even though she is very upset by the breakup. More...Watch: Royal Romance Ends\n• ShowBuzz: People In Hot Water: Spector Words May Hurt Him In Murder Trial\n                     \t\t\t\t\t| Watch• EARLY SHOW: Critics Want Movie Ratings Revamped• EARLY SHOW: The Curse Of The Night Owl\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nGunshots Heard On CampusCBS News RAW: A gunman opened fire on the Virginia Tech campus, killing at least 31 people and wounding many more.\n                                    Student Jamal Albarghouti captured the sound of gunshots on his cell phone.\nTOP VIDEOS\nFirst Look: Va. Tech Shootings\nVa. Tech Students On Shooting\nDozens Killed at Va. Tech\nStorm Drenches East Coast\nBush Pushes For Iraq Funding\nMassacre At Virginia Tech\nGerman Army Clip Called Racist\nWar Fund Delay 'Unacceptable'\nReid: Change Course In Iraq\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}