{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 8, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESU.S.: Fort Dix Plot Aimed At Soldiers\nSix men described by federal prosecutors as \"Islamic militants\" were arrested on charges they plotted to attack the Fort Dix\n                        Army base and \"kill as many soldiers as possible.\" Three of the men were in the U.S. illegaly, authorities said. More...\n• Midwest Braces For Major Flooding• Historic N. Ireland Deal Becomes Reality• Rally Clash Leads To LAPD Shakeup\n                     \t\t\t\t\t| WatchU.S.Search Resumes For Kansas Tornado Victims\nThe death toll from a tornado that nearly obliterated the farming town of Greensburg, Kansas, climbed to nine as cadaver-sniffing\n                        dogs scoured rubble alongside residents who were allowed to return to the rubble of their homes. More...Watch: Recovery Under Way In Kansas\n• U.S.: Fort Dix Plot Aimed At Soldiers• 5 Dead In Navy Helicopter Crash• Rally Clash Leads To LAPD Shakeup\n                     \t\t\t\t\t| Watch• More StoriesWorldHistoric N. Ireland Deal Becomes Reality\nLeaders of Northern Ireland's key Catholic and Protestant parties have been sworn in as ministers in a new power-sharing government,\n                        making reality out of a concept born nine years ago. Officials spoke of a real opportunity for lasting peace. More...\n• Blast Kills 16 In Shiite Holy City\n                     \t\t\t\t\t| Watch• Archaeologist Finds King Herod's Tomb• Rebels: 3 Nigeria Oil Pipelines Destroyed\n                     \t\t\t\t\t| Watch• More StoriesPoliticsAn Exit Strategy For Wolfowitz?\nA deal may be in the works to end Paul D. Wolfowitz's troubled tenure as president of the World Bank. And Washington goes\n                        \"gaga\" over Queen Elizabeth II. Joel Roberts has the highlights of the day's headlines. More...Watch: Royal Wrap-Up\n• A White House Dinner Fit For A Queen\n                     \t\t\t\t\t| Watch• Sen. Lott Joins Republican War Weary• Obama: U.S. Needs More Fuel-Efficient Cars\n                     \t\t\t\t\t| Watch• More StoriesHealthRating The Best Diets\nConsumer Reports surveyed diet plans to find out which was the most effective and easiest to follow. The magazine also talked\n                        to people who have lost a lot of weight, to learn about their strategies. More...Watch: Which Diets Really Work?\n• TV Hurts Kids Of All Ages, Studies Say\n                     \t\t\t\t\t| Watch• \"Cocaine\" Pulled From Shelves Nationwide• Study: Moms Of Autistic Kids Cope Well• More StoriesSciTechArchaeologist Finds King Herod's Tomb\nAn Israeli archaeologist has found the tomb of King Herod, the legendary builder of ancient Jerusalem and the Holy Land, Hebrew\n                        University said. More...\n• Astronomers Spot Biggest Supernova Ever• Obama: U.S. Needs More Fuel-Efficient Cars\n                     \t\t\t\t\t| Watch• Are You A High Tech \"Omnivore\"?• More StoriesBusinessAuto Loan Rates Higher For Blacks\nBlacks have been charged higher auto loan rates than other auto buyers, federal research says. But the gap in loan rates could\n                        narrow, and possibly disappear, as the result of recently concluded lawsuits. More...\n• Gas Prices Keep Climbing\n                     \t\t\t\t\t| Watch• Alcoa Bids For Canadian Aluminum Rival• Dow Jones Bid Puts CNBC On The Defensive• More StoriesEntertainment\"Free Paris Hilton!\" Petition Begs\nA friend of Paris Hilton has created an online petition that asks California Gov. Arnold Schwarzenegger to pardon the heiress\n                        from jail because \"she didn't hurt or kill anyone, and she has learned her lesson.\" More...Watch: Paris' Jail Term: Not 'Simple'\n• George Michael Pleads Guilty• Judge Suspends Hasselhoff's Visitation\n                     \t\t\t\t\t| Watch• Woman Says Phil Spector Turned \"Demonic\"\n                     \t\t\t\t\t| Watch• More StoriesOpinionSarkozy Won't Be Bush's French Poodle\nNicolas Sarkozy has been portrayed as a neo-conservative who would be President Bush's French poodle. But Sarkozy's criticisms\n                        of the U.S. in his acceptance speech signal an honest friendship, says the Nation. More...Watch: France Elects Next President\n• Turning Over A Nouveau Leaf\n                     \t\t\t\t\t| Watch• What War? We Have Sanjaya!• Trying To Make Sense Of The Papers• More StoriesCBS NEWS BROADCASTSThe Early Show: Susan Koeppen: Rating The Best Diets\nConsumer Reports surveyed diet plans to find out which was the most effective and easiest to follow. The magazine also talked\n                        to people who have lost a lot of weight, to learn about their strategies. More...Watch: Which Diets Really Work?\n• EARLY SHOW: TV Hurts Kids Of All Ages, Studies Say\n                     \t\t\t\t\t| Watch• EARLY SHOW: Fabulous Mother's Day Gift Ideas\n                     \t\t\t\t\t| Watch• EARLY SHOW: Best Drugstore Beauty Products\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nTaiwan Lawmakers BrawlA fistfight broke out in the Taiwanese legislature in Taipei during a debate over an electoral reform bill, injuring a female\n                                    legislator. WCBS' Chris Wragge reports.\nTOP VIDEOS\nPaper Publishes After Tornado\nStorm Chaser On Tornado Images\nDennis Haysbert On 'The Unit'\nGift Ideas For Mother's Day\nBest Drugstore Beauty Products\nWitness: Spector Was 'Demonic'\nThe Cult Of Horatio Caine\n'Hot Granny' Tips\nQueen's Hectic Schedule\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesDoes fiery CNN anchor Lou Dobbs consider himself a journalist? Lesley Stahl finds out, Sunday, 7 p.m. ET/PT.48 Hours!\n  Mystery\nPower, Passion And Poison:An ambitious politician meets a suspicious death. Troy Roberts reports, Saturday at 10\n                           p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}