{"category": "ham", "to_address": "Gustavo Franco <stratus@debian.org>", "from_address": "Luis Matos <a26652@alunos.mec.ua.pt>", "subject": "Re: Debian GNU/Linux (kfreebsd anyone?) Lenny Desktop wishlist\n\tthread", "body": "Sex, 2007-04-13 às 11:50 -0300, Gustavo Franco escreveu: \n> On 4/12/07, Luis Matos  wrote:\n> > Qui, 2007-04-12 às 21:17 -0300, Gustavo Franco escreveu:\n> > (...)\n> >\n> > >\n> > > * ltsp: We need to work to make sure that the installer will contain a\n> > > polished ltsp-client-builder udeb and the user will be able to select\n> > > \"desktop environment\" and \"thin(fat, whatever) client server\" and end\n> > > with a system able to provide our desktop environment for these\n> > > clients. This is harder than you think due to dhcp and nfs servers\n> > > lack of preseeding support. Shame on me, since I'm one of the pkg-ltsp\n> > > founders. I'll do my best to prepare patches and send them atached to\n> > > the bug reports.\n> >\n> > Here i have a bigger word to say.\n> > Debian targeted users are mainly companies, or even small business, so,\n> > i think we could provide a set of tasks that coul easilly set up an\n> > enterprise environment with desktops and a main server.\n> \n> We're ok for a lot of use cases here. You can install multiple Debian\n> Desktops and easily setup a dns server and/or web server. New tasks\n> (and its contents in terms of packages) to cover others use cases is\n> appreciated.\n> \n> > In many comanies that use linux, set up a small shared user database and\n> > set up shared folders and info is quite hard.\n> >\n> > We at debian-desktop should provide a task that is oriented for\n> > enterprise desktop. I don't really say that it should be too diferent\n> > from the main desktop task, but have libpam-ldap and other productivity\n> > tools.\n> >\n> > Also a ldap server task should be added to perform the server side.\n> >\n> > I really think debian has a few cards to show in enterprises, so let's\n> > get it better.\n> \n> You're right, but before polish Debian Desktop tasks to be 'Debian\n> Enterprise Server' aware, we need the second at least in the plans. In\n> terms of LDAP authentication, it would be good to add such packages\n> and make sure that the admin can change from regular authentication to\n> authenticate that desktop through LDAP even if the LDAP server is\n> running OpenLDAP or Fedora Directory Server in other distribution. To\n> add this feature we need at least libpam-ldap and a GUI tool to make\n> the switch. Do you have something in mind for the job?\n\nGreat .. we are in sync then.\n\nlibpam-ldap has a pretty nice debconf configuration front end. We just\nneed to say where the ldap server is.\nIt would be good to integrate also some \"directory\" feature such as\nDesktop definitions.\n\n> \n> Talking about the 'shared folders' thing, GNOME has the\n> Places->Network Servers and Places->Connect to Server. Aren't this\n> enough? I'm into a mixed environment and it 'just works', I can see\n> the 'windows network', authenticate and download from their shares.\n> Actually, I think we lack the ability to the user share through samba\n> or webdav (remember that apache is overkill here). AFAIK, KDE is in\n> the same state and Xfce i dunno. Comments?\n\nNO, no, no ...\n\nShared folders are folders that you configure in the desktop (for\nexample) Most companies have a documentation folder that is a share on\nthe network.\nAlso, users have folders where they store settings, documents and other.\nLike $HOME/ is local, but then $HOME/Documents $HOME/server are all\nstored in the main server.\n\nFor this we can use libpam-mount with a few debconf settings.\nSo, sysadmin could set all preseed and install enterpeise desktops on\nthe fly with all set.\n\nAn interesting problem to solve is how to keep users settings (all\nthe .directories).\n\nOne workaround should be /home/user the server share.\nThen have an /home/user/local for local access. This is the opposite of\nis done now.\n\nThis would be a MAJOR advance in installing enterprise environments\nbased in debian (suse only do ldap user configuration).\n\nSo, we could use samba, or nfs (my election network filesystems) to\nload users info from the server And get them their desktop in any\ncomputer in the company.\n\n\n> \n> > >\n> > > * menu system: The Debian menu system needs to be reviewed for both\n> > > GNOME, KDE, Xfce usage and what to do to not break others WMs.\n> > >\n> > > * website and wiki: I need help with wiki articles general cleanup and\n> > > website maintenance. The website needs to contain more general\n> > > information on how to download and use Debian Desktop, Etch\n> > > screenshots (GNOME, KDE and Xfce in action). The wiki should be our\n> > > dashboard and contains our todo, wishlists and some more stuff that\n> > > can be english-only.\n> >\n> > agreed. This weekend i'll submit some.\n> \n> It would be better cleanup first and work on the 'clean room' for\n> adding Lenny related content, IMHO.\n> \n> thanks,\n> -- stratus\n> http://stratusandtheswirl.blogspot.com\n> \n\n\n-- \nTo UNSUBSCRIBE, email to debian-desktop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}