{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "internecine: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\nFind out how to release your inner genius and ace your exams \nin Teresa Bolen's epochal book, MASTER PLAN TO MASTER EXAMS: \nHOW TO DISCOVER YOUR HIDDEN ABILITIES TO CREATE THE SUCCESS YOU DESIRE.\nYou'll get a package of wonderfully empowering F-R-E-E Bonus Gifts\nfrom some of the world's leading success and learning experts --\ntake action NOW.\nRelease Your Inner Genius Abilities Today\nADVERTISEMENT\nWord of the Day for Monday, May 14, 2007\ninternecine \\in-tuhr-NES-een; -NEE-syn; -NEE-sin\\, adjective:\n1. Of or relating to conflict within a nation, an organization, or a group.\n2. Mutually destructive; involving or accompanied by mutual slaughter.\n3. Deadly; destructive; marked by slaughter.\nIt was directed locally and regionally by mid-level party bosses . . . who were likely to be engaged in internecine feuding. -- Michael H. Kater, The Twisted Muse\nThe Mexican government, wracked with internecine struggle and hopelessly in debt, had threatened to nationalize American oil companies. -- Susan Hertog, Anne Morrow Lindbergh: Her Life\nWhile the Seven Years' War resolved none of Europe's internecine conflicts, so far as North America and the British Empire were concerned, this immense conflict changed everything, and by no means only for the better. -- Fred Anderson, Crucible of War\nDuring the months of war and the internecine street fighting, coal and wood supplies ran out and houses went unheated. -- Edmund White, Marcel Proust\nInternecine is from Latin internecinus, from internecare, \"to destroy utterly, to exterminate,\" from inter- + necare, \"to kill,\" from nec-, nex, \"violent death.\"\nDictionary.com Entry and Pronunciation for internecine\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9588986-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}