{"category": "ham", "to_address": "avcooper@flax9.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 7/2/07 - Gasoline Rationing?  Where?", "body": "July 2, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nIran Rations Gasoline\n\nAlternative Energy Will Eventually Not Be \"Alternative\"\n\nMy Favorite Wind Power Stock\n\n-----\n\nLast week I was shocked (and amused) to read that Iran had instituted\ngasoline rationing.  Iran, you see is the second largest exporter of oil\nin OPEC.  It has the world's second largest reserves of natural gas and\nthird largest reserves of oil.  Yet it can't even make enough gasoline to\nmeet the needs of its citizens.\n\nThe problem?  There's a shortage of refineries.  Refineries are very\nexpensive to build and they mess up the environment; the last refinery\nbuilt in the U.S. began operating in 1976.\n\nOf course, since then, the U.S. (at least parts of it) has been working to\nconserve energy by building more fuel-efficient cars.\n\nBut Iran's gasoline use has been growing at about 10% per year (a trend\ndriven in part by government subsidies that keep its gasoline prices among\nthe lowest in the world), and sanctions on the country have made it\ndifficult for Iran to get the foreign input it needs to build new\nrefineries.\n\nSo Iran imports over 40% of its gasoline needs.  But rising prices for\ngasoline globally (you've noticed?) have been squeezing the government,\nand so the surprise solution this week was to ration the stuff.\n\nOf course, rationing wasn't popular in the U.S. in the 1970s, and it's no\nmore popular in Iran today.\n\nSo what's the solution?\n\nFor Iran, the solution, as my father would say, is to shape up.\n\nIn fact, a bill introduced in the House of Representatives last week aims\nto say just that, by increasing the power of sanctions to limit investment\nin Iran by European countries.\n\nOne wrinkle: cash-hungry Asian countries that are less inclined to heed\nthe dictates of the U.S. are stepping up to fill Iran's need as best they\ncan.  In the meantime, Iranian citizens fume.\n\nHow this will end, no one knows, but it should remind us to consider the\nstate of our own energy dependency.\n\n\n\n----- ADVERTISEMENT -----\n\nJoin Cabot Stock of The Month and get in on the next stock that explodes,\nlike these...\n\n   * Broadvision-up 670%\n   * Intuitive Surgical-up 500%\n   * Yahoo-up 317%\n   * Amazon.com-up 1,290%\n   * First Marblehead-up 50%\n   * International Game Technology-up 110%\n   * eResearch Technology-up 180%\n   * NetEase-up 100%\n   * Expedia-up 114%\n   * Broadcom-up 97%\n   * Netflix-up 173%\n   * Psychiatric Solutions-up 85%\n   * PetroKazakhstan-up 86%\n   * Nautilus-up 109%\n\nThat's the beauty of Cabot Stock of the Month. It gives us the opportunity\nto choose the best stock across all sectors, using our proven spectrum\nsystem. Sign up today and you'll get immediate access to all current\nrecommendations, along with the free bonus report, Sector of the Year.\n\nTo learn more, please visit this link:\n\nhttp://cabotmail.net/t/207545/13148861/102/0/\n\n-----\n\nIt's ironic that the world's second largest exporter of oil can't supply\ngasoline for its own people.\n\nAnd on a larger scale, it's ironic that the 21st century, which promised\nto be the digital age, has been colored so much by the trends of\nincreasing demand (and prices) for raw materials!  Steel, copper, oil,\nphosphate, titanium, uranium.  I can name hot stocks in every one of these\ngroups that have had better runs in this century than at any time in my\nlifetime . . .and no one saw it coming.\n\nSo what's next?\n\nWell, I learned long ago that trends, once in effect, tend to last longer\nthan expected, so all I can say is that you should assume this one will\ncontinue.\n\nWe know that China and India are hungry for basic materials, from steel to\noil to coal.\n\nAnd we know the developed world in particular is hungry for alternative\nenergy sources, especially those that don't pollute.   \nToday these are lumped into a vague category called \"Alternative Energy\",\nsuggesting a secondary status, but we're confident that in time,\nbetter-defined subgroups will break out of that fuzzy label and claim\ntheir own identity.\n\nThe solar sector will certainly be one; in recent issues of Cabot Wealth\nAdvisory, I've recommended a number of solar power stocks, both American\nand Chinese, and I still think highly of most of those.  The best three\nwere hitting new price highs last week!\n\nI've discussed uranium, too, and while that sector is not as strong today,\nthe leader in the industry is still worth holding.\n\nBut today I want to talk about wind power.\n\nToday, wind power accounts for less than 1% of global electricity use, but\nit accounts for 20% in Denmark, 9% in Spain and 7% in Germany.\n\nGermany is actually the biggest producer of wind power, and this year the\nU.S. will pass Spain to become the second largest producer.   \nTexas is the leading state in wind energy production, followed by\nCalifornia.  Total U.S. capacity is growing at about 30% per year.\n\nGlobally, the market grew at a 41% rate in 2005 and a 32% rate in 2006. \nLooking forward, 25% per year seems easily sustainable, but predictions\nhave little value here.\n\nWhat does have value is an appreciation of the major forces at work, and\nan ability to read charts.\n\nGrowing demand we understand.  It's driven by high fuel costs, a\nperception that oil may run out, a growing determination to address the\ncauses of global warming, and growing demand for energy independence.\n\nAnd the wind is free, which is pretty cool.  But to capture it you've got\nto use a wind turbine (not a windmill), and that's where the three big\ndrawbacks come from.\n\nFirst are the high upfront costs for wind turbines that are expected to\nrun for two decades or more.  Once they're installed, the wind is free and\noperational costs are minor.  But the investment is a hurdle.\n\nSecond is the fact that regardless of where wind turbines are sited,\nsometimes the wind doesn't blow, which means either energy needs to be\nstored or it needs to be supplemented by other electricity sources.\n\nThird is the fact that connecting to the grid from remote locations is\nexpensive, and wasteful.  It's better to put wind turbines close to the\npoint of need, but few people want them in their backyards!\n\nBut even with these obstacles, the industry is growing fast.\n\nCosts are coming down, driven by both economies of scale and improving\ntechnologies.  And growing public consciousness about global warming and\nenergy independence means people are slowly becoming more acceptable of\nwind turbines in their backyards.\n\nSo, it makes sense that companies in the industry are seeing their stocks\nsoar.\n\nOur favorite is a company called Zoltek, which was owned by Cabot Market\nLetter from 1996 to 1998 for a 68% profit.  And it's a good thing we sold,\nbecause from top to bottom, the stock lost 68% of its value.  But\ninvestors are once again climbing on board, and the stock is strong.\n\nI mentioned this stock in Cabot Wealth Advisory back on April 12, and it's\nup about 20% since then.  And then two weeks ago it had become so strong\nthat it earned a spot in Cabot Top Ten Report.\n\nHere's what editor Mike Cintolo wrote:\n\n\"When oil gets expensive and the specter of global warming sends investors\nscurrying in pursuit of non-fossil energy options, it's good for Zoltek. \nDemand for clean energy has raised global wind generation capacity 10-fold\nsince 1997, and Zoltek is the only large supplier of the industrial grade\ncarbon fiber that has replaced fiberglass in the manufacture of wind\nturbine blades.  The company has come a long way since it acquired a\ncarbon fiber business in 1988, and its transition from a focus on\nhigh-margin high-tech applications (like rocket nozzles for NASA) to a\nstronger, lighter replacement for fiberglass hasn't always gone smoothly. \nProduct quality issues dogged the company in 2006 and the wide-scale use\nof carbon fiber has been slower to develop than anticipated.  But quality\nissues have been tamed, wind power is a huge market, and the oil\nexploration and automotive industries are shaping up as the growth markets\nof the future. A huge long-term carbon fiber agreement with DeWind\nannounced on June 12 is the latest good news for the company.\"\n\nAdding to that, I can see that revenues were up 67% last year (to $92\nmillion), that earnings are expected to grow 208% this year (to $0.77 per\nshare), and that the company's profit margin in the latest quarter was\n14.4%, the best in many years.\n\nAll told, business is good now, and promises to be even better as the\nindustry expands around the globe.\n\n-----\n\nEditor's note:\n\nTo get regular updates on Zoltek, and to get first notice of other hot\nstocks, consider a no-risk trial subscription to Cabot Top Ten Report. \nRemember Titanium Metals, Hansen Natural, Ultra Petroleum and Crocs? \nEvery one of those great, fortune-making stocks appeared in Cabot Top Ten\njust as it was accelerating on its long-term uptrend.  Subscribers to Top\nTen get detailed fundamental and technical analysis, they get buying\nranges, and they get continued follow-ups on all stocks until they need to\nbe sold.\n\nTo get started, simply click the link below.\nhttp://cabotmail.net/t/207545/13148861/81/0/\n\n-----\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=207545&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}