{"category": "ham", "to_address": "Zack Weinberg <zackw@panix.com>", "from_address": "\"Joseph S. Myers\" <joseph@codesourcery.com>", "subject": "Re: GCC's manpage refers to sections that aren't in the manpage", "body": "On Sun, 6 May 2007, Zack Weinberg wrote:\n\n> On 5/6/07, MJ Ray  wrote:\n> > Zack Weinberg  wrote:\n> > > GCC's manpages are mechanically generated from its info files.  We\n> > > asked the FSF how to apply the GFDL and were told that the *entire\n> > > collection of manpages* counted as the Work, so it was okay to put the\n> > > Invariant Sections in separate manpages.  See\n> > > http://gcc.gnu.org/ml/gcc/2001-11/msg00311.html et seq. [...]\n> > \n> > Do the gcc man pages now make it clear that the entire collection of\n> > manuals are the work and say which other man pages contain the Invariant\n> > Sections and the License?\n> \n> I know they contain cross-references to the other man pages, I'm not\n> sure how clear they make it that the entire collection is the work.\n> Joseph Myers is the person to ask; I've cc:ed him.\n\nI followed the advice given in the message referenced above.  I don't \nthink the GFDL addresses how you define the whole work, but I don't see a \nset of manpages as substantially different from a set of HTML files; \nthere, makeinfo puts the @copying information into a comment in each file, \nbut the GFDL text and Invariant Sections themselves don't go in every \nfile.  I presume this conforms to the FSF understanding of the \nrequirements, given Texinfo's NEWS file:\n\n\t*** IMPORTANT NEWS FOR ALL AUTHORS OF TEXINFO MANUALS ***\n\n\tAs of version 4.2, Texinfo has a new command @copying to define the\n\tcopyright and copying permissions for a manual.  It's important to\n\tswitch to using it as soon as possible (as in your next release),\n\tbecause the historical method of doing copyright permissions using\n\t@ifinfo failed to output copyright information in the HTML (or XML)\n\tformats.\n\n> > I dislike the FDL because of all these complexities and stange interactions\n> > when an FDL'd manual accompanies GPL'd software.  GPL the manuals!\n> \n> I entirely agree with you, but the GCC steering committee is of the\n> opinion that there is no chance of persuading RMS to sign off on it.\n> [I do not know whether they ever tried, but I think they're right.\n> Joseph, again, might know more.]\n\nI'd be glad if the FSF would simply move to the GSFDL when it comes out, \nbut I have no hope of that either.  The most I might hope for is getting a \nstatement regarding moving text between manuals and doc strings extracted \nfrom source code.\n\nIf RMS however wishes to get the new invariant section \"Free Software and \nFree Manuals\" (from the last printed edition of the GCC manual) added to \nthe development versions of the GCC manual, he's listed as having Write \nAfter Approval access and can submit a patch for that himself; as I said \nat  I have no \ninterest in merging that particular change.\n\n-- \nJoseph S. Myers\njoseph@codesourcery.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}