{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Graduating at 95 years young...A wonderful story tonight on the CBS EVENING NEWS WITH KATIE COURIC", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n \n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening \n            News | 48 Hours | 60 Minutes | The Saturday Early \n            Show | CBS Sunday \n            Morning | Face The \n            Nation\n\n\n\n\n\n\n(CBS) QUOTE OF THE DAY\n“I had an epiphany a few years ago where I was out at a celebrity \n      party and it suddenly dawned on me that I had yet to meet a celebrity who \n      is as smart and interesting as any of my friends.” - Moby \n\nDID YOU KNOW? Edgar Allan Poe introduced mystery fiction's \n      first fictional detective, Auguste C. Dupin, in his 1841 story, “The \n      Murders in the Rue Morgue.” \n\nLast Updated at 4:50 PM… May 11, 2007 \n\nSATURDAY ON 48 HOURS \n      MYSTERY 9PM/8C Here's a preview from Erin Moriarty \n      about Saturday's 48 Hours Mystery, DEATH OF A \n      DREAM: \"I have never quite believed the \n      theory that \"anyone\" is capable of committing murder. With most killers, \n      you usually detect a problem in their childhood or a personality defect \n      that causes that person to choose to take the ultimate action against \n      another human being. But what would lead a young man with no history of \n      violence to do something so out of character? It is just one of the \n      mysteries that surrounds the murder of 21-year-old Catherine Woods. \n      First, some background: Catherine Woods was a stunning and \n      talented young woman, from my hometown of Columbus, Ohio, who moved to New \n      York with hopes of becoming a dancer and singer on Broadway. As the \n      daughter of the well-known director of the Ohio State University Marching \n      Band, Catherine was used to the spotlight and dreamed of her own name in \n      lights along the Great White Way. But, three years later, on November \n      27th, 2005, she was found stabbed to death in her apartment. Initially, \n      police focused on two suspects, neither of which fits the profile of a \n      killer. They are both young, aspiring musicians with no criminal records. \n      Catherine's murder was exceptionally brutal which makes it all the more \n      difficult to believe that either man could have done it and yet, one was \n      arrested, charged and tried for her murder. In this week's program \n      Death of a Dream, we investigate the evidence and follow the trial \n      that ends with a dramatic and surprising verdict. It is a case that will \n      remind you, as so many of our cases do, how a single, senseless act in a \n      moment of passion, can have drastic consequences for so many.\" - \n      Erin Moriarty 48 Hours Mystery airs Saturday at \n      10pmET/9CT) If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us at: 48hours@cbsnews.com \n\nTONIGHT ON THE CBS \n      EVENING NEWS Here's an early look \n      at what we are working on for tonight's broadcast of the CBS EVENING NEWS \n      from Early Show Anchor, Harry Smith, in for Anchor and Managing Editor \n      Katie Couric who is on assignment... Good afternoon, \n      After a week of floods and fires across the United States, \n      Catalina Island off Los Angeles has become the latest wildfire victim. \n      Throughout the night, thousands of residents and visitors fled the \n      island’s main town under an evacuation order. Bill Whitaker will \n      report on the devastating blaze and citizens’ dramatic nighttime escapes. \n      Meanwhile, Sharyl Attkisson is on Capitol Hill with some \n      exclusive information about what might be the best chance for all sides to \n      work out a last-ditch immigration reform deal. On the state level, \n      legislation is being considered in several states that could affect the \n      lives of teens and the tech-dependent. Sandra Hughes will report \n      that Washington state and New Jersey could both ban text messaging while \n      driving. Considering the statistics – teenagers say text messaging is \n      their biggest driving distraction – more states could follow suit. \n      It is graduation day at Virginia Tech, and today’s ceremonies will \n      be part commencement and part remembrance. Sharyn Alfonsi is on \n      campus and will have the story. There is also a unique graduation \n      story at Fort Hays University in Kansas. For Assignment \n      America, Steve Hartman will introduce \n      you to one woman who took the advice “it’s never too late to follow your \n      dreams.” Now she’s becoming the country’s oldest person to be graduated by \n      a college. Join us tonight for this and more. Harry\nFor more on two of the stories noted above, please click on the \n      following links... Wildfire Continues On SoCal Island\nClick Here Virginia Tech's \n      Bittersweet Graduation Click Here Here's an early look \n      a series we are working on that focuses on marketing machine that is \n      targeting your children. Starting Monday on the CBS Evening NewsFrom \n      books, to toys to clothes to snacks. There's a multi-billion dollar, \n      global marketing machine targeting YOUR children. Our special series, \" \n      GOTTA HAVE IT: THE HARD SELL TO KIDS \" beginning Monday, on the CBS \n      Evening News. THIS WEEKEND ON THE CBS EVENING NEWS: \n      SATURDAY ON THE CBS EVENING NEWS… Thalia Assuras will anchor the Saturday edition of the CBS \n      Evening News in New York. We'll have the latest news, including \n      these stories: VA TECH GRADUATION: Sharyn Alfonsi reports from \n      the commencement exercises at Virginia Tech, the site of last month's \n      shooting spree. POPE IN BRAZIL: Pope Benedict XVI continues \n      his history-making trip to the largest Catholic country in the world. \n      Allen Pizzey reports. STEALTH CANDIDATES PART 1: \n      Many Democrats and Republicans are looking beyond the current field of \n      presidential candidates to two men that may find themselves in the race \n      before the end of the year. In the first of two reports on these so-called \n      \"Stealth Candidates,” Thalia Assuras looks at the momentum building \n      behind former U.S. Senator Fred Thompson. MERCURY 13: The \n      Mercury 7 astronauts are known in history for having \"the right stuff.\" \n      But there's another group of test pilots who played an important role in \n      the early days of NASA. They are the Mercury 13, a group of women that \n      Randall Pinkston reports is finally being recognized for their \n      contribution to the U.S. space program. SWITCH PITCHER: \n      Switch hitters are nothing new to baseball. But a college athlete is \n      throwing the sport a curve by pitching from both sides of the mound. \n      Hari Sreenivasan introduces us to an unusual switch PITCHER. \n      SUNDAY ON THE CBS EVENING NEWS… Russ Mitchell will anchor the Sunday edition of the CBS Evening \n      News in New York. We'll have the latest news, including these \n      stories: STEALTH CANDIDATES PART 2: The second of our reports \n      on \"Stealth Candidates\" looks at the intriguing possibility of Al Gore \n      throwing his hat in the ring. Bill Whitaker reports. \n      FEEDING CHILDREN: On this World Hunger Day, Allen \n      Pizzey reports on efforts to feed the starving in Darfur. A \n      ROSE BLOOMS: Many Americans give their mom a rose for Mother's Day. \n      But some of those roses are from overseas farms that pay workers pennies a \n      day or use potentially hazardous chemicals. Anthony Mason reports \n      on one Central American farmer who insists on doing right by his workers \n      and his flowers -- even if it costs him. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID LETTERMAN Dave chats with \n      actor Charles Grodin AND comedian Jake Johanssen! \n\nTOMORROW ON THE \n      SATURDAY EARLY SHOW Tracy Smith and Chris \n      Wragge of our New York affiliate, WCBS, anchor THE SATURDAY \n      EARLY SHOW from New York. Ira Joe \n      Fisher will bring us the weather. Along \n      with the top news of the day, we will also have the following stories: \n      JAMESTOWN: The first permanent English settlement in North \n      America turns 400 this weekend, and our Russ Mitchell will be there \n      to talk with archaeologist William Kelso. Since uncovering the original \n      Jamestown fort in 1994, Kelso and his team have discovered one million \n      pieces of evidence in the soil, giving Americans a richer understanding of \n      the first successful colony. Kelso will join us with some of the artifacts \n      he’s found so far. HEALTHWATCH – SCREENINGS: There are five \n      essential medical tests everyone should have to help prevent health \n      problems. Dr. Mallika Marshall will tell us about these top five \n      screenings and when it’s necessary to schedule them. TRAVEL \n      GADGETS: From a compact photo printer to a water bottle that doubles \n      as a flashlight, Technology Correspondent Daniel Sieberg will show \n      us all sorts of cool gadgets to make your travels more convenient and more \n      enjoyable. MOTHER’S DAY CHOCOLATES: Jacques Torres knows a \n      thing or two about chocolate. The master pastry chef has won prestigious \n      culinary awards both in France and the U.S. He'll be on our plaza this \n      Mother's Day weekend to show us how to choose the best chocolates, and \n      he’ll even show us how to make chocolate lollipops at home. \n      STAMP OUT HUNGER: Letter carriers all across the U.S. will \n      collect food for the hungry this weekend, picking up donations right from \n      the doorstep of people on their routes. We'll hear about it from William \n      Young of the National Association of Letter Carriers. Eugene \"Killer\" \n      Edgerson of The Harlem Globetrotters will be on hand to drum up support \n      for the food drive, while some of his teammates shoot hoops with our \n      anchors. GAS GRILLS: If you're looking to upgrade your gas \n      grill, you'll find the choices are better than ever, and Consumer \n      Reports has rated this season's best buys. Our resident handyman and \n      host of Today's Homeowner, Danny Lipford, will join us with \n      his top picks for this year. CELEBRITY DISH: This week, we \n      introduce a new feature in which Jill Dobson of Star Magazine \n      brings us up-to-date on the entertainment stories that everyone will be \n      buzzing about. CHEF ON A SHOESTRING: Debra Ponzek is an \n      award-winning chef, cookbook author and mom. She's making what she \n      believes is the IDEAL Mother's Day meal -- a menu she would like her \n      family to serve her for Mother's Day. SECOND CUP CAFE: A \n      longtime favorite in the country-music world, Montgomery Gentry could add \n      more awards to their collection at Tuesday night's Academy of Country \n      Music Awards, which will be broadcast on CBS. We'll hear songs from their \n      latest CD, Some People Change. To look for our fabulous \n      recipes... Click Here If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sat@cbsnews.com \n      \n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY \n      MORNING CHARLES OSGOOD ANCHORS FROM \n      NEW YORK MODEL LIFE: Correspondent Russ Mitchell \n      reports on the changing history of the \"cover girl.\" JOSH \n      GROBAN: Josh Groban's lyrical voice has made him a rising star. He was \n      just 20 when he released his first album of ballads and love songs. Now \n      26, he's sold more than 16 million records with hits like the uplifting \n      \"You Raise Me Up.\" Correspondent Sandra Hughes introduces us to \n      Josh Groban in this Sunday Morning \n      Profile. http://www.joshgroban.com Click Here http://www.repriserecords.com Click \n      Here UNLEASHED!: Bill Berloni has \n      been discovering Broadway stars for thirty years- all at local animal \n      shelters. Martha Teichner explores this veteran dog trainer's \n      casting techniques and how all his star pupils are making their come-back. \n      ART: They were called \"Moving Pictures.\" The earliest films \n      really were more like \"art that moved\" than the plot-based \"movies\" of \n      today. Nancy Mowll Mathews spent 10 years collecting examples that \n      illustrate just how much painters and sculptors influenced early \n      filmmakers--and vice versa. The exhibit she created called Moving \n      Pictures, shows in a very dramatic way, the extraordinary connection \n      between art and early films. \n      http://www.phillipscollection.org/html/exhibits.html Click Here NASCAR MOMS: 40 \n      weeks a year, NASCAR - the National Association of Stock Car Auto Racing - \n      brings its unique brand of traveling circus to a speedway near you. But \n      for all the beer and baseball caps, a NASCAR is a surprisingly \n      female-friendly affair. NASCAR says that in the past three years, the \n      male-dominated circuit has seen a big surge in female fans. Why? Women say \n      they like the drivers, the family-friendly atmosphere...and the \n      ear-shattering sound. Tracy Smith takes us on a lap around NASCAR. \n      WAY OFF THE ROAD: For the past 20 years, Bill Geist \n      has been criss-crossing America for Sunday \n      Morning, searching for the wackiest and most \n      wonderful people, places and things he could find. He's written a new book \n      about his adventures, and Bill's hands-on approach to book-selling turned \n      into quite an adventure in its own right. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sundays@cbsnews.com \n      \n\nSUNDAY ON FACE THE \n      NATION This Sunday on Face the \n      Nation, Bob Schieffer will talk to \n      Senator Chuck Hagel of Nebraska about war and politics. Will Republicans \n      keep supporting President Bush on the war? Will there be a deal on funding \n      for the war? And is he running for President? All questions for Senator \n      Hagel. Then we'll get all the rest of the week's political news from \n      Jeanne Cummings of the Politico.com and Michael Martin of NPR. There will \n      be, as always, a final word. That's all on Face the \n      Nation, this Sunday. \n\nSUNDAY ON 60 \n      MINUTES, 7:00PM/6:00PM CT MITT ROMNEY: The \n      Republican presidential candidate talks to Mike Wallace about \n      campaign issues including the war in Iraq, his Mormon religion and his \n      changing positions on abortion. 6%: Realtors' sacrosanct \n      commission rate of 6 percent may be in jeopardy due to emerging online \n      competition from Internet real estate sellers and buyers. Lesley \n      Stahl reports. ALI: Bob Simon catches up with Iraqi war \n      orphan Ali Abbas, who lost most of his family and his arms to a stray \n      American bomb during the war in Iraq. \n\nMONDAY MORNING ON THE EARLY SHOW Harry Smith, \n      Julie Chen and Russ Mitchell anchor THE EARLY \n      SHOW from New York. Hannah Storm \n      anchors from Las Vegas, NV. Dave Price will bring us the weather. \n      Along with the top news of the day, we will also have the \n      following stories: CARRIE UNDERWOOD: Almost two years \n      ago, aspiring country singer Carrie Underwood battled it out with rocker \n      Bo Bice to see who would be named the fourth American Idol. In the \n      time since, the Oklahoma native has become a true country star. Her debut \n      CD, Some Hearts, went triple platinum, earning her two number one \n      hit singles and a nomination for album of the year in the Academy of \n      Country Music Awards. Carrie will join us live from Las Vegas Monday \n      morning. GOTTA HAVE IT: THE HARD SELL TO KIDS: ALPHA KIDS: \n      We begin a special series on THE EARLY SHOW and continuing on the CBS EVENING NEWS, Gotta Have It: The Hard Sell to Kids. Companies are using \n      a marketing method to make billions of dollars off of you and your \n      children. Are they going too far? Monday morning, we take a look at GIA, \n      the Girls Intelligence Agency, a marketing firm that is using a \n      multi-million dollar strategy aimed at children. Is choosing \n      eight-year-old girls as test subjects a case of viral marketing gone \n      wrong? If one young girl, chosen by the company, likes a product, it \n      follows that she will tell her friends, who will tell their friends, and \n      so on. But what are the dangers of tweens predicting and being influenced \n      by these companies? Monday morning, EARLY SHOW National Correspondent Tracy Smith will take a look in the \n      first part of our special series. IN DR. PHIL'S HOUSE: CHILD \n      STARS: In an age of reality TV and Youtube, it seems that everyone \n      wants to be famous- and if they can't be, then some parents push their \n      children toward stardom. To take a look at this phenomenon, Dr. Phil \n      McGraw is debuting a new series on his talk show Monday called Child \n      Stars. He brings together five families whose mothers want more than \n      anything for their kids to become famous. Dr. Phil will join us Monday \n      morning to get a sneak preview of his look into children and showbiz. \n      SURVIVOR WINNER AND CHECK PRESENTATION: Stranded in Fiji, \n      the competition heats up for the remaining survivors battling it out for \n      the million-dollar prize. In the two-hour two hundredth episode of \n      Survivor, five tribemates battle it out for the title of Soul \n      Survivor. Monday morning, we will present the winner with their \n      million-dollar check live on our plaza! MIRANDA LAMBERT: \n      When it comes to telling it like it is, country singer/songwriter Miranda \n      Lambert certainly has a way with words! Her fiery hot single, \n      Kerosene, from her 2005 debut quickly heated up the charts and now \n      her sophomore project promises much of the same. Her gossipy new song, \n      Famous in a Small Town, has everybody talking and is the first \n      single off her sophomore release, Crazy Ex-Girlfriend, which just \n      entered the charts at number one. Our own Hannah Storm will get \n      Miranda’s take on being famous. BILL GEIST: WAY OFF THE \n      ROAD: For twenty years, Bill Geist has delivered the big news \n      from some of America's smallest towns. And, the Correspondent best known \n      for his reporting for CBS News' Sunday Morning, has often taken us on quite an adventure. From flying with a \n      paperboy pilot, to challenging a watermelon champion speed eater, these \n      exploits and many more are featured in Bill's new book, Way Off The \n      Road: The Peculiar Charms of Small-Town America. Monday morning, Bill \n      will join us for more on his adventures and his latest book. \n      DAVID EVANGELISTA: SUMMER HAIR: For the latest ways to keep \n      cool this summer, it doesn’t matter if your hair is naturally curly or \n      wavy, everyone can achieve sleek, smooth and straight summer hair. Maybe \n      if your hair is straight, the summer has put you in the mood to try \n      something new and different? For all the latest in hair looks, we’ll turn \n      to our stylist to the stars, David Evangelista, Monday morning. \n      KELLI PICKLER: Kelli Pickler's red high heels have taken \n      her all the way to the ACM Awards. This year, the American Idol \n      finalist is up for Top New Female vocalist for her debut album Small \n      Town Girl. Live from Las Vegas, our own Hannah Storm will find \n      out what a year it has been for her. Then, Kelli will dazzle us with what \n      is sure to be an amazing performance! If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n      \n\nTO SUBSCRIBEClick here to subscribe to \n      the Inside Scoop.TO UNSUBSCRIBEUnsubscribe information \n      is included in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, \n      click here.Contact: Email Administrator, \n      CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, \n      10019Help | Advertise | Terms of \n      Service | Privacy \n      Statement©MMVII, CBS \n      Interactive Inc. All Rights Reserved. \n\n"}