{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Joana Ramos <jdr@ramoslink.info>", "subject": "[Ip-health] Fwd: Auxiliary Invitation: Cancer in Developing Countries- May 29\n in DC", "body": "I received this notice today from the Global Health Council. Hope that\nsome of you in the DC area can attend and raise the issues of access to\nand pricing of cancer drugs, topics rarely addressed by the major cancer\nsocieties whether or  healthcare professionals or of patients.   Note\nsponsor of this event is Novartis.\n\n--\nJoana Ramos, MSW\nCancer Resources & Advocacy\nSeattle WA USA\nTel. +1-206-229-2420\nhttp://ramoslink.info/\nwww.cancersurvivorsproject.org\nwww.healthyskepticism.org\n\n\n\n-\n\n2007 Conference on Global Health\n\n\nMay 14, 2007\n\nAuxiliary Event @ Conference\n\nTransferring Knowledge into Action: Expanding Cancer Prevention,\nTreatment and Care in Developing Countries\n\nTuesday, May 29, 2007\n7-9:30pm\nEducational Roundtable and Dinner\nDiplomat Ballroom\nOmni Shoreham Hotel\nWashington, D.C.\n------------------------------------------------------------------------\nThe next urgent issue being recognized by the World Health Organization,\nthe International Agency for Research on Cancer, and a recent study in\nthe journal Annals of Oncology tells us that...\n\n...12.5% of all deaths in developing countries are caused by cancer;\nmore than the total percentage of deaths caused by HIV/AIDS,\ntuberculosis and malaria put together.\n\n... up to 75% cancer patients in developing countries are diagnosed with\nadvanced stage or terminal cancers at the time they present to the\nhealth system.\n\n...more than 70 percent of the world's 7.6 million cancer deaths in 2005\noccurred in low- and middle-income countries, where cancer rates are\nalso rising steeply.\n\nThis emerging cancer epidemic requires a coordinated global response.\nBut how?\n\nThis session will present comprehensive information and perspectives on\nthe topic of cancer in developing countries, and strategies will be\ndiscussed for bringing cancer onto the global health agenda. Innovative\nand thought-provoking ideas will focus on the mobilization of both\naction and funding to address the challenges to cancer prevention,\ndiagnosis, treatment and care in developing countries.\n\nSpeakers:\n\nPrincess Nikky Onyeri\nPrincess Nikky Breast Cancer Foundation Nigeria;\n\nAdamos Adamou\nMember of the European Parliament and Head of the European Society of\nMedical Oncology Developing Countries Task Force;\n\nAllen Lichter\nExecutive VP and CEO of the American Society of Clinical Oncology;\n\nMaurice Middleberg\nVP for Public Policy, Global Health Council;\n\nJoseph Saba\nCEO of Axios\n\n    * To RSVP, please send an e-mail to mac@axiosint.com\n       by May 21. Places are limited.\n    * A seated dinner will be served.\n    * Registration for the Global Health Council conference is not\n      necessary to attend this session.\n\nHosted by Axios, sponsored by Novartis Oncology\n\n\n------------------------------------------------------------------------\nThis e-mail was sent by the Global Health Council. For more information\non the Global Health Council's 34th Annual International Conference,\nPartnerships: Working Together for Global Health, please visit our\nconference website\n.\n\nYou are receiving this e-mail in html format. If you prefer to receive\ne-mails from the Global Health Council in plain text format, please\nchange the preferences in your e-mail client settings.\n\n\n------------------------------------------------------------------------\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}