{"category": "spam", "to_address": "Gnitpick <gnitpick@flax24.uwaterloo.ca>", "from_address": "Kristen Rutledge <aa@gett.net>", "subject": "Simple way to enhance your sexual life.", "body": "\n\nDo you have problems with prescriptions?\nClick here to become a sex giant\nBuy Licensed and Quality Viagra or Cialis at US Drug store now and you'll be at the top all night long!\nOrder now!\nWe surely can say: buying the most wanted medications at us drug store is easy as 1-2-3! Just a few minutes and you'll get any pill that you need at the lowest cost you ever seen!\nWith best regards,\nKristen Rutledge\n \n \nIa skazala, napolovinu, Niks. 18. I ia ne zametil, chtoby on hot chem-nibud pitalsia. Verhovnyj mag Haaskana korotko kivnul i s netoroplivym dostoinstvom zanial Predlozhennoe mesto za stolom. \nNamestnik shel sledom, Vozderzhivaias ot utochniaiushchih ukazanij i pridirchivyh zamechanij, na kotorye on byl Bolshoj master, znachit, poka vse shlo pravilno. I chuvstvoval, kak tverdeet, prevrashchaias v kamen, gortan, iazyk, N?bo. Ia bez lishnih razdumij vyprygnul iz trassera, shagnul vpered i galantno Raspahnul voditelskuiu dvercu. Chare v otvet lish eshche raz fyrknul da Perestupil s nogi na nogu. Zarychav ot bessilnoj iarosti, Gront snova povernulsia licom k goram, Chuvstvuia, kak dyhanie smerti uzhe kasaetsia ego zatylka. A potom ia vas pokinu. Ruki oboih lezhali Poblizosti ot poiasnyh nozhej, naverniaka horosho sbalansirovannyh dlia broska, i ia Pochemu-to ne somnevalsia v ih metkosti. Dumaiu, sejchas on vo vsiu pryt nesetsia po kraiu Velikogo ozera, cherez zemli Seryh adalaev i dovgotov, chtoby perehvatit Niksarda v Gabalasse ili, na krajnij Sluchaj, v Spihathe. \nLuchshe reshat svoi problemy sobstvennymi silami. Tem bolee Chto skoro on sam primchitsia za toboj, molia nebo, po tvoemu vyrazheniiu, chtoby Ty ostalsia zhiv k momentu ego poiavleniia. Vozduh stremitelno potemnel. Perepravivshis v maloznakomoe Mesto, on mozhet okazatsia vyzhatym kak limon, kogda pridet vremia dejstvovat. ejisuminyon VVFcRlhQUVh0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}