{"category": "ham", "to_address": "\"Paul Johnson\" <pauljohn32@gmail.com>", "from_address": "Cody_Hamilton@Edwards.com", "subject": "Re: [R] ordered logistic regression with random effects. Howto?", "body": "\nPaul,\n\nI believe the model you describe below can be fitted in GENMOD and GLIMMIX\nin SAS.\n\nAlternatively, as Brian Ripley suggests, you could use MCMC.  BUGS has a\nnice example of a multinomial logit model in the second example manual.\nWhile this example considers only fixed effects, it's not difficult to\nextend the model to include a random effect (see the 'Seeds' example in the\nfirst example manual).\n\nRegards,\n   -Cody\n\n\n\n                                                                           \n             \"Paul Johnson\"                                                \n                                                                   To \n             Sent by:                  r-help@stat.math.ethz.ch            \n             r-help-bounces@st                                          cc \n             at.math.ethz.ch                                               \n                                                                   Subject \n                                       [R] ordered logistic regression     \n             05/07/2007 07:03          with random effects. Howto?         \n             PM                                                            \n                                                                           \n                                                                           \n                                                                           \n                                                                           \n                                                                           \n\n\n\n\nI'd like to estimate an ordinal logistic regression with a random\neffect for a grouping variable.   I do not find a pre-packaged\nalgorithm for this.  I've found methods glmmML (package: glmmML) and\nlmer (package: lme4) both work fine with dichotomous dependent\nvariables. I'd like a model similar to polr (package: MASS) or lrm\n(package: Design) that allows random effects.\n\nI was thinking there might be a trick that might allow me to use a\nprogram written for a dichotomous dependent variable with a mixed\neffect to estimate such a model.  The proportional odds logistic\nregression is often written as a sequence of dichotomous comparisons.\nBut it seems to me that, if it would work, then somebody would have\nproposed it already.\n\nI've found some commentary about methods of fitting ordinal logistic\nregression with other procedures, however, and I would like to ask for\nyour advice and experience with this. In this article,\n\nChing-Fan Sheu, \"Fitting mixed-effects models for repeated ordinal\noutcomes with the NLMIXED procedure\" Behavior Research Methods,\nInstruments, & Computers, 2002, 34(2): 151-157.\n\nthe other gives an approach that works in SAS's NLMIXED procedure.  In\nthis approach, one explicitly writes down the probability that each\nlevel will be achieved (using the linear predictor and constants for\neach level).  I THINK I could find a way to translate this approach\ninto a model that can be fitted with either nlme or lmer.  Has someone\ndone it?\n\nWhat other strategies for fitting mixed ordinal models are there in R?\n\nFinally, a definitional question.  Is a multi-category logistic\nregression (either ordered or not) a member of the glm family?  I had\nthought the answer is no, mainly because glm and other R functions for\nglms never mention multi-category qualitative dependent variables and\nalso because the distribution does not seem to fall into the\nexponential family.  However, some textbooks do include the\nmulticategory models in the GLM treatment.\n\n\n--\nPaul E. Johnson\nProfessor, Political Science\n1541 Lilac Lane, Room 504\nUniversity of Kansas\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide\nhttp://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}