{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Brittany Johns <bunch@graphnet.co.uk>", "subject": "Maestro Penis", "body": "\n\nTired with your sexual problems? Looking for an effective and cheap solution?\nEverything for your health\nYou will have sex all night long. You won't think about erectile dysfunction anymore.\nGo to the site\nBest quality drugs, instant shipping worldwide, friendly support! Lowest prices on the web!\nWith best regards,\nBrittany Johns\n \n \nMne zhe hotelos pobystree pokonchit s etim Delom i pojti otdohnut. Po slovam leshuka vyhodit, chto vashi sudby sviazany, zadumchivo Progovoril tolstiak, kogda ia umolk. Potomu chto mrak, temnota v etoj kulture Associiruiutsia so vsem naihudshim, chto tolko mozhno voobrazit. Eto Bylo by skverno, ochen skverno. \nI ee glazami na menia sejchas smotrel on. Ne vospolzovalsia? A ved Mag vel sebia kak-to stranno. K pravomu visku lipla Kakaia-to strannaia kruglaia moneta, uderzhivaemaia na svoem meste neponiatno kakoj Siloj. Razvernuvshis, Altares uvidel podniavshegosia plemiannika i popiatilsia, Vystaviv zhalnik pered soboj, slovno palku. On ne staralsia sbit menia s nog, shest lish kosnulsia moego Lica, i ia pochti ne shelohnulsia. Teper, kogda Nori skrylas v Kabine gravikata, mne udalos eto sdelat pochti bez truda. Cherez minutu iz-za povorota na vsem skaku vyneslo dvuh Vsadnikov. Za mnoj, hald! Otstanesh propadesh! Shpory s siloj vonzilis v cheshujchatye boka, i shalun srazu rvanul s mesta v Karer. \nBorba eshche ne zakonchilas vnezapnost napadeniia uzhe minovala, i Mozg, opravivshis ot potriaseniia i shoka, napriazhenno iskal puti zashchity. Zashchitnyj perimetr vdrug prevratilsia v strashnyj Cvetok, raspustivshij na vsiu ploshchad smertonosnye lepestki golubyh molnij. Golos Taj, Vorvavshijsia vmeste s shumom, byl snachala podoben gromu, no zatem upal do Obychnogo, kogda soznanie, preodolev barer, ochistilos. Raskrasnevsheesia posle sumatoshnogo bega lico parenka, Vzeroshennye svetlye volosy byli eshche vlazhnymi ot pota, no nemnogo otdyshatsia on Uspel i teper stoial, prislonivshis plechom k kosiaku, molcha slushal ih razgovor i Vsem svoim vidom vyrazhal neterpenie. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}