{"category": "ham", "to_address": "perl6-language@perl.org", "from_address": "Thom Boyer <thom@boyers.org>", "subject": "Re: POD <-> Code entanglement", "body": "Thomas Wittek wrote:\n > I mean POD uses constructs like headlines, lists, blocks, italic etc.\n > which all describe _how it looks like_ and not _what it is_.\n\nI think Damian would take exception to that statement. He worked quite \nhard to make sure that POD describes _meaning_ rather than _appearance_.\nHe even renamed B<> from \"bold\" to \"basis\", I<> from \"italic\" to \n\"important\", and U<> from \"underline\" to \"unusual\". All of those are \nfairly odd choices, with the possible exception of \"important\", but they \nwere clearly made with an eye to backwards compatibility of POD while \nchanging people's focus from how it looks to what it is.\n\n > A head3 might be the headline of a method documentation as well as one\n > introducing the contact information for the author of a module.\n > The directive doesn't have much semantics.\n > Other people might use head2 for documenting methods, what leads to a\n > pretty inconsistent look of the documentation.\n\nWell, I'd argue that head3 has plenty of semantics. It's a level-3 \nheader. How that's rendered is decided elsewhere.\n\nI think the issue is not that head3 is insufficiently semantic, it's \njust that you want something that's even more specific. And POD 6 was \ndesigned with exactly that kind of thing in mind. You can, according to \nthe existing S26, say things like:\n\n     =Method the method synopsis goes here....\n     =begin Parameters\n     =item foo is the fooiest parameter\n     =item bar is the barstest parameter\n     =end Parameters\n\nFurthermore, the Perl parser actually *keeps* the POD chunks, so you can \naccess all that information in the context of the Perl parse. Damian and \nLarry were clearly laying the groundwork for exactly the sort of \njavadoc-ish features you are asking for.\n\n=thom\n-----\nThe supreme irony of life is that hardly anyone gets out of it alive.\n--Robert A. Heinlein [Job: A Comedy of Justice]\n\n"}