{"category": "spam", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Driver signing is a failure for Vista [Newsletter Comp Version]", "body": "\n\nDriver signing is a failure for Vista\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\nChange\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 107 • \n2007-05-10 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\nTOP STORY: Driver signing is a failure for Vista\nKNOWN ISSUES: Readers' revelations on DEP and software discounts\nWACKY WEB WEEK: The world's first IT professional\nPC TUNE-UP: How to spot your enemies on the Internet \nOVER THE HORIZON: Dangerous .doc files and phishing attacks \nPATCH WATCH: Critical patches for Exchange and your workstations\n\nYOUR SUBSCRIPTION:   How to change your address or unsubscribe  \n\n   \n\n\n\n\n\n\n   \n\n\nFor links to every subtopic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!  \nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nGet free Cisco training (and be  famous)\nTrain Signal wants to help you get your Cisco CCNA. Here's how it works: We cover all your expenses (CCNA training videos, hardware, and exam fee) and you share your learning experience by posting to the Train Signal training blog. See more details!\nwww.TrainSignalTraining.com\n\n\n\n\n\n\n\n\n\n \n\nWin Doc Pro — free PC health check\nAre you tired of your computer crashing, slowing down, or freezing when you least expect it? Download our free PC health check and instantly solve your PC problems with an advanced PC Registry cleaner. Breathe life into your PC today!\nwww.WinDocPro.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nTOP STORY\n\n\n\nDriver signing is a failure for Vista\n\n\n\n\n\n\n\n\n\n\nBy Scott Dunn\nTo back up its claims that Windows Vista is \"the safest version of Windows ever,\" \nMicrosoft requires developers to use digital signatures on all 64-bit drivers for \nVista.\n\nThis requirement, far from making the new operating system safer, actually does \nlittle to stop hackers but may be partially responsible for a shortage of drivers that are needed by \nVista users.\n\n\n\n\n\n\n\n\nWhy digital signing matters to you\n\n\n\nTo create a driver for the 64-bit version of Vista, a software developer first obtains \na Class 3 software-publishing certificate from an approved Microsoft certificate authority \n(such as VeriSign). That certificate is then used to digitally \"sign\" (apply \nidentifying code) to the product. The certifying authority is supposed to require \nidentification and do the necessary research to make sure the driver comes \nfrom a legitimate applicant.\n\nDrivers often need to operate at what is called the kernel level — \nthe very core of the operating system. The privileged nature of the kernel \nmeans that it needs special protection. Any compromise to the kernel can \npotentially bring down the entire system. Consequently, Microsoft is anxious to \nprotect the kernel, especially since \"rootkits\" \ncan use drivers and kernel-level software to hide from the operating system.\n\nThere's another reason Microsoft is anxious to secure this key part of \nVista, however. The company is promoting Digital Rights Management (DRM), which is \nused by copyright holders to restrict the use of content. Because \nMicrosoft wants Vista positioned as a platform that is safe for protected \ncontent, it needs its operating system to stop hacker code from \nintercepting media streams. Software could, for example, redirect music from \na PC's sound card and send it to the hard disk instead.\n\n\n\nHow driver signing works\n\n\n\nDigital signing seeks to make visible the source of kernel-mode software. \nIf the 64-bit version of Vista determines that a 64-bit driver doesn't have a signature \nfrom an accepted authority, the operating system will prevent it from loading.\n\nBut, of course, once a certificate is issued, it's somewhat out of the hands of the trusted \ncertificate authority. A vendor with a valid certificate could still produce \nbuggy or malicious code using the certificate, or sell it to someone else who could. \nMore likely, a stolen certificate could be published on the Web and used by \nhackers to produce their own brand of malware.\n\nIn theory, once such a compromise is discovered, Microsoft can revoke the \ncertificate (which, in the case of a hardware driver, would disable all products \nfrom the certificate holder). This could be done via a Windows Update \nthat tells Vista to block the signature in question.\n\n\n\nThe new world order of x64 Vista drivers\n\n\n\nMicrosoft has long encouraged the digital signing of software. Signed software \nis intended to let users know the source of a downloaded program. Users can then \npresumably decide whether it comes from a \"trusted\" source. Digital \nsigning also lets Microsoft identify the developer of a program that has crashed, \nassuming users choose to send Microsoft an error report when the \nfault occurs.\n\nWith Windows Vista, Microsoft has taken advances in code-signing technology \nfurther, making digital signing a requirement in some cases. Here are just a few \nof the new driver-signing requirements (or \"features,\" as Microsoft calls them) \nfor Vista:\n\n\n\nOnly administrators can install unsigned kernel-mode software.\n\n\nKernel-mode software must be digitally signed in order to run in the 64-bit \nversions of Vista. Even administrators can't load unsigned drivers in these \nversions.\n\n\nDriver software that loads at boot time must also have a digital \nsignature.\n\n\nSoftware involved in the streaming of protected content also requires a digital \nsignature.\n\n\nHardware drivers must have digital signatures to pass Microsoft's Windows Logo \nProgram.\n\n\n\nTo further complicate matters, \ndifferent (and, in some cases, multiple) kinds of signatures may be required for \ndifferent occasions. For example, in addition to Kernel-Mode Code Signing (KMCS), \ndevelopers who want the Microsoft Windows logo on their products may need to \nsubmit their products to Microsoft's Windows Hardware Quality Labs (WHQL) to \nreceive a WHQL digital signature.\n\n\n\nDigital signing does nothing to stop hackers\n\n\n\nUnfortunately, driver signing, as it is currently implemented by Microsoft, \nappears to be creating more obstacles for developers and customers than it is \nfor hackers. Even before the final beta of Vista was released, the Black Hat Briefings hacking \nconference demonstrated how easily the driver-signing security could be defeated, \nas described in an \neWeek article.\n\nVista's release candidates didn't fare much better. Researches at India's \nNV Labs \nwere able to devise a product called Vbootkit that bypasses driver-signing \nprotection in RC1 and RC2.\n\nFinally, experts at Symantec's Security Response \nAdvanced Threat Research group recently announced in a \n PDF report that they had succeeded in disabling the new restrictions on 64-bit Vista \nafter just one week of testing.\n\n\n\nHow digital signing burdens developers\n\n\n\nIf driver signing hasn't been an impediment to serious hackers, it has \nbeen a roadblock for legitimate developers of Vista drivers. Obtaining the necessary \ncertificate for digital signing reportedly costs US$500 \nper year (less if a developer signs a multi-year agreement). Once obtained, the \ncertificate has to be kept secure, since a stolen and published certificate could \nbe used by anyone to sign a driver.\n\nThen there are the technical hurdles, such as those needed to meet Microsoft's \nWHQL signing requirements. In a \n\nrecent analysis of Windows' content protection schemes, Peter Gutmann, \nresearcher at the University of Auckland's Department of Computer Science, writes, \n\"The vast majority of drivers running on PCs today aren't signed, not so much \nbecause the developers couldn't be bothered, but because the WHQL process that \nproduces the signed drivers is so slow that they're obsolete by the time they've \nbeen approved by Microsoft (and even some of the WHQL-certified ones are still \npretty flaky).\"\n\nEvidence of this situation isn't hard to find. Complaints about the lack of sound, \nmouse, and video drivers for Vista — months after its Jan. 30 consumer release \n— are rife, including an \n APC Magazine article by James Bannan. One angry user, consultant Dan Goldman, \nhas created a \n Web site advocating a class-action lawsuit against Nvidia and some of its partners \nfor video drivers that claimed to be \"Vista Ready Certified\" and \n\"Designed for Windows Vista.\"\n\nSimilarly, the Techarp Web site \nreports that ATI shipped its Radeon X1950 GT graphics card with a \"Windows Vista \nCertified\" label on the box, despite the fact that it contained no Vista driver \nat all. The release notes admit that fact, in apparent contradiction to the box \nlabel.\n\n\n\nMicrosoft can do better than this\n\n\n\nMicrosoft cannot expect widespread \nadoption of its new operating system if users cannot depend on the availability of \ndrivers to support the most popular hardware configurations. Nor will customers \nfeel safe with Vista when experts continue to report how easy it is to poke \nholes in Microsoft's new defenses. Users need to demand that Microsoft simply do \nits job better before releasing a new operating system, providing a stronger \ndefense against hackers without placing undue burdens on developers.\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nXLNT Idea Nexis 100AP-DVD Disc Publisher\nNexis prints & burns up to 100 CDs or DVDs unattended. Fully integrated design/control software for easy, hands-free operation. XP/Vista compatible. 16x/48x DVD/CD burner. 4800dpi color inkjet printer. Non-proprietary ink cartridges! Just $1,450.\nwww.CDRecordingSoftware.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\nKNOWN ISSUES\n\n\nReaders' revelations on DEP and software discounts\n\n\n\n\n\nBy Scott Dunn\nWindows' Data Execution Prevention (DEP) feature provides important \nprotection against malicious code, as I described in my \nMay 3 article.\n\nBut additional free tools reported by our readers make the feature even more \naccessible to users of Windows XP.\n\n\n\nFinding hardware DEP support in XP\n\n\n\nRichard Wilcox has important information\nthat will be of interest to XP users:\n\n\n\n\"Windows XP SP2 does indeed support hardware DEP, if you have an AMD \nor Intel processor with this feature, according to a Microsoft \n\nKnowledge Base article.\"\n\n\nAs Richard points out, this feature was first introduced with XP Service Pack 2 (SP2). Note, \nhowever, that the Data Execution Prevention tab in SP2's Performance Options dialog box does not \nreport on your hardware's DEP capabilities, the way Vista's dialog box does.\n\nFortunately, other readers, including Stuartt Cuthill, point out that you can get this information \nby using a very simple freeware application, \nSecurable, from Gibson Research Corporation.\n\n\n\nDetecting DEP settings in XP\n\n\n\nA number of readers, including Jeff Kohut, pointed out that XP users can also detect whether DEP \nis enabled for a particular process by downloading the free Sysinternals utility \n\nProcess Explorer from Microsoft.\n\nProcess Explorer mimics most features of Task Manager and can be \nset up to display DEP status by choosing View, Select Columns. Check DEP Status \non the Process Image tab and click OK.\n\n\n\nWindows, not your browser, controls DEP\n\n\n\nOne reader, identified as \"Molotov,\" also uses Process Explorer and has a number \nof useful points about DEP:\n\n\n\n\" 'Hacker programs' are not the only kinds of programs that can utilize \nthe behavior DEP is designed to prevent. Indeed, the technique is so common \nthat Microsoft decided to change the default setting for DEP in XP SP2 from \nOPTOUT (Enable DEP for all executables, except those specified) to OPTIN \n(Enable DEP for core Windows system images) because in service pack testing, so \nmany programs were affected by DEP.\n\n\"The discussion of browsers and their ability to ignore the DEP settings \nwas interesting to me, as I am running XP SP2 (DEP setting of OPTOUT), and both \nIE 7 and Firefox run with DEP enabled (On, as reported by Process Explorer for \nfirefox.exe and iexplore.exe) on my system.\n\n\"This makes me question the statement, 'XP users apparently have no way to \nactivate DEP for IE 7.' IE 7 (as well as IE 6) respect the operating system's \nDEP setting. Though I did not try other browsers in these VPC images, I suspect \nthe results would be the same as my findings for IE 6/IE 7 and my experience on \nmy 'real' system. Add-ons for the browsers could certainly have an impact on \nthe experience one has with the DEP setting enabled for the browser process, \nwhich may lead one to add the process to the DEP exclusion list.\n\n\"The statement, 'IE 7 is not the only program that ignores Windows global \nDEP settings. Even with DEP turned on globally, Task Manager shows that neither \nMozilla Firefox nor Opera support DEP,' is misleading, in the sense that what \nTask Manager (or Process Explorer) is really showing is that DEP is or is not \n'enabled' or 'turned on' for the particular process, not that the process does \nor doesn't support DEP.\"\n\n\nAs Molotov points out, it's the hardware and Windows operating system that \ncontrols DEP, not individual applications. It now appears that XP \ndoes enable DEP for browsers when you choose Turn on \nDEP for all programs and services except those I select.\n\nHowever, this is not the case in Vista, which may be \nexcluding browsers for compatibility's sake, despite the user's DEP setting. It \nremains the case that in Vista, IE7 is the only browser that can have DEP \nenabled. This requires a setting change in the Internet Properties Control \nPanel, as described in the May 3 article.\n\n\n\nEven more discount programs for MS software\n\n\n\nDavid Hightower points out a great way for home \nusers to get Microsoft software at a terrific discount, if they work for the \nright employer:\n\n\n\"Lots of companies have 'home use' agreements with Microsoft, \nincluding military, \ncivilian employees, and contractors working for the U.S. government. \nParticipation in the Home Use Program (HUP) lets you obtain a licensed copy of \nMicrosoft Office and selected additional desktop applications (such as Front \nPage, Project, and Visio) to install and use on your home computer for a \nnominal cost. To participate, go to the  HUP Web site and follow the instructions.\n\n\"In addition to HUP, Microsoft also offers the Employee Purchase Program \n(EPP), which is available to government personnel (military, \ncivilian employees, and contractors). The EPP lets participants purchase some \nof Microsoft's most popular consumer software and hardware at discounted prices \n(Office, Windows XP/Vista, Money, etc.). To participate, go to the \nEPP Web site \nand follow the instructions.\"\n\n\nMicrosoft's Home Use program does offer amazing discounts for those \nwho qualify. To do so, however, you'll have to work for an organization that \nis signed up with Microsoft's Software Assurance volume-licensing program. The \nprogram is designed to let employees work at home using the same software they \ndo at work.\n\nConsequently, the software available to you depends on what software your \norganization has licensed. One reader who uses this program, Evan Orensky, \nwrote to say that he got a copy of MS Office 2007 Enterprise for just a \nfulfillment fee, which in his case was US$20, plus tax. \"The license is \nvalid for as long \nas you work for the company, and as long as the company maintains its Software \nAssurance coverage,\" he adds.\n\n\n\nOEM discounts can apply to end users\n\n\n\nSome readers thought an interpretation of OEM software licensing \nterms that we printed in the \nMay 3 \nnewsletter was too restrictive. Michael Sullivan writes:\n\n\n\"Your article suggests that only 'authorized dealers' can sell Microsoft \nWindows OEM software. I don't think this is accurate. The OEM license, which \nyou [Susan Bradley] post on your site, and which is also available at \nMicrosoft's site, makes clear that the license only applies if a \n'system builder' accepts the license agreement by opening the package.  If the \npackage is unopened, the agreement is inapplicable and the owner may \n'transfer' (i.e., sell) the package intact to another 'system builder.'\n\n\"Are Amazon or Newegg system builders? I don't think so. Are they \nselling OEM packages? Yes. Are they bound by any shrink-wrap licensing \nrestrictions on packages they don't open? No way. \n\n\"You are correct in stating that a person opening the package must become \na 'system builder' by registering with the Microsoft Partner Program, at least \nto the extent the shrink-wrap license is legally binding, which is by no means \nclear. This requirement is not stated in the agreement itself, but is \nincorporated into it through the back door by insisting that the license is \nonly valid if the OS is preinstalled using certain tools that, it turns out, \nare only available if one registers as a system builder.\n\n\"In any event, one doesn't have to be a system builder on the scale of \nMichael Dell to qualify. If a computer builder, who can be an individual, \nregisters and uses the tools provided, he or she can legally buy the OEM \nsoftware from anyone (such as Amazon or Newegg) — not just Microsoft's \nhalf-dozen authorized distributors — and preinstall it with the \ndesignated tools on computers for his or her \ncustomers.\"\n\n\nA similar point is made by another reader, Sean Toner, who writes to point out \nthat the \nOEM license agreement \nactually defines a system builder more broadly than \none might assume. It states that a system builder is \"an original \nequipment manufacturer, an assembler, refurbisher, or pre-installer of software \non computer systems.\"\n\nStill another reader, Poul Andeersen, cites a Microsoft posting on the\n Small Business Community Blog stating that \"OEM system \nbuilder software packs ... are not intended for distribution to end users. \nUnless the end user is actually assembling his/her own PC, in which case, \nthat end user is considered a system builder \nas well.\" [emphasis added]\n\nSuch a statement suggests that hobbyists who are assembling or \nrefurbishing a system may legitimately buy OEM system builder products.\n\n\n\nMore deals for Australian students\n\n\n\nFinally, Lyn Hancock writes in with another way \nfor Australian students to get software through an academic \ndiscount.\n\n\n\"The most surprising deal that I have seen for university students is from \nMicrosoft itself! Check out Microsoft's \n\nUnistudentoffer site as well as their \nIt's Not Cheating \nsite. The offer of a perpetual license for Microsoft Office Ultimate 2007 is \nunbelievable!\n\n\"Basically, if you have a valid Australian university e-mail address, \nyou can purchase either a 12-month license for this bundle for \nAU$25 (about US$21) or a perpetual license \nfor AU$75 (US$62). The only catch is that the offer is valid for only three \nmonths, which ends on May 28.\"\n\n\nThanks for the tip, Lyn!\n\n\nContents\n Index\n\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070510\n\n   \n\n\n\n\n   \n\n\n\nEDITOR'S BOOKSHELF\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\nUnited States / \nCanada / \nElsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\n\nThe world's first IT professional\n\n\n\n\n\n\n\n\n\n\nWe tend to take our company's helpdesk, IT, and support personnel \nfor granted — until something goes wrong. But do you know how far \nback this venerable profession goes?  Have you ever wondered \nhow IT pros of ancient days helped employees with the earliest word-processing \nsystems?\n\nThis side-splitting video, recently posted on YouTube, takes a stab at \nanswering those questions with a short \nsketch about the first \"operating system\" — the book! \n\n\nPlay the video\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\nINDEX\n\nThe following topics appear in the free version\n\n\n\n\nTOP STORY  \nDriver signing is a failure for Vista\n\n \nWhy digital signing matters to you\n\n \nHow driver signing works\n\n \nThe new world order of x64 Vista drivers\n\n \nDigital signing does nothing to stop hackers\n\n \nHow digital signing burdens developers\n\n \nMicrosoft can do better than this\n\n \n \n\n\nKNOWN ISSUES  \nReaders' revelations on DEP and software discounts\n\n \nFinding hardware DEP support in XP\n\n \nDetecting DEP settings in XP\n\n \nWindows, not your browser, controls DEP\n\n \nEven more discount programs for MS software\n\n \nOEM discounts can apply to end users\n\n \nMore deals for Australian students \n\n \n \n\n\nWACKY WEB WEEK  \nThe world's first IT professional\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nPC TUNE-UP  \nHow to spot your enemies on the Internet\n\n \nUse specialized toolbars to surf safely\n\n \nA sneak peek at Firefox 3.0\n\n \nHints of what IE 8.0 might bring\n\n \nHow to make a bootable USB Flash drive\n\n \n \n\n\nOVER THE HORIZON  \nDangerous .doc files and phishing attacks\n\n \nDLL flaw can cause Explorer to crash\n\n \nIE 7 local resource enables phishing attacks\n\n \n \n\n\nPATCH WATCH  \nCritical patches for Exchange and your workstations\n\n \nWord 2000 finally gets its fix\n\n \nInternet Explorer update provides printing fixes\n\n \nExchange needs a critical patch \n\n \nDNS patch fixes Windows servers\n\n \nCritical Office threats arrive via e-mail\n\n \nBiztalk patch may be needed for crypto, too\n\n \nFinally, a real 'svchost.exe' fix\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by May 16, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nVacation breaks occur in late August, Thanksgiving Week, and Christmas/New Year's.\nPublisher: WindowsSecrets.com, Attn.: #120 Editor, 1700 7th Ave., Suite 116, \nSeattle, WA 98101-1323 USA. Vendors, please send no unsolicited packages to this address \n(readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. Associate \nEditor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, Woody \nLeonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler. Managing Editor: Jody Braverman.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\nWiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, Patch Watch, \nPerimeter Scan, Wacky Web Week, the Logo Design (W, S or road, and Star), and the \nslogan Everything Microsoft Forgot to Mention all are trademarks and service \nmarks of WindowsSecrets.com LLC. All other marks are the trademarks or service \nmarks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a newsletter back to us\nsince the last time you visited your preferences page. We cannot send newsletters to you\nafter your bounce count reaches 3, due to ISP policies. If your bounce count is higher\nthan 0 or blank, please visit your\npreferences page.\nThis automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \npreferences  page.\nTo access all past issues: Please visit our\npast issues page.\nTo upgrade your free subscription to paid: Please visit our \nupgrade  page.\nTo resend a missed newsletter to yourself: If your mail server filtered \nout a\nnewsletter, you can resend the current issue to yourself. To do so, visit your\npreferences page\nand use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \ncontact page.\nSubscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: 206-282-2536 (24\nhours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \nfree signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside party, ever.\n2. We will never send you any unrequested e-mail, besides newsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \nPrivacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\nUse\nthis 2-click\nUnsubscribe\nlink; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net\nwith leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}