{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Michael Whapples <mikster4@msn.com>", "subject": "Re: Unable to use espeak with orca", "body": "Alternatively you can use the gnome-speech espeak module. I have managed\nto get the espeak gnome-speech driver to go through alsa. If you want\nmore details on this I can give them.\n\nIt would be good for those with slower computers where lag is going to\nbe more noticable to compare the two ways of using espeak. I found that\nspeech-dispatcher lead to less chance of speech becoming choppy, but\nthere were times (eg. when changing folders in evolution, using\nevolutions mail folder list) did have a bit of a lag with\nspeech-dispatcher.\n\nFrom\nMichael Whapples\nOn Sun, 2007-04-29 at 15:33 -0700, Zachary Kline wrote:\n> Hello,\n>     Orca doesn't have an 'espeak' module for speech synthesis, as I recall. \n> What it does have is a Gnome Speech module.  Gnome Speech in turn hooks into \n> Speech Dispatcher, which hooks into Espeak.\n> Now, I have had no difficulties with Orca forgetting any preferences of \n> mine--it uses Espeak just fine.\n> Hope this is helpful,\n> Zack.\n> \n> ----- Original Message ----- \n> From: \"Garrett Klein\" \n> To: \n> Sent: Sunday, April 29, 2007 3:22 PM\n> Subject: Unable to use espeak with orca\n> \n> \n> > Hello all,\n> >\n> > I got orca working yesterday. And I had it using espeak.\n> > However, sometimes Orca seems to \"forget\" that it's supposed to\n> > use espeak, but keeps my speech rate/key echo settings in tact.\n> > I upgraded to svn orca this morning, and it was working fine,\n> > until it forgot my preferences again. I should note, at this\n> > point, that espeak isn't available in the GUI preferences,\n> > regardless of version. And in the newest orca, I get a python\n> > traceback at the end of running orca --text-setup.\n> >\n> > Anyone else have this problem?\n> >\n> > Garrett\n> >\n> > _______________________________________________\n> > Speakup mailing list\n> > Speakup@braille.uwo.ca\n> > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n> > \n> \n> \n> \n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}