{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Tanisha Harrington\" <cijemarkmediajaq@emarkmedia.com>", "subject": "Join the Anatrim revolution", "body": "\nJoin the Anatrim revolution\n\n\n\n\n\n\nAnatrim – The latest and most delighting lose flesh product is now easily available – As could be seen on CNN.\n\n\nCan you hold in your memory all the times when you told yourself you would do any thing for being rescued from this desperately growing pounds of fat? Happily, now no great price is to be paid. Thanks to Anatrim, the ground-breaking pound-melting mixture, you can achieve naturally health mode of life and a really slender figure. Have a look at what people write!\n\n\n\n\"It’s difficult to confess but I was a junk food addict. \n\n\nI swallowed up all this trash \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion stopped when I started course of taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my appetite vanished, \n\n\nmood improved and I’m the happiest person 23 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nSilvia D., Chicago\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nIt’s difficult to imagine how I detested being mocked at school. \n\n\n\n\nI abhorred my plumpness and I hated myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nThis stuff literally took me out of this horrible nightmare! The very sincere thanks to you, fellows.\"\n\n\n\n\n\nSerge Smith, San Francisco\n\n\n\n\n\n\"You know what? Anatrim kept my marriage intact! I fell down into the circle, depression – eating more – more depression. My wife had thought to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed to your web page and I asked for Anatrim at the time. \n\n\nThe result was excellent, my appetite came to normal level, I was often in good spirits, and, certainly, I went some belt holes back. And you see me, the sex became fantastic also!\"\n\n\n\n\n\nSteve\n\n\n\n\n There is a lot of testimonials happy people leave after taking Anatrim. Why don't you join the tens of thousands of slim women and men and take this original appetite-abating power lifting product now!\n\n\nDo not decline the preposition!\n\n\n\n\n"}