{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 27 APRIL 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM EMILY MAITLIS\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nTERRORIST ARRESTS\n\n\nIt took just 19 pilots to create carnage in America on 9-11 and rewrite the history books for ever. Today, the Saudi Government announced the arrest of 170 Al Qaeda suspects - some of whom, it says, were training to fly to carry out attacks. \n\n\nIt's an astonishing figure that evokes a visceral response: How do you imagine a terrorist plot nine times bigger than September 11th? And in the last few hours, it's emerged that the USA has also arrested a leading Al Qaeda figure, Hadi al Iraqi - a man wanted in connection with assassination attacks on President Musharraf of Pakistan.  We'll have the latest developments on both stories tonight.\n\n\nSUPER RICH\n\n\nIf you were a billionaire and really really didn't want to part with your cash to pesky old tax, where would you choose to live?  Belize? Monaco? Cayman Islands? Well actually you could do worse than the UK. The IMF has, for the very first time,  ranked Britain alongside these tax havens - for the loop hole which allows the super rich who live here to avoid paying up on money earned abroad. \n\n\nThis of course, under the beady watch of a Chancellor whose protestant work ethic and acute awareness of injustice are part of his DNA. Tonight, we'll be asking why there are no plans to close the loophole and whether people close to him may actually be profiting from it.\n\n\nROSTROPOVICH\n\n\nIn musical circles, Mstislav Rostropovich, who died today in Moscow, was a genius and a world renowned cellist.  In political circles, he was a powerful emblem of the resistance to Soviet communism. \n\n\nThe two sides of this extraordinary personality came together most dramatically on the night the Berlin Wall came down in 1989 - bursting into spontaneous concert in support of the pro-democracy protestors that tore down the symbol of the Cold War.  Tonight, we speak to a former pupil about his legacy. \n\n\nJoin me tonight at 10:30pm on BBC2.\n\n\nEmily   \n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nINDEPENDENT SCOTLAND?\n\n\t\t\t\t\t\t\tOpinion polls suggest the SNP could win Holyrood but are Scots really keen on the idea of independence?\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY KIRSTY WARK\n\t\t\t\t\t\n\nAnd then on Review, I'll be joined by Mark Kermode, Bidisha, Peter Whittle and Dotun Adebayo to review a film already hailed as a classic.  \n\n\nTHIS IS ENGLAND\n\n\nShane Meadows has directed This Is England - a return to the Thatcher era when the Falklands War was not long over, unemployment was kicking three million, there was a skinhead revival and the National Front was recruiting. \n\n\nThis is England is a film about class, race, music, skinheads, New Romantics and belonging. Although not strictly autobiographical, some scenes mirror events in Meadows' life. Like the central character, 12 year old Shaun, played by first timer Thomas Turgoose, Meadows was adopted by a skinhead gang and the film does much to give skinheads their cultural place, rescuing some of them from their violent racist reputation. \n\n\nENGLEBY\n\n\nSebastian Faulks leaves the long ago past behind in his new novel Engleby, in which the unreliable, deeply disturbed narrator Mike Engleby takes us into his secretive world, from his unhappy days at boarding school, through his reputation as a misfit at Cambridge to his career as a journalist in London in the '80s, to his life now and the demons he has to face. \n\n\nCALLED TO ACCOUNT\n\n\n\"The Indictment of Anthony Charles Lynton Blair For The Crime Of Aggression Against Iraq\" is playing at the Tricycle Theatre in London. Entitled Called to Account, it is the latest collaboration between Richard Norton-Taylor and Nicolas Kent who created verbatim theatre pieces such as Nuremberg and Bloody Sunday at the theatre. \n\n\nThis is a departure from that format in that it is an inquiry commissioned not by government, but by the theatre. Leading barristers gave their time for free to conduct interviews during last January and February with key figures including the neocon Richard Perle, the former Weapons Inspector Scott Ritter and the former International Development Secretary Clare Short. These interviews were then edited for the play which is designed as an even handed inquiry. \n\n\nBJORK\n\n\nAnd finally Bjork. Her new album Volta is perhaps her most accessible - it certainly could put people on the dance floor. Unlike her last release, this has a riot of instruments, and some scorching lyrics. \n\n\nDo listen in and sing along at 11pm.   \n\n\nKirsty \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}