{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 19 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER KAVITA PURI\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nNAVY\n\n\n\"I welcome the report's clear recommendation that media payments to serving military or civilian personnel, for talking about their work, should simply not be allowed,\" so said Defence Secretary Des Browne in the Commons today. \n\n\nHe was talking about the way the MoD handled the media following the detention of 15 navy personnel by Iran in March. There was also another report today into the affair - examining how the incident occured in the first place. Browne admitted that collective failures led to the sailors seizure. Mark Urban will be analysing the content of the two reports.\n\n\nPRISONS\n\n\nWith the prison population topping 81,000, the Justice Secretary Lord Falconer says he will release over a thousand prisoners early to ease the overcrowding crisis. Is this the right way to be dealing with our lack of prison places? Michael Crick investigates.\n\n\nCLICK HERE TO POST YOUR COMMENTS\n\n\nAFGHANISTAN\n\n\nDavid Loyn meets the grandson of the former King of Afghanistan who's a member of a new secular opposition party. He tells us why his party, the National Front, which also includes communists and former warlords, is a challenge to President Karzai. \n\n\nTRACEY EMIN\n\n\nStephen Smith has had a sneak preview of an art collection by some of Britain's top artists, in aid of the NSPCC. He meets Tracey Emin - and let's say - it's a rather edgy interview. \n\n\nSee what I mean at 22.30 with Jeremy.  \n\n\nKavita\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nCAMERON'S 'PEOPLE POWER'\n\n\t\t\t\t\t\t\tConservative Party leader David Cameron has outlined his vision of society and the state. Stephanie Flanders reports.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}