{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nThe merger of Daimler and Chrysler was one of the\n  most expensive – and least fruitful – in American automaking\n  history. Now DaimlerChrysler is dropping its struggling Chrysler Group, which\n  is getting picked up by a private equity firm. Anthony Mason will have the\n  story of the sale and Nancy Cordes will look at what’s pinching\n  American automakers, from union costs to pensions and sales numbers.\n \nTurning to Iraq, we’ll have two\n  stories. First: the anatomy of an ambush. Mark Strassmann will report on the\n  abduction of three American soldiers in Saturday’s early morning hours\n  south of Baghdad.\n  He’ll break down what happened and the effort to get the missing\n  soldiers back.\nAnd it has been reported that between 100,000 and\n  300,000 barrels of Iraq’s\n  oil has been unaccounted for – that’s every day for the past four\n  years. Our Sharyl Attkisson asks why – was it corruption, smuggling or\n  simply poor accounting – and tells what the loss means for U.S.\n  consumers.\nToday cycling great Floyd Landis opened his doping\n  hearing denying the charge. He also criticized the testing procedure used by\n  the Tour de France, Bill Whitaker will report.\nAs for health news, I’ll talk with our Dr. Jon\n  LaPook about the surprising study that shows the number of women older than\n  40 getting mammograms is on the decline. It is the first time the rate has\n  fallen, according to the National Cancer Institute.\n \nAnd I’ll wrap-up our broadcast with the first\n  piece in a series we’ve been working on called “Gotta Have It:\n  The Hard Sell To Kids.” I’ll take a look at the multitude of ways\n  cartoon characters and other faces our kids and grandkids love are used to\n  market everything from junk food to exercise. Experts say there’s more\n  at stake here than just money.\n \nI hope you’ll join us.\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}