{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "John Logsdon <j.logsdon@quantex-research.com>", "subject": "Re: [R] working with R graphics remotely", "body": "Better still IMHO - try NX or FreeNX.  That runs an xclient (also of course an xserver underneath) on your WIndows desktop.   Windows pop up as required.  NX compression means that you get very impressive speed, mouse response etc.\nA server also needs installing on the Linux box so you may have to negotiate with the sysadmins.   I don't think you can install it under an ordinary user.\nNX: www.nomachine.comFreeNX: freenx.berlios.deFreeNX uses core libraries kindly provided by NX\nOn Monday 02 July 2007 15:52:16 Gabor Grothendieck wrote:> On your Windows machine you need to run (1) an X server and (2) an ssh> client. Xming and putty, respectively, are among the free ones.>> First start Xming (you can configure it using XLaunch, which is included> with Xming, or you can run Xming from the Windows command line specifying> the configuration parameters via command line flags).  Then run> putty.   Be sure you have X11 forwarding enabled in putty's>   Connection | SSH | Tunnel> screen.  Googling will locate much info for these programs.>> On 7/1/07, zhihua li  wrote:> > Hi netters,> >> > Now I'm connecting from my local windows machine to a remote linux> > machine and launch R out there using SSH. When I tried to create grahics,> > like using plot or heatmap, I cannot see the output. Maybe a new R window> > displaying the graphics has popped out in the remote machine? Or I need> > to change some settings for the graphics to display? I don't know. I> > googled it and tried dev.copy but it didn't work. Can anyone help me> > here? I need to be able to see the output graphics and save it to a file> > (like jpeg)> >> > Thanks a lot!> >> > _________________________________________________________________> > \\u4eab\\u7528\\u4e16\\u754c\\u4e0a\\u6700\\u5927\\u7684\\u7535\\u5b50\\u90ae\\u4ef6\\u7cfb\\u7edf\\u2014 MSN Hotmail\\u3002  http://www.hotmail.com> >> >> > ______________________________________________> > R-help@stat.math.ethz.ch mailing list> > https://stat.ethz.ch/mailman/listinfo/r-help> > PLEASE do read the posting guide> > http://www.R-project.org/posting-guide.html and provide commented,> > minimal, self-contained, reproducible code.\n\n\n-- Best wishes\nJohn\nJohn Logsdon                               \"Try to make things as simpleQuantex Research Ltd, Manchester UK         as possible but not simpler\"j.logsdon@quantex-research.com              a.einstein@relativity.org+44(0)161 445 4951/G:+44(0)7717758675       www.quantex-research.com\n______________________________________________R-help@stat.math.ethz.ch mailing listhttps://stat.ethz.ch/mailman/listinfo/r-helpPLEASE do read the posting guide http://www.R-project.org/posting-guide.htmland provide commented, minimal, self-contained, reproducible code.\n\n"}