{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's Newsnight & Newsnight Review", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tFRIDAY 15 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM KIRSTY WARK\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nGaza\n\n\nWho is in control in Gaza, and who can resolve the crisis between Hamas and Fatah which is making the lives or ordinary Palestinians a nightmare? Hamas has seized the Gaza strip after a week of factional fighting between the rival groups which resulted in dreadful bloodshed. \n\n\nThe Palestinian President Mahmood Abbas has declared a state of emergency in Gaza and has appointed a new interim Prime Minister, Salam Fayyed, an Independent and a former World Bank official. But this move could be described as \"firefighting\". Is there any chance of a lasting peace?  Is another unity government out of the question and with our Foreign Secretary Margaret Beckett describing the violence in Gaza as \"a coup\" does the international community have a role to play in conflict resolution?\n\n\nFootball bungs\n\n\nThe football world is in meltdown after Lord Stevens' Inquiry into \"football bungs\" has reported that five Premier League have breached transfer regulations. The clubs are Chelsea, Newcastle, Bolton, Middlesborough and Portsmouth. The former Metropolitan Police commissioner has also expressed concern about 15 agents and third parties involved in the 17 transfers. \n\n\nNow it's the Football Association's job to take these investigations further. Tonight we'll be examining Lord Stevens' report and asking whether the protestations of innocence by the Association of Football Agents are credible. \n\n\nEU summit\n\n\nIf Tony Blair was looking to next week's European summit to provide a gala end to his time as Prime minister Angela Markel's billet doux to the member states encouraging them to approve a European constitution in all but name - add to that Poland's anger about the country's voting power within the Union - and next week's summit looks like being a rancorous affair. \n\n\nThe idea of a \"charter of fundamental rights\" is an anathema to the Labour government so what will Tony Blair do next week? Our Europe editor Mark Mardell gives us the inside track.\n\n\nLocal government\n\n\nAnd radicalism is alive and well in the home of the Magna Carta - the people of Bury St Edmunds were so fed up with their local government, they voted to abolish it. Steve Smith has been watching anarchy in action - on the day that Michael Heseltine launched his new blueprint (same as his old blueprint?) for reviving local government - directly elected mayors with \"very substantial powers\".  What would the people of Bury St Edmunds make of that? \n\n\nJoin me at 10.30 on BBC2.\n\n\nKirsty\n\n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nHACKNEY KIDS\n\n\t\t\t\t\t\t\tNewsnight meets the kids growing up in Hackney, London amidst a culture of violent crime and drugs\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\nnewsnight review\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tPRESENTED BY MARTHA KEARNEY\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tOn Review tonight, with my guests Rosie Boycott, Mark Kermode, Ian Rankin and Andrew Roberts, we will be discussing the new Turner exhibition of watercolours at Tate Britain. \n\n\nHOCKNEY ON TURNER\n\n\nPart of the show has been curated by David Hockney who took me on a tour of his choices and his own paintings of an East Yorkshire wood which are also on show.  He was so charming and insightful that I came back in a glow telling Review producers that I would like to marry him. There are minor obstacles like the fact he is gay, turns 70 next month and I am already married.\n\n\nLA VIE EN ROSE\n\n\nPerhaps I should move on. We will also review a new film about the legendary French chanteuse and national icon Edith Piaf whose anthem Non Je Ne Regrette Rien must have had as many plays on Desert Island Discs as My Way.\n\n\nNow the extraordinary events of her life have been turned into a biopic written and directed by Oliver Dahan tracing her early beginning raised as a sickly child in a brothel, her discovery on the streets of Paris, to her fame and morphine and heroin addiction and a crippling death from arthritis and cancer at the age of 47 in 1963. In France the film was called La Mome - the kid - Piaf's nickname. \n\n\nTHE DIANA CHRONICLES\n\n\nMy guests will also be discussing Tina Brown's new book The Diana Chronicles published to mark the 10th anniversary of her death. She has had access to Diana's close circle, Tony Blair and all sorts of contacts but is there anything to add to a life which has been so trawled over? \n\n\nWatching the archive we are using brought back some memories for me. I lived round the corner from Coleherne Court in the 1980s and remember the crowds of paparazzi outside the entrance to her flat. I was also working just off Fleet Street on the day of her wedding. Even the most hardened hacks came out of the newsroom to see the royal carriage on its return from St Paul's. The new Princess looked beautiful but was quivering like a young deer. Oh dear, I have come over all 1950s Royal reporter - so sorry.\n\n\nJEKYLL\n\n\nA return to baser instincts with Jekyll, a new BBC One series starring James Nesbitt. It's a retelling of the 1886 Robert Louis Stevenson classic about good and evil and the duality of man's nature. This is a very contemporary retelling in a six part series also starring Meera Syal.  \n\n\nI hope you can join us all at 11. \n\n\nMartha Kearney\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}