{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence (Jun. 6, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 6, 2007\n\n\nJun 6, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 6, 2007  \n\n\n\nFirst Enercast Featured Articles for June 6, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 6, 2007 PowerMarketers Industry Publications\n\n\n\nFuel Adjustment Clauses; Can there be a Win, Win for all Stakeholders? (UtiliPoint.com - Jun. 6, 2007) \n\n\n\nUtiliPoint.com - Jun. 6, 2007 - Fuel adjustment clauses (FAC) have the ability to be structured and administered to encourage vertically integrated electric utilities (VIEUs) to adopt many of the best practices of the competitive markets.\n\n\nJun 6, 2007 PowerMarketers Industry Publications\n\n\n\nCoal-to-Liquids is Doable (EnergyBiz Insider - Jun. 6, 2007)\n\n\n\nEnergyBiz Insider - Jun. 6, 2007 - The United States is increasing its dependence on foreign oil at a time when its own production is down by 40 percent from the previous two decades.\n\n\nJun 6, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nValley power play over coal continues\n\n\n\nJun. 6--WASILLA -- Hit the switch and the lights go on. That simple act is such a habit that few think about where their power comes from.  Until someone suggests plunking down a coal-burning plant in their neighborhood, near their cabin or their favorite fishing hole. Then it's the talk of the town. \"The basic issue is nobody wants a coal plant in their backyard,\" said Jim Sykes of Lazy ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nEmissions limits could be costly\n\n\n\nJun. 6--The amount of carbon dioxide that is emitted into the atmosphere by the Lawrence Energy Center has raised environmental concerns.  Among those worried are Lawrence residents Ray Dean and his wife, Sarah, who filed a lawsuit last week against the Kansas Department of Health and Environment, which monitors air quality. The lawsuit, filed in Shawnee County District Court, contends KDHE is ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nBill could slow Diablo relicensing: If passed, the bill would put the power plant's relicensing on hold until the Energy Commission completes a nuclear study\n\n\n\nJun. 6--The Assembly's Appropriations Committee has approved a bill that would put the relicensing of Diablo Canyon nuclear power plant on hold until a study on the future of nuclear power in California is completed.  The bill by Assemblyman Mark Leno, D-San Francisco, would forbid the state Public Utilities Commission from approving any further use of electricity ratepayer money for costs ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nPublic Utility Commission officer says electric competition is here to stay\n\n\n\nJun. 6--James H. Cawley told state senators Tuesday that Pennsylvania must find a way to make electric competition work because returning to the old system is impossible.  Cawley, vice chairman of the state Public Utility Commission, was one of several witnesses at a joint hearing held by two Senate committees on Gov. Ed Rendell's energy independence package.\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nMcClendon says he's behind Duke ads\n\n\n\nJun. 6--Aubrey McClendon, co-founder, chairman and CEO of Chesapeake Energy Corporation, said Tuesday that he is the anonymous Oklahoma City oilman who purchased several full-page newspaper advertisements along the East Coast praising the Duke men's lacrosse team.  McClendon, a 1981 Duke graduate, said he got the idea from a fellow alumnus who purchased a full-page ad in USA Today immediately ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nDWP feeling the heat of understaffing, aging equipment\n\n\n\nJun. 5--Nearly a year after a heat wave triggered mass power outages across Los Angeles and exposed problems in the city's aging electrical system, the DWP has replaced thousands of transformers, repaired hundreds of problem circuits and hired private crews on standby.  But as Los Angeles prepares for another potentially record-breaking summer, some are questioning whether the repairs will be ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nWind moving to forefront\n\n\n\nJun. 6--Wind is moving from being a niche market to the mainstream.  \"This is really a pretty big change. ... There are 42 utilities at this conference,\" said Pat Wood, chairman of the North American advisory board for wind developer Airtricity. Wood was at the WindPower 2007 conference in Los Angeles on Tuesday, along with other speakers who addressed the challenges for wind power arising from ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nDirty business of coal could get makeover: State has high hopes for cleaner technology\n\n\n\nJun. 6--State regulators on Tuesday signed off on plans to build one of the nation's first plants that would turn dirty coal into cleaner fuel, generating electricity while dramatically reducing smog and mercury pollution.  If built amid cornfields outside Taylorville, about 200 miles southwest of Chicago, the 630-megawatt plant would provide a lucrative boost to the state's beleaguered coal ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nRell Signs Energy Bill; Vetoes 2 Items\n\n\n\nJun. 5--Gov. M. Jodi Rell signed a comprehensive energy bill Monday, but she pledged to work with lawmakers over the next two days to restore two provisions that she rejected with a line-item veto.  The provisions she vetoed were an additional $2.5 million to expand Operation Fuel, a program that helps poorer residents pay their fuel bills, and programs promoting energy conservation and renewable ...\n\n\nJun 5, 2007 Knight Ridder Tribune Business News\n\n\n\nTax On Power Plants Rejected\n\n\n\nJun. 6--A windfall profits tax on state power plants that would have returned as much as $350 million to property owners struggling to pay their electric bills failed in the House of Representatives Tuesday.  The House rejected the proposal 95-49. Opponents were not convinced that the tax would lead to savings for consumers and said the proposal did not resolve the underlying problem of ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU is fined $5 million\n\n\n\nJun. 6--TXU CORP. -- already under scrutiny for alleged price gouging -- is in hot water again.  The Dallas-based energy giant has agreed to pay the Texas Public Utility Commission a $5 million fine to resolve allegations that it broke state law by signing up thousands of businesses to new one-year electric contracts without obtaining their explicit consent, according to a 10-page settlement ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nPower plants spared tax\n\n\n\nJun. 6--WINDFALL PROFITS LEFT UNTOUCHED  HARTFORD -- State House lawmakers rejected a proposal Tuesday to place a windfall profits tax on some Connecticut power plants to pay for more than $400 million a year in rebates to state electricity consumers. The amendment failed on a bipartisan 49-95 House vote after opponents warned an untested windfall profits tax could backfire and produce even ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nBrookhaven again OKs power plant\n\n\n\nJun. 6--The Brookhaven Town Council yesterday voted once again to approve an environmental review and building permits for the proposed Caithness Long Island power plant in Yaphank, but opponents said they expect to be back in court as early as next week to raise objections.  By a 5-to-1 vote, the board, acting after a judge recently nullified its July 2006 approval as \"arbitrary and capricious,\" ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nJudge to consider lawyers' withdrawal: Attorneys want out of the case of former Westar executive because of lack of payment from utility.\n\n\n\nJun. 6--TOPEKA -- A federal judge is expected to decide in a few days whether to allow defense lawyers for former Westar Energy executive Spielas Lake to withdraw from his criminal case.  U.S. District Judge Julie Robinson took the request under advisement Tuesday after the lawyers complained that trying the case a third time, with no assurance of payment, posed a hardship to them and their law ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nTenaska project faces hurdles\n\n\n\nJun. 6--Omaha-based power company Tenaska Inc. received an air quality permit in Illinois Tuesday to build what experts say would be the cleanest full-sized, coal-powered electricity plant on the planet.  But the project faces hurdles that could delay construction and would need additional work to take advantage of all of its anti-pollution possibilities, such as capturing its carbon dioxide.\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\nProposed PJM power line might skirt Port Jervis\n\n\n\nJun. 6--PORT JERVIS -- A proposed 500-kilovolt power line could run near Port Jervis and parts of Pike County, Pa.  The $350 million line is being proposed by PJM Interconnection, an independent regional transmission organization, which manages electric transmission services of the Mid-Atlantic power grid in 13 states and Washington, D.C. The power line would run from a nuclear power plant in ...\n\n\nJun 6, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nGE increases its renewable portfolio\n\n\n\nTuesday's purchase of a Canadian hydroelectric plant and investments in two wind farms will boost GE's stake in renewables. GE will acquire, for $180 million, two 50 percent stakes in Sweetwater and Roscoe wind farms in Texas. The two farms combined have an output of 450 megawatts, boosting GE's wind power portfolio to 1,900 megawatts. ...\n\n\nJun 6, 2007 Washington Times\n\n\n\nCampaign aims to lower power use in peak times\n\n\n\nWith the hot summer months looming, Utah consumers again will be asked to conserve on their electricity use when the state's power grid is under its most stress. For the seventh year in a row, Utahns will be able to find out when that critical point is about to be reached courtesy of the 'PowerForward' campaign, an early warning system sponsored by the state's Department of Environmental Quality ...\n\n\nJun 6, 2007 Salt Lake Tribune\n\n\n\n'Remarkable and historic': Energy magnate's wife to get $184M in divorce\n\n\n\nCHICAGO -- An energy magnate's estranged wife was awarded $184 million Monday in what appears to be one of the biggest divorce verdicts in U.S. history. Citing irreconcilible differences, Maya Polsky, a 55-year-old homemaker and art gallery owner, filed for divorce from her husband, Michael Polsky, in 2003. Judge William Boyd had ruled in October that Maya Polsky was entitled to half of the ...\n\n\nJun 6, 2007 Detroit News\n\n\n\nSenate gives initial OK to greenhouse gas bill\n\n\n\nAUGUSTA - The Senate voted unanimously today to gave initial approval to a measure that allows Maine to join a multi-state effort to reduce greenhouse gas pollution. The 10 northern states in the Regional Greenhouse Gas Initiative agree to freeze power plant emissions from 2009 to 2015 and cut them 10 percent by 2019. In Maine, the state's six largest power plants would pay for the right to ...\n\n\nJun 6, 2007 Portland Press Herald\n\n\n\nEnergy magnate's wife stands to get $184M in one of nation's biggest divorce awards\n\n\n\nEnergy magnate's wife stands to get $184M in one of nation's biggest divorce awards STORY TOOLS   MORE STORIES By Associated Press June 4, 2007 CHICAGO - An energy magnate's estranged wife was awarded $184 million Monday in what appears to be one of the biggest divorce verdicts in U.S. history. Citing irreconcilible differences, Maya Polsky, a 55-year-old homemaker and art gallery owner, filed ...\n\n\nJun 6, 2007 Rocky Mountain News\n\n\n\nPSC nixes plan for coal-fired power plant\n\n\n\nTALLAHASSEE -- The Public Service Commission this afternoon voted unanimously to deny Florida Power & Light's application for a $5.7 billion, coal-fired power plant 68 miles from Everglades National Park. Members voted 4-0, with new Commissioner Nancy Argenziano not taking part. The utility regulatory board was charged with deciding whether there was a need for more power and whether it would be ...\n\n\nJun 6, 2007 Florida Today\n\n\n\n\n\nInvestment News Alerts: Wednesday's Stocks Worth Watching -- Energy Sector Skyrockets!\n\n\n\nOpen Energy Corporation (OTCBB: OEGY), a  Open Energy Corporation (OTCBB: OEGY), a company seeking to offer renewable, competitive electricity on a global basis, has been issued an intermediate price target upgrade of $1.25 by Market Advisors. Open Energy looks to harness the power of the sun through development and commercialization of renewable energy systems.\n\n\nJun 6, 2007 Internet Wire\n\n\n\nITC Great Plains Receives Approval to Operate as Utility in Kansas\n\n\n\nCompany seeks to invest in transmission upgrades to relieve existing system constraints, improve reliability and facilitate renewable resource-based energy into the market NOVI, Mich., June 5 /PRNewswire-FirstCall/ -- ITC Great Plains, an ITC Holdings Corp. (NYSE: ITC) subsidiary, announced today the Kansas Corporation Commission (KCC) has approved its Application for Certificate of Convenience ...\n\n\nJun 5, 2007 PR Newswire\n\n\n\nHawai'i Geothermal Energy - Clean, Stable, Always Available\n\n\n\nFor just short of 15 years, Puna Geothermal Venture (PGV) has supplied clean, safe and sustainable electrical energy -- and energy diversification -- to Hawaii Island, the Big Island of the chain. Puna Geothermal is provider of about 20 percent of the electricity for the island's businesses and residents. Powered by natural heat from the earth, its geothermal-generated electricity has:     -- ...\n\n\nJun 6, 2007 PR Newswire\n\n\n\nEvergreen Energy Inc Releases Shipment Update\n\n\n\nDENVER--(BUSINESS WIRE)--Evergreen Energy Inc (NYSE Arca: EEE) today released an update on selected shipments on its website, www.evgenergy.com.  About Evergreen Energy Inc Evergreen Energy Inc refines coal into a cleaner, more efficient and affordable solid fuel that is available today to meet the growing energy demands of industrial and utility customers while addressing important environmental ...\n\n\nJun 6, 2007 Business Wire\n\n\n\nAmerenUE Disputes Statement From Dam Safety Official\n\n\n\nAmerenUE declared today that, contrary to media reports of June 5, there was no criminal tampering with evidence before or after the disastrous collapse of the Taum Sauk Reservoir in December of 2005. Thomas R. Voss, president and chief executive officer of AmerenUE, says, 'I cannot emphasize strongly enough that our entire focus after the incident was to first assure the safety of all concerned ...\n\n\nJun 6, 2007 PR Newswire\n\n\n\nLoad Management Standards May Facilitate Effectiveness of Demand Response Programs\n\n\n\nFaced with a deficit in meeting its demand response (DR) goals, the California Energy Commission held a workshop on June 5 in Sacramento to consider the imposition of load management standards. In a white paper prepared for the Energy Commission, The Brattle Group reviewed California's early history with load management standards and provided options that could increase the effectiveness and ...\n\n\nJun 6, 2007 PR Newswire\n\n\n\nManufacturers Need to Innovate Constantly to Stay Ahead of Competition in the North American Large Fuel Cell Markets\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c58928) has announced the addition of the Frost & Sullivan report: North American Large Fuel Cell Markets to their offering. This Frost & Sullivan research service on North American Large Fuel Cell Market provides detailed insights into the major market drivers, restraints, challenges, strategic ...\n\n\nJun 6, 2007 Business Wire\n\n\n\n\n\nTenaska Power Fund, eCORP Announce Major Gas Storage Development\n\n\n\nOmaha, NE - Tenaska Power Fund, L P. (TPF) of Omaha and eCORP, LLC of Houston, Texas recently announced plans to develop a major new high-performance natural gas storage facility near Uniontown in southwestern Pennsylvania. The facility will be developed by a jointly-owned entity, Chestnut Ridge Storage, LLC. In the first phase of development, the facility is expected to provide about 17.5 ...\n\n\nJun 6, 2007 Power Online\n\n\n\nNorthWestern Announces Montana - Idaho Transmission Line\n\n\n\nHELENA, Mont. (AP) - NorthWestern Energy announced plans Tuesday for a transmission line running from Montana to Idaho which it said could carry energy from developing wind power plants to power-hungry markets. The company, which has previously hinted at such a project, said the power line would be operated outside of its regulated utility business and would have no effect on consumer electric ...\n\n\nJun 6, 2007 Canadian Business Magazine\n\n\n\nUS antitrust agencies clear Lehman's purchase of Eagle Energy\n\n\n\nNew York investment bank Lehman Brothers' proposed buyout of Eagle Energy Partners -- a Houston-based natural gas and power marketer founded in 2003 by former Dynegy CEO Chuck Watson -- does not pose any antitrust concerns, the US said Wednesday. In an early termination notice under the Hart, Scott, Rodino Antitrust Improvements Act, the US Federal Trade Commission said neither it nor the ...\n\n\nJun 6, 2007 Platts\n\n\n\nState: No new coal plant for FP&amp;amp;L\n\n\n\nState regulators have ruled against Florida Power & Light Co., rejecting the company's bid to build a clean coal power plant in Glades County. Juno Beach-based FP&L said it is deeply disappointed in the four voting members of the Florida Public Service Commission's unanimous decision on Tuesday. For the last several years, the company said it has received strong encouragement through the Florida ...\n\n\nJun 6, 2007 South Florida Business Journal\n\n\n\nJohnson Matthey Licenses DOE Patent To Remove Mercury And Arsenic From New IGCC Coal Power Plants\n\n\n\nMalvern, PA - Johnson Matthey announced recently that it has been granted an exclusive license by the U.S. Department of Energy's National Energy Technology Laboratory (NETL) for its high temperature sorbent technology and patent to remove mercury, arsenic and potentially selenium, cadmium and phosphorous from syngas produced by coal gasification. This license was a natural extension of a ...\n\n\nJun 6, 2007 Power Online\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nTurkey-manure power plant raises stink with environmentalists\n\n\n\nBENSON, Minnesota: For anyone curious about what thousands of tons of turkey manure looks like, piled high in an olfactory-assaulting mountain, this old railroad stop on the extreme edge of alternative energy production is the place to be. Thanks to the abundance of local droppings, Benson is home to a new $200 million power plant that burns turkey waste to produce electricity.\n\n\nJun 6, 2007 International Herald Tribune\n\n\n\nNuclear plants will not attract investors, say academics: report\n\n\n\n- New investment in nuclear power and renewable energy may not materialise because the government has failed to understand the needs of investors, a group of energy experts is warning. According to the Financial Times, the UK Energy Research Centre (UKERC), a government-backed academic group, argues that ministers show signs of continuing to believe that there is a Central Electricity Generating ...\n\n\nJun 6, 2007 Power Engineering\n\n\n\nStudy Individual Analysis of the Top 440 Generator Companies Today Inside New Report\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59038) has announced the addition of Generators - Portfolio Analysis to their offering. The Portfolio Analysis - Generators is a comprehensive evaluation of the UK market. The revised and updated 2007 edition analyses the financial performance of the companies important to the success of your ...\n\n\nJun 6, 2007 Business Wire\n\n\n\nAnalysis: OAS tackles energy needs\n\n\n\nUPI Energy Correspondent PANAMA CITY, Panama, June 6 (UPI) --  Renewable energy and biofuel development in the Western Hemisphere returned to the forefront of talks Tuesday at the Organization of American States General Assembly after a day of diplomatic scrapping between U.S. and Venezuelan officials. 'The words in the document should be translated into action,' said Denis Antoine, Grenada's ...\n\n\nJun 6, 2007 Washington Times\n\n\n\nFar East Energy Receives Favorable Independent Engineering Report\n\n\n\nFar East Energy Corporation (OTCBB: FEEC)  Far East Energy Corporation (OTCBB: FEEC) announced the results of an independent review by Netherland, Sewell &amp; Associates, Inc. (NSAI) of Far East Energy Corporation's coalbed methane (CBM) properties in its Shouyang Block in Shanxi Province, China, with approximately 500,000 acres (2000 square kilometers). NSAI has concluded that the No.\n\n\nJun 6, 2007 Internet Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}