{"category": "spam", "to_address": null, "from_address": "frank luga <fkluga9@hotmail.com>", "subject": "DEAR FRIEND,WAITING TO HEAR FROM YOU.", "body": "\n\n\n\n\nOFFICE OF THE ACCOUNTANTCOSTA DIAMOND FINANCE,LAGOS-NIGERIA.Cell:+234-80-33504888 Dear Friend, I am Mr. FRANK LUGA, the chief accountant of COSTADIAMONDS FINANCE FIRM Of LAGOS-NIGERIA (CDF). There is an online account opened in this FINANCE in 1999 and since date nobody has operated this online account. After going through some old files in the records, I discovered that if I do not remit this money out urgently it would be forfeited for nothing. The owner of this account is Dr Sayeed Abdul, an iraqi foreigner and a Miner at Kruger Gold Company in iraqi. From the information's i received Surrounding his untimely death was that   He Was  Incarcerated and beaten to death by the then Former President of Iraqi Late Saddam Hussein because he was against his Government. As i write you this mail no other person knows about this account or anything concerning it,since it was a personal account , the account has no other beneficiary and my investigation proved to me as well that his Company does not know anything about this account and the money involved is Twenty-Five Million United States Dollars (US$25 Million).\n \nYou are the only person that I have contacted in this Business and please let it remain between both of us, even if we work or do not work out the business together. Meanwhile, I am contacting you because of the need to involve a foreigner with a foreign account as a beneficiary. I need your full co-operation to make this work fine because the management is ready to approve this payment to any foreigner who has correct information of this account, which I will give to you as soon as you indicate your sincerity to co-operate with me, and capability to handle such amount in strict confidence and trust,according to my instruction and advice, for our mutualbenefit because this opportunity may never come again in my life. I need a truthful and God fearing person in this Business because I don't want to make a mistake so I need your strong assurance and trust. With my position in the office I don't want anything that will jeopardize my job so I advice that we should make secrecy and confidentiality our primary working condition, bearing in mind that I am a public servant. I will also use my position and influence to effect legal approvals and onward transfer of this money to your account with appropriate clearance forms from the ministries and foreign exchange department. 40% of this money will be for you as foreign partner, while the balance of 60% will be for me. \nYou can get back to me on this email address: mrfrankluga@myway.com, I look forward to your earliest reply. Yours sincerely,                                                  Mr.FRANK LUGALive Earth is coming.  Learn more about the hottest summer event - only on MSN. Check it out!\n"}