{"category": "ham", "to_address": "<r-help@stat.math.ethz.ch>", "from_address": "\"Junnila, Jouni\" <Jouni.Junnila@PERKINELMER.COM>", "subject": "[R] Choosing a column for analysis in a function", "body": "Hello all,\n\nI'm having a problem concerning choosing columns from a dataset in a\nfunction.\n\nI'm writing a function for data input etc., which first reads the data,\nand then does several data manipulation tasks. \nThe function can be then used, with just giving the path of the .txt\nfile where the data is being held. \n\nThese datasets consists of over 20 different analytes. Though,\nstatistical analyses should be made seperately analyte by analyte. So\nthe function needs to be able to choose a certain analyte based on what\nthe user of the function gives as a parameter when calling the function.\nThe name of the analyte user gives, is the same as a name of a column in\nthe data set.\n\nThe question is: how can I refer to the parameter which the user gives,\ninside the function? I cannot give the name of the analyte directly\ninside the function, as the same function should work for all the 20\nanalytes.\nI'm giving some code for clarification:\n\n>datainput <- function(data1,data2,data3,data4,data5,data6,analyte)\n>{\n...\n##data1-data6 being the paths of the six datasets I want to combine and\nanalyte being the special analyte I want to analyze and which can be\nfound on each of the datasets as a columnname.##\n##Then:##\n...\n>data.whole <- subset(data.whole,\nselect=c(Sample.Name,Analyte.Values,Day,Plate))\n\n##Is for choosing the columns needed for analysis. The \"Analyte\" should\nnow be the column of the analyte, the users is referring to when calling\nthe datainput-function. How to do it? ## \nI've tried something like\n>data.whole$Analyte.Values <- data.whole$analyte ##(Or in quotes\n\"analyte\")\nBut this does not work. I've tried several other \"tricks\" also, but\ncannot get it to work. Can someone help?\n\nThanks in advance,\n\nJouni\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}