{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Ira Glazer <ira@yanua.com>", "subject": "[Ip-health] NEJM: A National Survey of =?windows-1252?Q?Physician=96Industry?=\n =?windows-1252?Q?_Relationships?=", "body": "http://content.nejm.org/cgi/content/full/356/17/1742?query=TOC\n\nABSTRACT\n\nBackground Relationships between physicians and pharmaceutical, medical\ndevice, and other medically related industries have received\nconsiderable attention in recent years. We surveyed physicians to\ncollect information about their financial associations with industry and\nthe factors that predict those associations.\n\nMethods We conducted a national survey of 3167 physicians in six\nspecialties (anesthesiology, cardiology, family practice, general\nsurgery, internal medicine, and pediatrics) in late 2003 and early 2004.\nThe raw response rate for this probability sample was 52%, and the\nweighted response rate was 58%.\n\nResults Most physicians (94%) reported some type of relationship with\nthe pharmaceutical industry, and most of these relationships involved\nreceiving food in the workplace (83%) or receiving drug samples (78%).\nMore than one third of the respondents (35%) received reimbursement for\ncosts associated with professional meetings or continuing medical\neducation, and more than one quarter (28%) received payments for\nconsulting, giving lectures, or enrolling patients in trials.\nCardiologists were more than twice as likely as family practitioners to\nreceive payments. Family practitioners met more frequently with industry\nrepresentatives than did physicians in other specialties, and physicians\nin solo, two-person, or group practices met more frequently with\nindustry representatives than did physicians practicing in hospitals and\nclinics.\n\nConclusions The results of this national survey indicate that\nrelationships between physicians and industry are common and underscore\nthe variation among such relationships according to specialty, practice\ntype, and professional activities.\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}