{"category": "ham", "to_address": "<ip-health@lists.essential.org>", "from_address": "\"Stephanie Burgos\" <SBurgos@oxfamamerica.org>", "subject": "[Ip-health] Brand-Name Drug Industry Alarmed At IPR Precedent Of FTA Template", "body": "This is a multi-part message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nInside US Trade\n\nBrand-Name Drug Industry Alarmed At IPR Precedent Of FTA Template\n\n_______________________________________________\n\nDate: May 18, 2007\n\n\n\nThe brand-name pharmaceutical drug industry is arguing that the\nintellectual property rights provisions in a bipartisan compromise for\nhandling free trade agreements scales back protections for brand-name\ndrugs and could set a much lower standard for IPR protection in\ndeveloping country markets.\n\n\n\nThe agreement contains three main provisions: a reduced period of time\nin which generic companies are restricted from using brand-name test\ndata to approve generic drugs, an end to the requirement that a foreign\nhealth regulator would have to certify that a generic drug does not\nviolate a patent before extending marketing approval, and language\ngiving countries the option of extending patent duration if a patent\napproval does not happen on a timely basis.\n\n\n\nThese elements apply only to FTAs negotiated with Peru, Panama and\nColombia as developing countries, but do not apply to the FTA with Korea\nas an industrialized country.\n\n\n\nPartly for this reason, health advocacy and generic drug industry\nsources this week charged that the pharmaceutical industry was not\nharmed in any substantive way by the conceptual agreement announced May\n10. Health advocacy sources also pointed out that under the conceptual\nagreement, the brand-name pharmaceutical industry is still receiving\nstrong IPR protections.\n\n\n\nBut brand-name drug industry sources this week countered that the\nconceptual agreement could have large implications if it is used as a\nprecedent for handling trade-related IPR issues. These sources said they\nfear that the U.S. Trade Representative's office will no longer insist\non tough data exclusivity, patent linkage, and patent extension\nprovisions in developing countries, especially in China, India, or\nSoutheast Asia.\n\n\n\nA U.S. trade official this week downplayed the precedent-setting nature\nof the agreement by saying it is \"about the four FTAs that are pending\ncongressional approval.\" The official said he could not comment on\nwhether the U.S. would now negotiate the new IPR provisions in future\nFTAs, but did not explicitly rule out this possibility. \"This was not a\npart of our discussion with Congress, and that is just a bridge we\nhaven't crossed yet,\" he said.\n\n\n\nThe official also said it was unclear if the new IPR provisions would\nreduce the leverage of the U.S. in demanding tough IPR protections in\ndeveloping countries more generally. In the so-called Special 301\nprocess, for example, the U.S. pressures trading partners to change\nthose IPR policies and practices it considers objectionable.\n\n\n\n\"We are not getting too far in front of ourselves in terms of potential\neffects of other aspects of trade policy,\" he said. \"We'll have to see;\nI think we are not jumping to any conclusions.\"\n\n\n\nSources on all sides of the debate agreed that the reaction of the\npharmaceutical industry to the conceptual agreement has been muted thus\nfar. In particular, sources noted the cautious response of the\nPharmaceutical Research and Manufacturers of America (PhRMA), which in a\nMay 11 statement said it is still evaluating the agreement. The\nstatement did say PhRMA members have been \"extremely concerned\" that\ncore American intellectual property rights remain protected in FTAs.\n\n\n\nHowever, brand-name industry sources explained that the cautious\nreaction reflects the fact that the brand-name industry recognized that\nthe emerging deal was based around negotiations on labor provisions and\ncould not be stopped over industry objections on the IPR provisions.\nWithout a chance of winning this fight, it is important not to \"burn any\nbridges\" and work constructively with all players so that the IPR\nprovisions in the conceptual agreement do not become a precedent, they\nsaid.\n\n\n\nOne source also highlighted that pharmaceuticals are an export-oriented\nindustry, and so it is hard to lobby against FTAs, and pointed out that\neven under the conceptual agreement the brand-name industry still\nreceives IPR protections, although they are weaker than what would have\notherwise been the case. Another source indicated the muted response\ncould reflect the fact that the pharmaceutical industry is pleased at\nthe efforts of the Bush administration to achieve its domestic\npriorities, such as stopping the imports of Canadian drugs into the U.S.\nin legislation considered by the Senate this month.\n\n\n\nUnder the conceptual agreement, Peru, Panama and Colombia will be asked\nto make five changes to the IPR provisions contained in their respective\nFTAs related to provisions on data exclusivity, patent linkage, and\npatent extensions. In addition, these countries are obligated to include\na new provision providing for access to medicines in critical\ncircumstances, and also incorporate an existing side letter on public\nhealth into the text of their FTAs.\n\n\n\nThe first change would help generic drug manufacturers enter foreign\nmarkets more quickly by shortening the time of data exclusivity in\nforeign markets in certain circumstances. Specifically, a foreign\ncountry would only have to provide data exclusivity for drugs already\napproved in the U.S. until the U.S. period of data exclusivity expires.\n\n\n\nHowever, this concurrent data exclusivity arrangement only applies if a\ntrading partner issued a marketing approval within six months of a\nreceiving the application for marketing approval from a U.S. company.\nThat timeline can only be met if the trading partner relies on the U.S.\nmarketing approval and does not perform its own complete investigation.\n\n\n\nThis change helps address the fear that under recently negotiated FTAs\nsuch as the Central America Free Trade Agreement, a pharmaceutical\ncompany could benefit from five years of data exclusivity in the U.S.\nand then seek five additional years of exclusivity in an FTA partner\ncountry once the U.S. exclusivity period was almost expired.\n\n\n\nSources on all sides of the debate agreed that this change provides an\nincentive for brand-name manufacturers to more quickly seek marketing\napproval in the FTA partner countries after obtaining approval in the\nU.S., as that would ensure that most of the five-year data exclusivity\ngranted in the U.S. is preserved in the FTA partner market.\n\n\n\nHowever, these sources also agreed that the five-year data exclusivity\nperiod in FTA partner countries would likely only be reduced by a matter\nof months as a result of this change. This is one reason why health\nadvocacy sources argued this was only a minor improvement.\n\n\n\nIn addition, health advocacy sources questioned whether Peru, Panama and\nColombia rely on U.S. marketing approvals for their own approval\nprocesses, as the data exclusivity provision applies only in these\nscenarios. The U.S. trade official and brand name drug sources said\nthese countries generally do rely on U.S. approvals, but could not\nspecify further.\n\n\n\nSources agreed that the six-month marketing approval window is a\nrealistic timeframe under which FTA partner countries could process\nmarketing approvals only if they relied on U.S. approvals.\n\n\n\nThe conceptual agreement would also eliminate the mandatory requirement\nin FTAs that a FTA partner's health regulators cannot issue a marketing\napproval for a generic drug until they certify there is no patent\ninfringement. While an FTA partner could still choose to have a\nso-called patent linkage system, it is not required to do so.\n\n\n\nIf a country chooses not to have a linkage system, it must establish a\nmechanism to alert patent holders of generic marketing approval requests\nthat may be patent-infringing, and must also establish procedures to\nadjudicate any patent infringement dispute. This would be coupled with\nthe ability to seek preliminary injunctions or remedies that are just as\neffective under the legal system to block marketing approval in a case\nof a patent dispute, according to a USTR official.\n\n\n\nThe notification arrangement should give patent holders sufficient time\nand opportunity to effectively enforce their rights, according to a\nDemocratic fact sheet describing the change. An example of that would be\nposting a marketing approval application on a government website so a\npatent holder could discover applications that might be infringing, it\nsaid.\n\n\n\nRegardless of whether countries choose to adopt a linkage system, the\nFTA partner country would also have to provide for an expeditious\nprocedure for generic drug companies to challenge the validity or\napplicability of a patent, according to a U.S. trade official.\n\n\n\nHealth advocacy and generic drug sources were generally supportive of\nthis change, but brand name pharmaceutical sources said they are worried\nabout the consequences of shifting the burden for determining patent\ninfringement to court procedures in developing countries. One source\nargued this would more easily allow patent-infringing generic drugs to\nget on the market.\n\nHealth advocacy sources also supported the agreement for lifting the\nrequirement that countries must provide extensions for patents if the\noriginal patent approval was delayed.\n\n\n\nSpecifically, the new agreement would make optional patent extensions\nfor pharmaceuticals if patents or marketing approvals were delayed. This\nis coupled with an across-the-board requirement applying to all fields\nof technology that countries will make their \"best reasonable efforts\"\nto ensure expeditious patent approval, according to a USTR official.\n\n\n\nThis would mean FTA language would stipulate parties \"may\" compensate\npatent holders for unreasonable delays in patent approvals, instead of\nthe language in current FTAs that says they \"shall\" do so, according to\na Democratic summary of the deal. Health advocacy sources were\nunequivocally supportive of this change.\n\n\n\nAlso under the agreement, Colombia, Peru, Panama and Korea will be asked\nto incorporate new language into their FTAs making it clear that they\nwould provide an exception to data exclusivity rules in those agreements\nif necessary to protect public health. Specifically, it will be made\nclear that these countries are allowed in certain circumstances to issue\na compulsory license that would supersede data exclusivity rules in the\nFTA, according to a U.S. trade official.\n\n\n\nKorea, Peru, Panama and Colombia would also be asked to incorporate an\nexisting side letter on public health into the text of their FTAs, which\nstate generally that the intellectual property chapter does not prevent\nan FTA partner country from taking the necessary measures to protect\npublic health.\n\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}