{"category": "ham", "to_address": "<speakup@braille.uwo.ca>", "from_address": "\"Keith Hinton\" <keithint38@CommSpeed.net>", "subject": "Software speech opinions", "body": "Hi Kirk and all at the Speakup mailing list.\nI wanted to express my opinions on Speakup's actual design itself and with \nsoftware speech.\nFirst, I hope that Speech-Dispatcher and SpeechD-up (wich are free open \nsource projects) continue to receive bugfixes in CVS, as much as possible, \nand that at some point all SMP related issues are solved. What if some users \nneed Speech-Dispatcher Hynek eaven after the TTS API provider has been \ncreated and works? I suggest still keeping the project around and improving \nit. Not with features, (Speech-Dispatcher is already cool as it is) but that \nbugfixes and updates of that type can still be maintained for those who \nstill wish to use it.\nNow, regarding Speakup itself,\nI believe Hardware speech is going to be a thing of the passed; especially \nwith computers becoming USB-connection based, and having nno serial ports. \nMy new Gateway desktop is a perfect example. Also, most Linux LiveCD's \nrefuse to use anything but a speakup hardware module, and therefore I wonder \nif softsynth should be really the approach here? I have to SSH most Linux \ninstallations from a working software-enabled Speakup machine here on my \nnetwork anyways.\nSo there is still a use for old technology, however\nI wonder if Speakup could be patched to work with USB/firewire/newer \nsynthesizers, and rewrite it's interface so that it uses drivers like \nsoftsynth?\nBTW Kirk, where is the documentation for softsynth itself and how that \nworks? It is not well documented, and I have been wanting to play with \nwriting my own drivers, and do not have a clear API for Speakup/Sftsyn.\nRegards, --Keith\nSkype: skypedude1234 \n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}