{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter June 11, 2007", "body": "\nhowstuffworks® | science & technology June 11, 2007\nRSS\n  \n How Sci-fi Doesn't Work \nHave you\never watched a science fiction movie and thought that the futuristic space\nbattle or intergalactic travel that you're seeing is probably impossible? While\nmany of these beloved movies base their fictions on real science, frequently\nmistakes and false assumptions are made. In this article, find out how sci-fi\ndoesn't work as we break down some of the major misconceptions about many\nsci-fi classics.\nAlso at HowStuffWorks\n \n\n\nHow\nHydropower Plants Work - Worldwide,\nhydropower plants produce about 24 percent of the world's electricity and\nsupply more than 1 billion people with power. More than 2,000 of these plants\noperate in the United States,\nmaking them the country's largest renewable energy source. Learn how hydropower\nplants harness the power of water to make energy.\n \n\n\nHow\nVampires Work - People\nhave been dreaming up horrible monsters and malicious spirits for centuries.\nVampire-like creatures have appeared in dozens of cultures for thousands of\nyears. In this article, learn where the vampire legend came from, find out about\nthe scientific basis for vampires, and discover some real-life counterparts to\nthe supernatural vampire.\n  \nHow Light Emitting Diodes Work  - Apple just released its new MacBook Pro laptops featuring LED screens. But what are the advantages of an LED screen and how does it work? Find out how light emitting diodes work and learn about their benefits. \nWant more from HowStuffWorks? We've recently added 12 new RSS\n feeds. Besides the Daily Feature, you can now enjoy feeds from Entertainment, Health, Auto, Home and Garden, Science and more.    \nThis Week's Video\n \n\n\nHow\nAcoustic Levitation Works - Acoustic\nlevitation uses sound waves to suspend objects in a fluid, like air. This\nprocess works because of an effect called \"wave reflection.\" Check out this\nvideo from HowStuffWorks to see acoustic levitation in action.\n This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click \nhere.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved"}