{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Judy Rodgers\" <lexexperiongroupvub@experiongroup.com>", "subject": "Less weight - more pleasure and joy", "body": "\nObesity is dangerous, stop it\n\n\n\n\n\n\nAnatrim – The newest and most enchanting flesh loss product is made available now – As could be seen on ABC.\n\n\nDo you count up all the times when you told yourself you would do anything to get rid of this desperately growing number of kilos? Fortunately, now no big price is to be paid. Thanks to Anatrim, the earth-shaking kilos-melting combination of elements, you can achieve naturally health life style and become really slimmer. Have a look at what our customers state!\n\n\n\n\"I hate to acknowledge it but I was awfully addicted to food. \n\n\nI greedily swallowed up all this rubbish \n\n\nand just could not stop. \n\n\n\n\nThis torment passed away after I started course with Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food decreased, \n\n\nspirits improved and I’m the happiest person 26 pounds in 2.6 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nRita R., San Diego\n\n\n\n\n\n\"I had problems with over-weight since a boy. \n\n\nYou can't fancy how I hated being derided at school. \n\n\n\n\nI hated my plumpness and I abhorred myself. \n\n\nAfter trying this and that I found out about Anatrim. \n\n\n\n\nThis stuff literally took me out of this terrible nightmare! Many thanks and a great respect to you, fellows.\"\n\n\n\n\n\nRikky Martin, Las Vegas\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I got into the circle, depression – more eating – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOnce my friend pointed to your web page and I ordered my pack of Anatrim at the same time. \n\n\nThe final result was magnficent, my appetite came to admissible level, I was often in good spirits, and, certainly, I tightened my belt with no regrets. And you see, the bedroom became cool also!\"\n\n\n\n\n\nKarl\n\n\n\n\n There many and many sincere gratitudes happy people leave after taking Anatrim. Don’t you gonna join the thousands and thousands of slender women and men and try this all-natural appetite decreasing energy lifting product now!\n\n\nDon’t lose your opportunity!\n\n\n\n\n"}