{"category": "ham", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "TopCoder Competitions <competitions@topcoder.com>", "subject": "TopCoder(R) Single Round Match brought to you by NSA", "body": "Hello sm1lies,\n\nTopCoder(R) Single Round Match 352 is scheduled for Wednesday, June 2 at 12:00 Noon Eastern Daylight Time (UTC/GMT -4 hours).\n\nPlease be sure to check here for the start time in your time zone:\nhttp://www.timeanddate.com/worldclock/fixedtime.html?day=02&month=06&year=2007&hour=12&min=00&sec=0&p1=179\n\n* Registration will begin at 9:00 AM and will end at 11:55 AM Eastern Daylight Time\n* Allowable programming languages are Java, C++, Microsoft(R) Visual\nC#(R) .NET, and Microsoft Visual Basic(R) .NET\n* TopCoder Administrators will be available in the Admin Lobby Room to answer questions\n* For more details click here: \nhttp://www.topcoder.com/tc?module=MatchDetails&rd=10709\n\n_____________________\n\nWhere Intelligence Goes to Work\n\nAt the National Security Agency, we uncover foreign secrets and create ways to keep our own secrets safe. Our work makes a difference by making the world a safer place to live. And you can make a difference too.\n\nNSA has exciting career opportunities available in Computer/Electrical Engineering, Computer Science, Mathematics, Foreign Language, Intelligence Analysis, Cryptanalysis, and Signals Analysis. You'll enjoy an incredible benefits package, competitive pay, and the satisfaction of making the world a safer place.\n\nFor more information about the career opportunities available at NSA, www.nsa.gov. U.S. citizenship is required. NSA is an Equal Opportunity Employer.\nhttp://www.topcoder.com/tc?module=Static&d1=tournaments&d2=tco07&d3=sponsorspatrons&d4=nsa\n____________________________\n\n\nBest of luck to you in the Arena!\n\n- The TopCoder Competitions Team\n\n===================================================================\nYou have received this email because you indicated in your TopCoder profile that you want to be notified of TopCoder competitions.  If you no longer wish to receive these emails, login to www.topcoder.com/tc and click on 'Update My Profile'.  In the 'Email Notification' section of your TopCoder profile, you have the option to enable or disable receipt of various types of TopCoder emails.  Be sure to save any changes to your member profile.\n\nwww.topcoder.com\nTopCoder, Inc.\n703 Hebron Avenue\nGlastonbury, CT 06033\nPhone: 1-866-867-2633\n\n\n"}