{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "Atlantis rockets to space", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJun  9, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nAtlantis rockets to space\n\n\n\n\n\nSpace shuttle Atlantis blasted off from Kennedy Space Center Friday evening on\nan 11-day mission to the international space station.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nParis Hilton ordered back to jail\n\n\n\n\n\nShe was taken handcuffed and crying from her home. She was escorted into court\ndisheveled, without makeup, hair askew and face red with tears.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\n\n\n\n\nTornadoes, hail hammer Upper Midwest\n\n\n\n\n\nCleanup crews began assembling Friday to salvage remnants of a northern\nWisconsin resort demolished by one of at least five tornadoes that swept\nacross the state.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nStepfather accused of drowning girl, 3, for insurance\n\n\n\n\n\nThe firefighters who tried to save 3-year-old Ashley McLellan, unconscious\nafter being pulled from a pool on a winter night in 2003, noticed something\nstrange about her stepfather: He was calm, mostly dry and never once asked\nthem if she would live.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nD.A.: Kansas teen was strangled by 'ligature'\n\n\n\n\n\nHe calls himself \"Jack\" and considers himself a \"Sweet Troubled Soul\" on his\nMySpace page. His interests include \"eating small children and harming small\nanimals.\"\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWife who killed pastor husband may serve 60 days\n\n\n\n\n\nA woman who killed her preacher husband with a shotgun blast to the back as he\nlay in bed was sentenced Friday to three years in prison, but she may end up\nserving only 60 days in a mental hospital.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConnecticut girl's family denies abuse allegations\n\n\n\n\n\nAn attorney for the family of a teenage girl who was found locked in a room in\na Connecticut house Friday denied allegations that she was seeking protection\nfrom abuse at home.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nPeru's Fujimori under house arrest in Chile\n\n\n\n\n\nFormer Peruvian President Alberto Fujimori was placed under house arrest\nFriday after a Chilean prosecutor recommended he be extradited to Peru to face\ncharges of human rights abuses and corruption.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBush meets pope for talks on Iraq\n\n\n\n\n\nU.S. President George W. Bush was at the Vatican Saturday for an audience with\nPope Benedict XVI and meetings with Italian leaders, as his weeklong European\ntour moves south to the Mediterranean. \n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRift seen in Iraq insurgency -- some groups reject al Qaeda\n\n\n\n\n\nU.S. forces have begun arming nationalist guerrillas and former Saddam Hussein\nloyalists -- and coordinating tactics -- in a marriage of convenience against\nal Qaeda radicals in one of Iraq's most violent provinces, senior U.S.\ncommanders tell CNN.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVillages in Iran flooded in wake of Cyclone Gonu\n\n\n\n\n\nFloods spawned by the remnants of Cyclone Gonu stranded dozens of tiny\nvillages in the deserts of southern Iran on Friday, cutting off roads, power\nand communications and sending some residents into trees for safety.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nHow to get out of your SUV lease\n\n\n\n\n\nSo you've got two years left on the lease for your Lincoln Navigator, but\nfilling the tank is beginning to take its toll.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'Torture porn' helps Lionsgate roar\n\n\n\n\n\nMedia stocks have been on a tear for the past year. Investors have been\nentertained by strong box office results, relatively healthy advertising sales\nat cable networks and increased efforts by media firms to boost their online\npresence.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nTom Verducci: Clemens will give Yanks much-needed boost\n\n\n\n\n\nBaseball's luxury tax never seemed so luxurious. The Yankees are shelling out\n$24.6 million in salary and luxury tax for a 44-year-old six-inning pitcher\nwhose return already was once delayed by a \"fatigued groin\" that occurred\nafter just three minor league starts. Consider it money well spent for New\nYork. Roger Clemens, yes, even the six-inning version back in the more\ndifficult American League, brings exactly the kind of ferocity and\ncompetitiveness an underachieving Yankee team needs.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIan Thomsen: Bowen relishes role as shutdown defender\n\n\n\n\n\nBruce Bowen was watching that night last week when LeBron James scored\nCleveland's last 25 across the fourth quarter and both overtimes. By his\nrecollection, Bowen didn't feel threatened so much as he wanted to understand\nLeBron. The more Bowen saw, the hungrier grew his appetite to learn.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nWorking out at lunch? Here's how to eat to recover\n\n\n\n\n\nSince squeezing fitness pursuits into an already busy day isn't easy, it makes\nsense to use the lunch hour for double duty. Work out, then eat. Trouble is,\nthere's not much time for both. So save time by preparing a quick,\nhigh-caliber meal the night before.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCDC: 2006 West Nile virus deaths up\n\n\n\n\n\nDeaths from the mosquito-borne West Nile virus increased last year to their\nhighest level since 2003, according to a report released Thursday by the U.S.\nCenters for Disease Control and Prevention.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nHigh-tech systems aim to foil counterfeit wine\n\n\n\n\n\nAt Colgin Cellars, a kiss is not just a kiss.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRobot acts like a toddler\n\n\n\n\n\nA group of scientists in Japan have developed a robot that acts like a toddler\nto better understand child development.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nActor reflects on last days as Tony Soprano\n\n\n\n\n\nThere was no decisive moment, no seismic shift, no ceremony when James\nGandolfini put \"The Sopranos\" behind him. But he has. Comfortably.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n'L&O: CI' stars battling over money\n\n\n\n\n\n\"Law & Order: Criminal Intent\" producers' intent to bring back the cast of the\nseries with no raises next season is not sitting well with the show's stars,\nsources said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}