{"category": "ham", "to_address": "<cc-community@lists.ibiblio.org>, <cci@lists.ibiblio.org>", "from_address": "Jon Phillips <jon@creativecommons.org>", "subject": "Re: [cc-community] CC-Salon London to launch in June", "body": "This is excellent tim. Please do sync up with me so I can help publicize a couple of weeks out from the event on cc blog, etc. \n\nAlso feel free to use the shared wiki page about salons at http://wiki.creativecommons.org/salon\n\nTo all and everyone, if you are interested in putting on a cc salon where you live, that url above has the ingredients necessary to put on a cc salon.\n\nCheers!\n\nJon \n\n-----Original Message-----\nFrom: \"Tim Cowlishaw\" \nTo: icommons@lists.ibiblio.org; cc-community@lists.ibiblio.org; cc-uk@listsibiblio.org; \"UK FreeCulture Discuss List\" ; \"Discussion of Free Culture in general and this organization in  particular\" ; fc-london-discuss@lists.ibiblio.org; \"okfn-discuss\" ; \"Open Rights Group open discussion list\" ; openlab@lists.pawfal.org; dorkbotlondon-blabber@dorkbot.org; CADE@jiscmail.ac.uk\nSent: 5/3/2007 1:51 AM\nSubject: [cc-community] CC-Salon London to launch in June\n\nHi all,\n\nApologies for the cross-list spamming.\n\n\nMyself and the folks from the Open Rights Group are in the process of\norganising a monthly CC-Salon event to take place in London, with the first\nplanned for Thursday June the 28th.\n\nThe CC Salon is a monthly event focused on building a community of artists\nand developers around Creative Commons licenses, standards, and technology,\nand have been running with great success in other cities around the world,\nincluding San Francisco, Berlin and Johannesberg. All are welcome,\nespecially anyone interested in Creative Commons, copyright, Free Culture,\nOpen Source, Art, Media, and Music.\n\nIf you'd like to take part, whether by performing or exhibiting your work,\ngiving a talk or presentation, providing sponsorship or other support, or by\ngetting involved in the running of the event, we'd love to hear from you,\nPlease drop me a line if this sounds like you! We'd be especially keen to\nhear from artists, musicians and anyone else who publishes creative work\nunder an open license, or anyone whose cultural practice involves\nappropriation, quotation, remixing, sampling and collage. Do get in touch if\nyou'd like the opportunity to show off your work!\n\nPlease do pass this message on to anyone else who may be interested.\n\nMany thanks,\n\nTim\n\n\nhttp://wiki.creativecommons.org/Salon\nhttp://www.openrightsgroup.org\nhttp://www.freeculture.org.uk\nhttp://ccsalon-london.org.uk\n\n_______________________________________________\ncc-community mailing list\ncc-community@lists.ibiblio.org\nhttp://lists.ibiblio.org/mailman/listinfo/cc-community\n\n"}