{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Terry Hancock <hancock@anansispaceworks.com>", "subject": "Re: License concerns regarding package lft", "body": "MJ Ray wrote:\n> Martin Millnert  wrote: [...]\n> \n>>7.  no permission is granted to distribute, publicly display, or publicly\n>>perform modifications to the Distribution made using proprietary materials\n>>that cannot be released in source format under conditions of this license;\n> \n> [...]\n> \n>>Section 7 seems suspicious.\n> \n> Is this saying (amongst other things) that someone cannot use any\n> incompatibly-licensed compiler to produce binaries of it?  \n\nIMHO, it does NOT mean that.\n\nI think that a compiler or other toolchain element is not a \"material\"\n-- \"materials\" are things that go into a structure and become part of\nit: lumber, paneling, roofing, etc. NOT circular saws, hammers, jigs,\netc. This would be as opposed to \"tools\":\n\nfrom GCIDE:\n> Material \\Ma*te\"ri*al\\, n.\n>    The substance or matter of which anything is made or may be\n>    made.\n>    [1913 Webster]\n\nBased on this license, I believe that the copyleft would extend to\nthings that are incorporated into or linked into the work:\n\nsoftware\nlibraries\nfonts\ngraphic resources\n\nbut NOT to things that are only used in the production process:\n\ncompilers\neditors\n\nUNFORTUNATELY, my interpretation relies on the definition and usage of\nthe word \"materials\". Which I think is less clear than it could be, and\nperhaps requires a very good grasp of English usage, which may be\nespecially problematic internationally.\n\nSo, if possible, I would encourage the original author to improve the\nlicense text (which shouldn't bother them, because I don't think they\nintend anything beyond DFSG). Changing \"using\" to \"from\" -- i.e. \"made\nfrom proprietary materials\" -- makes it much clearer. There are people\nwho would object further that \"proprietary\" is poorly defined and also\nthat stating things in the negative is pretty confusing.\n\nBut I think it is usable like it is, even if no such changes can be made.\n\nCheers,\nTerry\n\n-- \nTerry Hancock (hancock@AnansiSpaceworks.com)\nAnansi Spaceworks http://www.AnansiSpaceworks.com\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}