{"category": "spam", "to_address": "manager@speedy.uwaterloo.ca", "from_address": "for Lesbians <ymarjorie@web.de>", "subject": "Don't get left behind, get phermones", "body": "\n\n\n\n\n\n\nRemember how you felt when your dream girl shot you down? \nWell now you never have to feel that way again! Pheromones have been proven to \nwork, and are guaranted to increase your attractiveness to women of all ages. \nJust look at some of the testimonials we have received back from 100% satisfied \nrepeat customers! : \n\nI am a young pretty girl. I am a lesbian. I have an interesting work, I go in \nfor sports, I am lucky in life, but I have problems with other girls. I cannot \nfind the person, with whom I could spend my leisure time. I cannot come to an \nunderstanding with the girl that I like. I can speak with her, but when the \nrelations between us come to something biggest, when I stay with her in private, \nI can say nothing. I cannot mount this psychological barrier. I tried to work \nwith myself, I read books about this, but I didn't see the effect of my attempts. \nI decided to try perfume with Alpha-Pheromones. I didn't expect anything from \nthem; I wanted to try them only. I was surprised at its effect! Young ladies \nstrike up an acquaintance with me first! At first, I couldn't get used to such \nlife, but now I am number one in relations! Perfume with Alpha-Pheromones is \nsuper! Mary, 25 y.o.\n\nI saw many online shops in Internet many times. I didn't believe in this \nfantastic effect which perfume with Alpha-Pheromones gives. But once I watched a \nTV-show about the influence of Alpha-Pheromones. The scientists explained their \neffect, and I believed that it is really cool thing! I made an order at once. \nKnock on wood, but I think that I have found my better half! I think that my \ngirlfriend really loves me. I thank you very much! You can't imagine how it is \nimportant to me! \nJane, 22 y.o\n\nDon't be left out! \n\nVisit our website now to check out the huge \ndiscount sale going on right now! Hurry though as discount specials will be \ndiscontinued within the next few days!\n\n\n"}