{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "gabriela@abiaids.org.br", "subject": "[Ip-health] Brazilian Working Group on IP - comment about declaration of public interest of efavirenz", "body": "THE WORKING GROUP ON INTELLECTUAL PROPERTY (GTPI) FROM THE BRAZILIAN NETWORK\nFOR THE INTEGRATION OF PEOPLES (REBRIP)'S COMMENTS ON THE DECREE NO 886/2007\nWHICH DECLARES THE PUBLIC INTEREST OF THE DRUG EFAVIRENZ.\n\nThe Working Group on Intellectual Property (GTPI) from the Brazilian Network\nfor the Integration of Peoples (REBRIP) expresses its satisfaction with the\nnews of the publication of the Decree no. 886 issued on April 25th, 2007. This\ndecree represents a first step towards issuance of a compulsory licence on the\nantiretroviral drug Efavirenz. This drug is of utmost importance for the\ntreatment of 75 000 people living with HIV/AIDS in Brazil. The use of TRIPS\nflexibilities to protect public health is absolutely legitimate and legal, both\nnationally and internationally.\n\nWe would like to believe that this time, the Brazilian government will not be,\nonce again, a \"Tiger without Teeth\" and will follow through with its decision\nto guarantee access to an essential medicine by initially importing cheaper\ngeneric versions and later by producing the drugs locally.\n\nThe GTPI/REBRIP has been defending, for many years now, the idea that Brazil\nhas the capacity to produce anti-retroviral drugs. A series of uncertainties\nwith regards to the local productive capacity led us to carry out an objective,\ntechnical study in 2006 that, along with the reports from other international\norganisations - such as the United Nations Program for Development (UNDP) and\nthe Clinton Foundation - prove Brazil's national production capacity. Brazilian\npublic laboratories were fundamental for responding to the AIDS epidemic and\nthis moment is decisive for the future of the National STD/AIDS Program and for\nindividuals living with HIV/AIDS.\n\nIn 2005, the Brazilian government's declaration that the Lopinavir/Ritonavir\n(marketed by the brand name Kaletra) was of public interest also represented a\nstep towards the issuing of a compulsory licence. However, it ended up with the\ngovernment signing a disastrous agreement with the patent holder, Abbott. This\nprecedent remind us to be cautious about the steps that will follow the current\ndeclaration of public interest of Efavirenz.\n\nWe hope that after publishing the aforementioned decree, the Brazilian\ngovernment will go for the issuance of a compulsory license for Efavirenz. This\nwill constitute a historical decision and contribute to the sustainability of\nthe State policy guaranteeing the universal access to medicines. The compulsory\nlicense will demonstrate the maturity of Brazilian institutions, that used to\nvacillate when facing international pressure, and who may now effectively put\nhuman rights and the public interest before merely commercial interests.\n\nWe would like to stress that a compulsory license would provide in the long run\na more solid guarantee of access to this essential item, by allowing for the\nproduction of the medicine locally. This victory of common sense with regards\nto the question of access can and should stimulate the licensing of other\nmedicines that are fundamental for the treatment of various illnesses that\naffect our country. Finally, we would like to emphasize that developing\ncountries are sovereign in the adoption of measures to protect public health,\nwhich includes using the TRIPS Agreement flexibilities.\n\n\nMore information:abia@abiaids.org.br\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}