{"category": "ham", "to_address": "\"Gerald (Jerry) Carter\" <jerry@samba.org>", "from_address": "simo <idra@samba.org>", "subject": "Re: svn commit: samba r22713 -\n\tin\tbranches:\tSAMBA_3_0/source/nsswitch SAMBA_3_0_26/source/nsswitch", "body": "On Mon, 2007-05-07 at 06:58 -0500, Gerald (Jerry) Carter wrote:\n> -----BEGIN PGP SIGNED MESSAGE-----\n> Hash: SHA1\n> \n> simo wrote:\n> \n> > Yes, the cache should help, but there are still some backends \n> > that can safely be queried when offline.\n> \n> I spent some more time thinking about this and it doesn't\n> really matter.    For example, idmap_nss is really only\n> needed by applications that deal in tokens like smbd.\n> The offlne logon geature is strictly for use by PAM\n> enabled applications,  And in that case, the process will\n> only deal in gids.  So if a user has logged in once\n> (which he or she must have in order to logon while offline),\n> the the appropriate SID/uid/gid mappings have been cached.\n> Same thing fro idmap_passdb.\n> \n> idmap_rid should not be used for SIDs that you cannot\n> determine the type for which means that by definition you\n> have already cached that information as well.\n> \n> I think you are dealing in theoreticals without actually\n> having tested a working system.\n\nYeah maybe I am over-concerned here :)\n\n> > In fact you shouldn't allocate if you are not able to \n> > validate the SID. When offline allocation functions should\n> > probably not be called (previously the validation code\n> > was in idmap so it was easy to avoid problems ...)\n> \n> You misunderstand the design of the offline logon feature\n> then.  The basic premise is that the core winbindd code does\n> not change.  So we don't have to have special code in each\n> winbindd API call (auth being the exception).  The cache manager\n> must be able to answer the query without calling the underlying\n> backends which are not guaranteed to work offline.  The fact\n> that some can is irrelevant.  The idmap cache manager must\n> not be required to know which ones can and which one cannot.\n> This is why you cannot delete expired entries from the\n> idmap_cache.tdb as you were previously doing.\n\nWell, deleting negative cached entries is not a big deal, you are going\nto return a missing mapping anyway without hitting the backends, so the\nbehavior should be the same. But I am ok with your change.\n\n> After I've finished regression testing in the next day or so,\n> if you can give me a specific example where it is necessary\n> to actually call into an idmap backend while offline to make\n> something work wecan deal with that case.  But talking about\n> theoretical possibilities leads to bloated code.\n\nSure, make sense to me, I just needed some more explanation and I think\nyou are right here. Thanks.\n\nSimo.\n\n-- \nSimo Sorce\nSamba Team GPL Compliance Officer\nemail: idra@samba.org\nhttp://samba.org\n\n"}