{"category": "spam", "to_address": "captains@flax24.uwaterloo.ca", "from_address": "\"Wiley Branch\" <coseurocebollasviw@eurocebollas.com>", "subject": "Summer is coming, time to tone up", "body": "\nEnd the annoying obesity now\n\n\n\n\n\nAnatrim – The newest and most attracting product for weighty people is now easily available – As seen on ABC\n\n\n\nDid you know that superfluous body kilos kill a plenty of people around the planet? We believe you hate the unsightly look of people like those and the social stigmata attached to them. \n\nMoreover, you’ve not the will to resist an assault of your terrible eating habits. If you see it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nIntroducing Anatrim, the recent product for the reduction of your body’s extra weight. The amazing thing about Anatrim is it raises the quality of your life by soothing your feeling of hunger and giving you better mood. Note what people write about this product:\n\n\n\n\n\n\"This is great! \n\n\nI stopped watching TV continually and eating any food close at hand \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am in a great fit now and there are lots of men around me!\"\n\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\n\"Passive weight losing was of little result to me. This terrible hunger would just kick in and spoil everything. \n\n\nOne day I heard about Anatrim in the media and it brought a great influence on me.\n\n\n I had tried using it, and my wife said to me that I'm a different person now, 5 months later. \n\n\n25 pounds off and I keep losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSerge Smith, San Diego\n\n\n\n\n\nAnatrim helps you to realize that your body doesn’t need that much food. It raises your spirit, supplies you with additional energy, and attacks useless kilos. Especial thanks to its powerful original formula!!\n\n\n\nElicit latest intelligence!\n\n\n\n"}