{"category": "ham", "to_address": "\"\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"The Internet Patrol\" <info@theinternetpatrol.com>", "subject": "\n The Internet Patrol -  Charity Fund for Victims of Virginia Tech Shootings - Please Give\n ?", "body": "\n\n\nThe Internet Patrol\n\n\n The Internet Patrol\nhttp://www.theinternetpatrol.com\n\nCharity Fund for Victims of Virginia Tech Shootings - Please Give?\n\nMonday, April 16th, saw the horrific shootings at Virginia Tech.  Tuesday we posted the full text of the emails sent by VA Tech to warn the students of the shootings as they were going on.  Today, while the friends and families of the shooting victims - as well as all of the students and faculty at Virginia Tech who lived through the terror - struggle to make sense of it and to overcome their ordeal - we ask you to please, please take a minute to make a donation -any donation of any amount - to the fund that has been set up at Virginia Tech to help with grief counselling and expenses. \n\nRead more here: Charity Fund for Victims of Virginia Tech Shootings - Please Give? \n\nPlease visit http://www.TheSiteForTheCure.com !  Pretty please??\n\nHere are some amazing deals we've found on the Internet for ourselves recently:\n\n\nSend Unlimited Newsletters to Your Customers, Friends, Family, and Others:  http://www.theinternetpatrol.com/the-perfect-way-to-send-email-newsletters\n\nUnlimited Calls to Any Phone in the U.S.:  http://www.theinternetpatrol.com/make-unlimited-phone-calls\n\nCheck out our online audio show, \"Three Things You Should Know\"!  http://www.ThreeThingsYouShouldKnow.com\n\n\nAnd check out the best collection of how to videos at http://www.LearnHowTo.TV !\n\n\nKnow somebody who would like to receive these alerts?  Forward this one to them and let them know\nthat they can sign up for free by sending email to \"internetpatrol@aweber.com\" with the \nword 'Subscribe' in the subject!\n\n\n\n\n\nThe Internet Patrol, \n302 W. El Camino Real, #411, \nSunnyvale, CA 94087, USA \n\n\n\nTo unsubscribe or change subscriber options visit:\nhttp://clients.suretymailings.com/z/r/?TBwMLMwctMzsTCxMTJzs\n\n\n"}