{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 15 MAY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\n\t\t\t\t\t\tI'd like to thank everybody who has emailed me about my daughter Charlotte's report on her cancer on Newsnight last night. \n\n\nI will respond to each one individually when I get the chance but I've been very touched by the enormous response, especially from those people who have had similar experiences in their own lives or with their own families. \n\n\nCharlotte has been very moved by the response too and - as she said last night - her prognosis is now very good. She is much better. Thank you all.\n\n\nIn tonight's programme:\n\n\nMADELEINE\n\n\nIt is amazing how the plight of one little girl, in Portugal, captures the imagination of so many of us. It is our own nightmare as a parent. Tonight we will reflect the latest in the search for Madeleine but we will also not forget the millions of people whose names we do not know who are suffering right now in Iraq, and in Africa. \n\n\nIRAQ\n\n\nAlong with the latest from Praia da Luz, we have a truly extraordinary report from Sadr City, Iraq. It is so difficult to obtain any real access to what is happening on the streets of Baghdad, but tonight we have. \n\n\nIt's a stunning and brave piece of journalism, and along with Mark Urban's report last night, it paints a grim picture of the terrible conditions in Iraq.\n\n\nTHIRD WORLD DEBT\n\n\nPlus: I've just been talking to Bono and Bob Geldof about the shortcomings of the deal reached at Gleneagles almost two years ago to do something for the poorest people in the world. The G8 - according to a report on progress towards meeting the goals agreed to at Gleneagles - is falling short. \n\n\nBob and Bono praise Britain and Japan, but point the finger at Germany, Italy and France. Bono frankly admits there may be a crisis about their own credibility in endorsing the G8 agreement since so many countries have not lived up to what they promised.  \n\n\nAND FINALLY...\n\n\nWe unveil the Order of the Brown Nose - our prize for the toadiest sycophant to Zombie Brown. \n\n\nClick here to send us your nominations\n\n\nThat's all at Newsnight at 10.30pm on BBC2. \n\n\nGavin \n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nEMBEDDED WITH US SURGE TROOPS\n\n\t\t\t\t\t\t\tNewsnight's Diplomatic Editor Mark Urban spent three days embedded with US troops in Baghdad.\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}