{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "60 Minutes Newsletter <newsletter_sixty_minutes-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "60 Minutes E-mail Alert", "body": "\nCBSNews.com\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nAmong the most \n      restrained and discreet people on the planet, spies, especially the top \n      spy, usually remain silent. But former CIA Director George Tenet lets \n      loose in our first story in a public venting rare for any public official, \n      never mind a CIA director. Tenet angrily accuses the Bush \n      administration of ruining his reputation by misusing his now-famous \"slam \n      dunk\" remark about Iraqi WMD to justify its march to war. \"It’s the most \n      despicable thing that ever happened to me,\" Tenet says. \"You don’t do \n      this. You don’t throw somebody overboard just because it’s a deflection. \n      Is that honorable? It’s not honorable to me,\" he tells correspondent Scott Pelley. \n       He also reveals in this double-length segment his anguish and \n      frustration over the 9/11 attack, the first of the president’s inner \n      circle to provide a glimpse inside it during what many would consider the \n      country’s darkest hour in modern times. You’ll hear and see his feelings \n      on the hunt for Osama bin Laden, the war on terror and its \"enhanced \n      interrogation\" methods he says were not torture and saved \n      lives. Pressed by Pelley to explain why, if it wasn’t torture,  \n      these individuals had to have their interrogations \"enhanced,\" Tenet, \n      leans forward to respond, \"Because these are people who will never, ever, \n      ever tell you a thing. These are people who know who’s responsible for the \n      next terrorist attack….[who] wouldn’t blink an eyelash about killing you, \n      your family, me and my family and everybody in this town.\" \n         \n \nWatch An Excerpt Of Pelley's \n      Report.\n \nWith the questions still \n      hovering over the massacre at Virginia Tech last week, correspondent Steve Kroft \n      explores perhaps the biggest irony in the horrible event. It’s the fact \n      that Seung-Hui Cho, with a history of mental illness, was still able to \n      purchase the guns he used to kill 32 innocent people, despite a \n      40-year-old federal law prohibiting the sale of guns to the mentally \n      ill. Kroft reports that the law isn’t enforced because many states \n      have laws that protect the privacy of the mentally ill, advocates for whom \n      still want their records sealed and not shared with other government \n      agencies. Even the NRA won’t go that far. The sad fact is that Cho \n      wasn’t the first mentally ill person to kill with a gun he purchased \n      freely, nor will he be likely the last.\n \nWatch Kroft's Reporter's \n      Notebook.\n\n \nThese stories and some \n      interesting items from Andy Rooney’s mail bag, this Sunday, April 29, on \n      60 Minutes at 7 p.m. ET/PT. \n      \n \nFor an early look at this \n      week’s stories, please click \n      here.\n\n \n \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n \n"}