{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\"\n\t<speakup@braille.uwo.ca>", "from_address": "John covici <covici@ccs.covici.com>", "subject": "Thinkpad Saga Continues", "body": "I had one of these and I just resized the partition, so I kept the\nWindows installl,  they have a hidden partition which can be used to\nrestore to factory settings.\n\non Thursday 04/12/2007 Beth Hatch(bhatch200@comcast.net) wrote\n > Re: Thinkpad Saga Continues\n > Hi Sean and all,\n > \n > That's a really good question!  Yes, Fedora did notice my \n > Windows  partition.  The problem was that the way that Lenovo made the  \n > partitions, according\n > to my Linux instructor, meant that we had to break  the existing \n > partitions before installing Linux and then fix grub to  recognize what \n > we had done.\n > The computer was broken into one 30  gigabyte partition and another 90 \n > GB partition.  Since there wasn't  enough room on the smaller partition, \n > we had\n > to use the bigger one in  order to put Linux on one 45 GB partition and \n > Windows on the other 45 GB  partion we then made. this meant that we had \n > to temporarily\n > remove  Windows to build the new partitions.  Then when I tried to run \n > the XP installer, either the newer hardware on the Thinkpad wasn't \n > recognized, and also, Windows wouldn't even recognize that I had a Linux \n > partition at all.  I really don't know why we  couldn't find another way \n > to do this other than using a utility to  re-partition\n > the disk before installing. I'm not knowledgeable enough to  know if we \n > could have done it better. but my instructor said we  had to \n > breakt the\n > big partition in half so that Windows had half and  Linux had half.  \n > That part confused me a little because I didn't  understand why he \n > couldn't break\n > up the partition right there and then,  and save my Windows \n > installation,but he said no, so we started by  breaking up the big \n > partition with the Fedora\n > installer and then  reinstalling Windows.  Here is where things got \n > weird and now we're  rebuilding the system.  If nothing else, it's a \n > learning experience.\n > \n > \n > Beth\n > \n > \n > _______________________________________________\n > Speakup mailing list\n > Speakup@braille.uwo.ca\n > http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n-- \nYour life is like a penny.  You're going to lose it.  The question is:\nHow do\nyou spend it?\n\n         John Covici\n         covici@ccs.covici.com\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}