{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Keisha Hill\" <veqdefinitedetailxod@definitedetail.com>", "subject": "Pounds down, mood up", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\nAnatrim – The latest and most enchanting product for over-weight people available – As told on CNN\n\n\n\nDo you know excessive body kilos kill a lot of people around the whole world? We know that you hate the ugly look of those people and the social bias against them. \n\nMoreover, you can not withstand a siege of terrible eating habits of yours. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the later product for the elimination of your body’s extra weight. The most amazing thing is that Anatrim raises the quality of your life by soothing your feeling of hunger and always cheering you up. Note what people write to us about this product:\n\n\n\n\n\n\"It is outstanding! \n\n\nInstead of watching TV continually and gorging everything easy to reach \n\n\nI became rather more interested in doing sport.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I’m in a great fit now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nAmelia B., Bellevue WA\n\n\n\n\n\n\n\"I tried some passive weight reducing, you know, but with no result. This terrible appetite would just kick in and spoil everything. \n\n\nOnce I heard on Anatrim from my very best friend and I rather liked the information.\n\n\n I had tried using it, and my wife said to me that I'm a different person now, 4 months later. \n\n\n32 pounds have gone away and it’s still far to an end! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Doubt, Chicago\n\n\n\n\n\nAnatrim helps your brain to understand you got no such great need for that much food. It raises your spirit, supplies you with extra energy, and attacks useless kilos. Especial thanks to its mighty newly-elaborated formula!!\n\n\n\nWorm out more information!\n\n\n\n"}