{"category": "spam", "to_address": "\"Subscriber\" <cruiseca@flax9.uwaterloo.ca>", "from_address": "\"Land Deal\" <qg_di9zmi@facespry.com>", "subject": "Pre-development pricing in Costa Rica ", "body": "\n\n\n   \n<!--PYONGYANG, North Korea - U.N. inspectors headed to North Korea's key nuclear reactor Thursday for the first time since 2002 to discuss plans to shut the plutonium-producing facility under an international accord. \n\nADVERTISEMENT\n \nThe development came as Japanese Prime Minister Shinzo Abe criticized North Korea for conducting test firings of short-range missiles Wednesday, saying Tokyo would push for a \"harsh response.\" A U.S. official also called them a provocation that could destabilize the region.\n\nAPTN reported that the International Atomic Energy Agency team members had left their Pyongyang hotel for the Yongbyon reactor, about 60 miles northeast of the capital.\n\nOlli Heinonen, the deputy director of IAEA, told APTN that his team would tour the Yongbyon facility and discuss specific arrangements for future verification of the reactor shutdown and monitoring. He emphasized that the visit was not a formal inspection.\n\n\"We go to see the facilities and continue our discussions in more details,\" Heinonen said in footage shot by APTN at his Pyongyang hotel before departure for the reactor.\n\nHeinonen, whose team arrived Tuesday, refused to provide details of his discussions with North Korean officials so far and emphasized that the visit to Yongbyon was not a formal inspection.\n\n\"We are here to talk about the verification and monitoring arrangement,\" Heinonen said. He added it was not certain when they would return from the facility, though he said that Friday was the last full day of their visit to the North before departing Saturday.\n\nAsked if the North might begin to shut down the reactor during his visit there, Heinonen told reporters that he and his team will see \"what we have on the table\" Friday evening.\n\nThe trip to the facility, at North Korea's invitation, would be the first by monitors from the International Atomic Energy Agency since North Korea expelled them in late 2002.\n\nThe North agreed to close the Yongbyon reactor in February in exchange for economic aid and political concessions. But the communist nation ignored an April deadline to do so because of a banking dispute with the United States.\n\nThat dispute was settled this week after months of delay, and North Korea announced Monday that it would move forward with the disarmament deal.\n\nThe Yongbyon reactor is at the center of efforts involving five countries — China, Japan, Russia, South Korea and the United States — to stop North Korea's nuclear program. The North carried out its first atomic test explosion in October.\n\nThe 5-megawatt reactor is capable of churning out enough plutonium for one atomic bomb per year.\n\nTwo Pentagon officials confirmed a South Korean news report that North Korea tested three short-range missiles Wednesday. The missiles were fired within the North's territorial waters, the officials said, speaking on condition of anonymity because of the sensitivity of the issue.\n\nIn Tokyo, Abe said Thursday his government would \"seek a harsh response from the international community\" to the missile tests.\n\n\"I do not think this will directly affect our security, but in any case it is a violation of the U.N. Security council resolution,\" he said, referring to the document passed by the world body in October condemning North Korea's nuclear test.\n\nThe U.S. government reacted sharply earlier after the Yonhap news agency reported the launches, citing an unidentified South Korean government official.\n\n\"We expect North Korea to refrain from \n--!>Costa Rica Real Estate is HOT: Find out more!           \n\n\n\n\n\n"}