{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Jan Buchal <buchal@brailcom.org>", "subject": "Re: [orca-list] Espeak, Esound and Speech-dispatcher", "body": "Hi Herman,\n\n\n>>>>> \"H\" == Hermann   writes:\n\n    H> Hi, when I use the 3 mentioned programs together, I face\n    H> deactivating of sound by Esound, whenever a sound event is\n    H> played, for example a mail arrives. This happens when I've\n    H> started the GUI, but not in text mode only, because Esound isn't\n    H> used there. To make a long story short, it seems that Espeak\n    H> causes the problem, because it outputs the sound via play or\n    H> aplay. I came to that conclusion because extended testing showed,\n    H> that when I use SD with another synth - Festival or Flite - this\n    H> doesn't happen. Both synts don't use external programs to produce\n    H> speech output. It does not happen when I use Espeak with\n    H> Gnome-speech, but the speech quality is not that excellent, as\n    H> with SD: The speech is stuttering, and it is turned off as soon\n    H> as I play an audio file, due to the fact that Gnome-speech uses\n    H> OSS. The only solution I found is deactivating softmixing and\n    H> that means deactivating Esound; Consequence: I have no system\n    H> sounds including e-mail notification. I experience this since the\n    H> upgrade to Feisty. What can I do to find a better solution? Are\n    H> there plans to develop a driver for SD and Espeak, so that no\n    H> player is needed? Hermann\n\n\nYes I can comfir it. I see it as gnome audio problem and audio system\ngeneraly. The solution is not so easy. Alsa is prefered audio system in\nkernel but what I know still not exist some useful audio server which\nresponse our needs. Maybe port audio libraries can help but that means\ngnome wil have some internal sound server which will use it.\n\nWe must think about and search some solution.\n\nBest\n\n\n-- \n\nJan Buchal\nTel: (00420) 24 24 86 008\nMob: (00420) 608023021\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}