{"category": "spam", "to_address": "Gnitpick <gnitpick@flax9.uwaterloo.ca>", "from_address": "Matthew Edwards <abraham@park.funnel.revenuedirect.com.akadns.net>", "subject": "We have everything you need", "body": "\n\nTired with your sexual problems? Can't have sex like you had 10 years ago? \nOur pharmacy\nYou will have sex all night long. You won't think about erectile dysfunction anymore.\nOur shop\nThere is no need to visit your local drug store at all.\nWith best regards,\nMatthew Edwards\n \n \nIa imel nekotorye navyki, Pozvoliaiushchie pri neobhodimosti nezametno manipulirovat chuzhim soznaniem protiv Ego voli, no udovolstviia podobnye manipuliacii mne ne dostavliali. Zatem moguchim Ryvkom podnial kreslo nad golovoj i shvyrnul Grontu v spinu. Gront mgnovenno ocenil situaciiu, oceniv svoi lichnye shansy na blagopoluchnyj Ishod kak pochti beznadezhnye. Sudia po tomu, kak on uzhasno vygliadel, nichego udivitelnogo v ego Smerti ia ne nahodil. \nI tut on tozhe uvidel: mnozhestvo svetiashchihsia v nochi krasnyh ogonkov, Okruzhivshih ih so vseh storon na rasstoianii desiati piatnadcati shuggov. Eto oni tak dumaiut. Ot nee razilo tak, chto pervym zhe pozyvom zheludok edva ne Vyvernulsia naiznanku, a dyhanie sperlo. Dumaiu, tak eto Predstavlialos so storony. A moi rassypannye po stolu Monety naglo demonstrirovali kak peria, tak i solnca! Magicheskuiu sostavliaiushchuiu Dublikator okazatsia vosproizvesti ne v sostoianii, na takie funkcii on i ne byl Rasschitan. Leks odnoj rukoj to poglazhival svoi shchegolskie Tonkie usiki, to nachinal terebit ne menee pizhonistuiu borodku. Gront predstavlenie imel. Staryj vrag? Kstati, u Obychnogo cheloveka, ne obladaiushchego sposobnostiami k empatii, nenavist obychno Associiruetsia s chernym cvetom, i zdes kroetsia oshibka. \nVot tam on i zhivet, shepnula Taj, kogda my na vsiakij sluchaj otoshli v Storonku. Vozmozhno, udar shlopyvaniia byl gromovym, no dlia menia on Prozvuchal pochti kak bezzvuchnyj hlopok. V konce koncov, u menia chto, malo sobstvennyh Problem, chtoby eshche lomat mozgi nad chuzhimi?. Vozniknuv na mgnovenie iz nebytiia, iatl, hodiachaia Emociia, bezzvuchno hlopnul v ladoshki i kivnul, kak by podkrepliaia ego Soglasie, i snova propal. ejisuminyon VVFcRlhQUVh0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}