{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 19 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nChelsea 1-0 Manchester United\nA Didier Drogba goal in extra time is enough to win Chelsea the first FA Cup final at the new Wembley Stadium.\n\n\n\n \nMourinho treasures FA Cup medal\nChelsea boss Jose Mourinho says his FA Cup winner's medal means a lot to him.\n\n\n\n \nWe were denied penalty - Ferguson\nMan Utd boss Sir Alex Ferguson said his team were denied a clear penalty in the FA Cup final defeat by Chelsea.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nHarrington three ahead in Ireland\nPadraig Harrington will take a three-shot lead into the final round of the Irish Open at Adare Manor.\n\n\n\n \nAT&T Classic leaderboard\n\n\n\n\n \nIrish Open leaderboard\nThe latest scores from the European Tour event at Adare Manor.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nEdwards rockets to Le Mans pole\nYamaha's Colin Edwards will start the French MotoGP on pole after setting a new lap record at Le Mans.\n\n\n\n \nLoeb maintains lead in Sardinia\nFrench star Sebastien Loeb leads after day two of the Rally of Italy in Sardinia.\n\n\n\n \nRally of Italy positions\nLeading positions from the World Rally Championship event.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nMosley steps up push for green F1\nFormula One boss Max Mosley is proposing a raft of changes to help accelerate the adoption of \"green\" technology.\n\n\n\n \nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nHolmes tipping Pavey for success\nKelly Holmes feels Jo Pavey will prove her road-running credentials in Sunday's Great Manchester Run.\n\n\n\n \nGB trio shine in Great Wall test\nBritain has three top-10 finishers in China's Great Wall Marathon as Salvador Calvo smashes the record in one of the world's toughest 26-mile races.\n\n\n\n \nUK to host landmark running event\nThe first-ever Commonwealth ultra running championships will be held in the UK in 2009.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nPetacchi takes Giro seventh stage\nItaly's Alessandro Petacchi of the Milram team wins the seventh stage of the Giro d'Italia from Spoleto to Scarperia.\n\n\n\n \nBlackmail claim stuns Landis case\nFloyd Landis sacks his business manager after he allegedly tried to expose the fact Greg LeMond had been a victim of child abuse.\n\n\n\n \nLaverde grabs Giro stage victory\nColombia's Luis Felipe Laverde wins the sixth stage of the Giro d'Italia from Tivoli to Spoleto.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nReview of the week\nMovie legend to strip if team go up, as the hunt for Mourinho's dog goes on\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nComment: Blues up for the Cup\nRobbo backs Chelsea, providing there are no more dog dramas\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}