{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1140a 6/13 Update: Array retracted 3 bays", "body": "\n\n\n\n\n1140a 6/13 Update: Array retracted 3 bays\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 48\nPosted: 11:35 AM, 6/13/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-46 (06/12/07): Computer glitches resolved; blanket repair decision deferred\n   SR-47 (06/13/07): Crew awake; prepares for spacewalk, solar panel retraction\n   SR-48 (06/13/07): Solar array retraction work begins\n\n=================================\n\n11:34 AM, 6/13/07, Update: Solar array retraction work begins\n\nFlight controllers began the retraction of the P6-2B solar array on the international space station, pausing after pulling the central mast in one 45-inch bay. The astronauts aboard shuttle Atlantis and the international space station trained cameras on the fragile solar array to help controllers in Houston determine whether any of the folding slats making up the two solar blankets would fold properly or whether then might bend backward as retraction continued.\n\nThe P6-2B array's central mast is an open framework truss that assembles itself into square bays when driven outward and collapses into a canister as it is retracted. The mast stretches some 115 feet and is made up of 30.5 open-framework bays when fully extended.\n\nSeeing possible problems after the first one-bay retraction, a \"wiggle\" test was carried out in which the arrays were jogged back and forth about their long axis in a motion similar to rolling a pencil between thumb and forefinger. The idea was to set up a gentle motion in the flexible blankets to coax all of the slats to line up properly along their creases. Flight controllers then told the astronauts to pull the central mast in one more bay.\n\nThey did so, sending rippling waves up and down the blanket slats as the retraction motion started and then stopped. Another wiggle test was ordered to help a few recalcitrant slats line up properly and by 11:30 a.m., three retraction commands had been sent and the mast had been retracted three 45-inch bays. During work to retract the other half of the P6 array last December, 71 commands were required, along with an unplanned spacewalk to manually release stuck guide wires and ensure proper folding.\n\nAnd so it went as engineers assessed the blankets and their ability to fold properly into storage boxes at the base of the array. The slow, step-by-step strategy appeared promising, but it was not immediately clear how far the team would get today. The flight plan includes blocks of time today, Thursday and Friday to work on array retraction.\n\nIn the space station's Quest airlock, meanwhile, astronauts Pat Forrester and Steve Swanson pressed ahead with preparations for a planned six-and-a-half-hour spacewalk to complete activation of a newly installed set of solar arrays on the right end of the station's main power truss. Depending on where the P6-2B retraction effort stands, they may be asked to provide manual assistance to get any balky slats to fold properly.\n\nThe spacewalk is scheduled to begin at 2:08 p.m.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}