{"category": "ham", "to_address": "General Copyright Discussions <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "[d@DCC] US software patents -- must be \"combined with something\n tangible\" to infringe?", "body": "\n   I am wondering if some of the lawyers/legal students can comment on \nthis US court cases.  I haven't read the source ruling yet, but noticed \nsome interesting commentary in:\n\nSupreme Court sides with Microsoft in patent spat\nhttp://news.com.com/Supreme+Court+sides+with+Microsoft+in+patent+spat/2100-1014_3-6180188.html\n\n     \"I think it shows, if not hostility, a reluctance to see patent law\n     applied more broadly than absolutely necessary,\" Leibnitz said, adding\n     that the ruling will impact the whole software sector as well as other\n     industries. \"The Supreme Court is talking about not just software, but\n     prototypes that are sent abroad...templates or blueprints or any other\n     idea that gets sent abroad that needs to be combined with something\n     physical in order to potentially infringe.\"\n\n\n   In this case \"gold master\" CDs of Microsoft software are sent abroad \nwhere copies are made and installed on hardware.  The US court is \nsuggesting that software patents only apply when they are combined with \nhardware (that whole \"new machine\" legal theory I saw in CIPO's new \nMOPOP), and are not infringing when they are only in intangible form (IE: \nsoftware ideas on a CD).\n\n   An interesting question: if patentable software is combined with \nhardware in a jurisdiction that doesn't honour bogus software patents (I \nconsider all information/mental process patents to be bogus), can this \ncombination be imported back into the USA?\n\n   Is the issue the location of the hardware/software combination when they \nare combined, or when the information/mental process patent is followed \n(IE: when the software is executed)?\n\n\n   It is interesting how the US Supreme Court is weighing in quite \ndifferently than the speciality patent courts who have spent years \nexpanding the scope of US patent law to apply to areas that reasonable \npersons wouldn't consider to be inventions.\n\n   It is also interesting to see Microsoft on the side of reducing the \napplicability of software patents, given software patents are one of the \ngreatest tools against their greatest and realistically only real \ncompetitors: FLOSS\n\n-- \n  Russell McOrmond, Internet Consultant: \n  Please help us tell the Canadian Parliament to protect our property\n  rights as owners of Information Technology. Sign the petition!\n  http://www.digital-copyright.ca/petition/ict/\n\n  \"The government, lobbied by legacy copyright holders and hardware\n   manufacturers, can pry my camcorder, computer, home theatre, or\n   portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}