{"category": "ham", "to_address": "\"Thiru Balasubramaniam\" <thiru@keionline.org>", "from_address": "ben.krohmal@keionline.org", "subject": "Re: [Ip-health] Bush, Congress Agree On Trade Standards", "body": "Here is the text on medicines from the outline of \"A New Trade Policy for\nAmerica\" announced yesterday by Speaker Pelosi.  Note that this is still\nan outline - I have not yet seen the actual text:\n\n\nGeneric Medicines\n-  Change the \"data exclusivity\" provision (period in which a generic\nmanufacturer may not use clinical test data of an innovative drug\nmanufacturer) to allow generics to enter the market more quickly than\nunder the old provision (by having \"concurrent period\" of data\nexclusivity).\n-  Include exception in FTAs that the \"data exclusivity\" provision does\nnot preclude FTA countries from taking measures to protect public health\nand from utilizing the WTO \"health solution.\"\n-  Eliminate requirement that a drug regulatory agency withold approval of\na generic until it can certify that no patent would be violated if the\ngeneric were marketed; strengthen and expedite judicial processes in\ncountries to ensure patent rights of innovative drug companies are\nrespected.\n-  Eliminate requirement that an FTA country extend the term of a patent\non a pharmaceutical product for delays in the patent and regulatory\napproval process.  Instead, ensure expeditious patent and regulatory\napproval process.\n\n\n\n> \n>\n> The agreement -- announced last night by House Speaker Nancy Pelosi,\n> Treasury Secretary Henry Paulson and other top officials and lawmakers\n> -- clears a hurdle to the passage of some small bilateral trade deals.\n> And it could ultimately smooth the way for broader trade measures such\n> as renewing President Bush's soon-to-expire authority to negotiate\n> trade deals without threat of congressional amendments, as well as a\n> new global trade agreement now being negotiated in the Doha Round of\n> world trade talks.\n>\n> Lawmakers said the agreement would help provide broad bipartisan\n> support in Congress for pending agreements with Peru and Panama. But,\n> they said other trade measures, including pacts with Colombia and South\n> Korea, involve other issues that haven't been worked out.\n>\n> In addition to including new labor and environmental principles, the\n> deal calls for expanded access for developing countries to generic\n> drugs, a priority for Democrats, who say efforts by brand-name drug\n> makers to protect their markets have put many medicines out of reach in\n> poor countries.\n>\n> \"This is a major breakthrough in what we've been fighting for ... to be\n> sure that globalization opens up for many more people, including\n> workers,\" said Rep. Sander Levin (D., Mich.), one of the negotiators.\n> Before Democrats were in a position to influence the debate, he said,\n> \"I think Republicans were resisting a necessary trend to spread the\n> benefits of trade.\"\n>\n> \n>\n> The drug industry trade group, Pharmaceutical Research and\n> Manufacturers of America, declined to comment until it has reviewed the\n> final agreement. But objections from the powerful lobby -- which\n> succeeded this week in killing a proposal to ease rules for\n> pharmaceutical imports -- would complicate prospects for passage.\n>\n> U.S. Trade Representative Susan Schwab said, even with the changes\n> related to generic drugs, pending trade agreements would improve\n> protections for intellectual property abroad, including brand-name\n> pharmaceuticals. \"This is a compromise,\" she said. The drug provisions\n> apply to the pacts with Panama, Peru and Colombia, but not Korea, she\n> said.\n>\n>\n> -----------------\n>\n> http://online.wsj.com/article/SB117883999169399217.html\n>\n> Bush, Congress Agree\n> On Trade Standards\n> By SARAH LUECK, JOHN D. MCKINNON and GREG HITT\n> May 11, 2007; Page A2\n>\n> WASHINGTON -- After months of standstill, the White House and\n> congressional Democrats agreed to strengthen labor and environmental\n> standards in free-trade pacts, signaling a new bipartisan consensus\n> aimed at shoring up crumbling U.S. public support for economic\n> globalization.\n>\n> The agreement -- announced last night by House Speaker Nancy Pelosi,\n> Treasury Secretary Henry Paulson and other top officials and lawmakers\n> -- clears a hurdle to the passage of some small bilateral trade deals.\n> And it could ultimately smooth the way for broader trade measures such\n> as renewing President Bush's soon-to-expire authority to negotiate\n> trade deals without threat of congressional amendments, as well as a\n> new global trade agreement now being negotiated in the Doha Round of\n> world trade talks.\n>\n> Lawmakers said the agreement would help provide broad bipartisan\n> support in Congress for pending agreements with Peru and Panama. But,\n> they said other trade measures, including pacts with Colombia and South\n> Korea, involve other issues that haven't been worked out.\n>\n> In addition to including new labor and environmental principles, the\n> deal calls for expanded access for developing countries to generic\n> drugs, a priority for Democrats, who say efforts by brand-name drug\n> makers to protect their markets have put many medicines out of reach in\n> poor countries.\n>\n> \"This is a major breakthrough in what we've been fighting for ... to be\n> sure that globalization opens up for many more people, including\n> workers,\" said Rep. Sander Levin (D., Mich.), one of the negotiators.\n> Before Democrats were in a position to influence the debate, he said,\n> \"I think Republicans were resisting a necessary trend to spread the\n> benefits of trade.\"\n>\n> The deal also shows that, for all the squabbling between the White\n> House and Capitol Hill on Iraq, the two sides have continued to find\n> ways to work together on other issues. Beyond trade, administration and\n> congressional leaders are feverishly negotiating to try and reach an\n> agreement this month on immigration overhaul.\n>\n> While the trade pact has the solid backing of congressional leaders,\n> any specific trade legislation could still face strong opposition among\n> rank-and-file lawmakers and labor groups.\n>\n> The drug industry trade group, Pharmaceutical Research and\n> Manufacturers of America, declined to comment until it has reviewed the\n> final agreement. But objections from the powerful lobby -- which\n> succeeded this week in killing a proposal to ease rules for\n> pharmaceutical imports -- would complicate prospects for passage.\n>\n> U.S. Trade Representative Susan Schwab said, even with the changes\n> related to generic drugs, pending trade agreements would improve\n> protections for intellectual property abroad, including brand-name\n> pharmaceuticals. \"This is a compromise,\" she said. The drug provisions\n> apply to the pacts with Panama, Peru and Colombia, but not Korea, she\n> said.\n>\n> The push for free trade has been complicated by the rising U.S. trade\n> deficit. Yesterday, the Commerce Department said the country's overall\n> deficit surged to a six-month high of $63.9 billion in March, party\n> because of a jump in oil imports. The report is causing economists to\n> scale back estimates of first-quarter growth -- and is fueling new\n> criticism from Democratic lawmakers of the Bush administration's trade\n> policies.\n>\n> The deal would require that core international labor standards be\n> incorporated into trade pacts and would enforce those commitments with\n> the same sanctions used to back up business-backed priorities. In the\n> case of Peru, the changes will be accomplished through amendments that\n> won't require already agreed-to texts to be reopened, a congressional\n> official said. The Panama deal, though largely completed, was left open\n> to accommodate any compromise that might be struck by the White House\n> and Democratic leaders.\n>\n> The agreement isn't meant to open U.S. laws to challenge under the\n> strengthened labor commitments. But it doesn't include a specific\n> assurance against that, according to the congressional official.\n>\n> --John McCary contributed to this article.\n>\n> ---------------------------------\n> Thiru Balasubramaniam\n> Geneva Representative\n> Knowledge Ecology International (KEI)\n> voice +41.22.791.6727\n> fax +41.22.723.2988\n> mobile +41 76 508 0997\n> thiru@keionline.org\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n>\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}