{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Helena Crenshaw\" <pifcfmachinegew@cfmachine.com>", "subject": "Summer is coming, time to tone up", "body": "\nJoin the Anatrim revolution\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting product for corpulent people is now available – As were seen on CNN.\n\n\nCan you count up all the cases when you plead to yourself to do anything for being rescued from this desperately growing number of kilos? Fortunately, now no great offering is necessary. With Anatrim, the ground-breaking pound-melting blend, you can achieve naturally health mode of life and become really slimmer. Just look at what people write!\n\n\n\n\"It’s unbearably difficult to admit it but I was awfully addicted to food. \n\n\nI swallowed up all this trash \n\n\nand just could not stop. \n\n\n\n\nThis fatal passion passed away after I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food disappeared, \n\n\nspirits increased and I’m the happiest person in the world 27 pounds in 2.4 months. \n\n\n\n\nSo, I can tell you now I became the happiest person!\"\n\n\n\n\n\nSilvia D., New York\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nIt’s difficult to fancy how I detested being derided at school. \n\n\n\n\nI detested the weight and I hated myself. \n\n\nAfter trying many different remedies I found out about Anatrim. \n\n\n\n\nIt literally dragged me out of this awful nightmare! The very sincere thanks to you, my friends.\"\n\n\n\n\n\nDave Klark, Chicago\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – more eating – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne of my friends showed me web page and I asked for pack of Anatrim right off. \n\n\nThe result was excellent, my appetite came to admissible level, I was often in good spirits, and, certainly, I tightened my belt with no regrets. And the sex became fantastic, too!\"\n\n\n\n\n\nLuis\n\n\n\n\n There are lots of sincere gratitudes delighted people leave after taking Anatrim. Don’t you gonna join the thousands and thousands of slim women and men and try this original appetite suppressing energy raising product now!\n\n\nDo not decline the chance!\n\n\n\n\n"}