{"category": "ham", "to_address": "\"=?ISO-8859-1?Q?Tommi_Inkil=E4?=\" <tinkila@paju.oulu.fi>,\n   \"=?ISO-8859-1?Q?Sami_Ky=F6stil=E4?=\" <skyostil@kempele.fi>,\n   \"Joonas Kerttula\" <jokerttu@paju.oulu.fi>", "from_address": "\"Jason Spiro\" <jasonspiro4@gmail.com>", "subject": "Could you please forward this proposed license to Teosto? (was: Re: Choosing a license for Frets on Fire songs)", "body": "2007/3/28, Matthew Johnson  wrote:\n> On Tue Mar 27 20:54, Jason Spiro wrote:\n> > 2007/3/27, Don Armstrong  wrote:\n> > >On Tue, 27 Mar 2007, Jason Spiro wrote:\n> > >> Maybe if debian-legal or I wrote the license (I have never written a\n> > >> license before, but maybe I could modify the MIT license) we could\n> > >> get Teosto to agree on more liberal terms than we would get if\n> > >> Teosto wrote one?\n> > >\n> > >The following is what I would use if I were to license my own\n> > >compositions[1] for distribution in Debian:\n> > >\n> > I'm sure you realize Teosto would consider the BSD license far too\n> > liberal, and forbid it. :-) Seriously, do you think my idea of writing\n> > a license has merit?\n>\n> Such a licence would not get the songs in main, though. I imagine it\n> would fail DFSG 6 and possibly 3. It would get them in non-free though\n> which would allow the rest of the game in contrib or, if we managed to\n> find some free songs to go with it, in main.\n\nTommi has told me in a private email he doesn't want people to modify\nhis music, which is reasonable although it means the music won't be\nDFSG-Free.  I have cobbled together a possible license you could use.\nThe license text is pasted below.  (It is based mostly on parts of the\nBSD and MIT/Expat licenses and snippets from the GPL, CC-BY-ND and\nOpen Font licenses and some of my own words.  I hereby release the\nlicense text itself to the public domain.)\n\nTommi, Sami, Joonas, do you think Teosto might possibly be willing to\nlet you distribute the music under the terms below?  If so, could you\nplease ask Teosto's lawyer?  The music can't get into the Debian\nnon-free repository until we get permission to distribute it.\n\nTommi, the license lets people modify the music, but not rearrange it\nor change the lyrics.  That ensures people will be able to convert it\nfrom one audio format into another and such, and to be able to change\nthe speed and/or pitch in case some Frets On Fire \"Turbo Mode\" mod\ncomes out that allows that.  Are you comfortable if your music is\nreleased under those terms?  Cheers, --Jason\n(License text follows.)\n\nCopyright (C)  \n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this work (the \"Work\") to use, modify, copy, publish,\ndistribute, publicly perform, and/or sublicense copies of the Work,\nand/or to charge a fee for the physical act of transferring copies,\nand/or to offer warranty protection for a fee, and/or to permit\npersons to whom the Work is furnished to do all of the aforementioned\nactions, subject to the following conditions:\n\n* Persons distributing the Work to the general public may only do so\nif the Work is distributed and/or bundled with game software.\n* No person may musically rearrange the Work or modify the lyrics of\nthe Work unless that person obtains permission to do so from either\nthe author or the copyright holder.\n* The above copyright notice and this permission notice shall be\nincluded with all copies or substantial portions of the Work.\n\nTHE WORK IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE WORK\nOR THE USE OR OTHER DEALINGS IN THE WORK.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}