{"category": "ham", "to_address": "\"Victor Bennett\" <bennett@haas.berkeley.edu>", "from_address": "\"Gabor Grothendieck\" <ggrothendieck@gmail.com>", "subject": "Re: [R] dynamically specifying regressors/RHS variables in a\n\tregression", "body": "Using the builtin data frame CO2 this regresses uptake, which is\nvariable number 5, against each consecutive pair of variables:\n\nfor(i in 1:3) {\n   idx <- c(i, i+1, 5)\n   print(lm(uptake ~., CO2[idx]))\n}\n\n\n\n\nOn 5/5/07, Victor Bennett  wrote:\n> Does anyone know if there is a way to specify regressors dynamically\n> rather than explicitly?\n>\n> More specifically, I have a data set in \"long format\" that details a\n> number of individuals and their responses to a question (which can be\n> positive, negative, or no answer).  Each individual answers as many\n> questions as they want, so there are a different number of rows per\n> individual.\n>\n> For each number of questions, I want to run a logit on all the\n> individuals who saw that many questions, predicting whether they\n> choose to answer anymore afterwards by their choices on the earlier\n> questions.\n>\n> the second logit would look like\n> answered_only_2~answer_1_pos+answer_1_neg+answer_2_pos+answer_2_neg\n>\n> This will result in over 100 regressions, with different numbers of\n> RHS variables.  I'd like to iterate over the sequence of numbers and\n> run a logit for each, but I can't find any means for dynamically\n> generating the RHS variable from an array, or vector.  The only way I\n> can think of to write the function would still require the same number\n> of RHS variables in each regression.\n>\n> Is there a way to dynamically generate the right hand side?\n>\n> ______________________________________________\n> R-help@stat.math.ethz.ch mailing list\n> https://stat.ethz.ch/mailman/listinfo/r-help\n> PLEASE do read the posting guide http://www.R-project.org/posting-guide.html\n> and provide commented, minimal, self-contained, reproducible code.\n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}