{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for May 7th - May 13th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n                       Last Quarter Moon, May 10,  12:28 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    Distinguishing between your wants and your needs is an essential part of realizing your dreams.  While many of us may want a Jaguar or a new wardrobe, or a number of other things, we don't necessarily need to have them in order to live a joyful, productive life.\n    There is one mantra many of us need to be reminded to incorporate into our life -- \"All I have is all I need.\"  Now I want to make it clear that this mantra doesn't mean that you can't desire or obtain material things in your life.  You certainly can, and let me reiterate that we are going to make this happen for you.  But while we wait patiently for our desires to take hold, most of us need to be reminded of the abundance that we do have.  This perspective brings us the issue of the water in the glass.  Should we focus on what we don't have or on what we do have?\n    It is important to appreciate the positive things around us.  Recognizing our assets and giving gratitude for them makes for a very powerful situation to live joyfully in the present as well as to set the stage to attract more of what you want.\n    The easiest way to do this is to write down in a journal at least three things you are grateful for each day.  I speak from experience when I say that after a week of doing this simple exercise you will feel happier. Should you run into an obstacle that is preventing you from realizing one of your dreams, take out your journal and read down the list of things you wrote and you will feel a force of positive energy surge through your body.\n    Remember above all, it is the person you become, and not the things you achieve or the things you acquire that is most important.\n    The Universe is on your side now.  You are moving forward.\n    As always, Bethea and I are here to help you.\n\n                      Until next week,                          \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n\n                 \n\n\n    Power planet Pluto and love planet Venus make a dramatic link on the 7th, bringing intense feelings to the surface.  You may think you've been keeping a secret, but now your feelings are likely to be written all over your face.  Communications planet Mercury links up with confusing Neptune on the same day, so say as little as possible, Memo.  Venus slips into Cancer on the 8th and family will be your focus.  Mercury enters its home sign of Gemini on the 11th and helps you to think fast and sidestep any awkward questions.\n\n\n\n\n\nMemo             May 7 - May 13             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Sunday is going to be your lucky day for this period.  And your Lucky Numbers are 06, 12, 23, 22, 37, 44.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nMay 7th for Memo\n\n\n\n\n\n\n\n\n\n    Enthusiasm about a cause involving children could send you out to help others.  Your dedication and upbeat attitude will more than make up for your lack of experience in the work.\n\n\n\n\n\n\n\n    You could be a bit moody today, making it difficult to collaborate with others.  If someone seeks out your company, explain that you'd rather go solo right now.  They're bound to understand.\n\n\n\n\n\n\n\n    Physical activities which improve your health and well-being are likely to be a drawing card for you today, my friend.  Self-improvement projects can alter your outlook for the better as well.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMay 8th for Memo\n \n \n \n \n \n \n \n    Now is a wonderful time to stimulate your creativity.  Attend a play, enroll in an art class, take singing lessons, or sign up for dancing instruction.  It's never too late to learn something new.\n\n\n \n \n\n \n \n    Chances are good that your diligent work will be rewarded.  By staying busy you set a good example.  Not many people are able to be neat and hurry at the same time, but you make it an art.\n\n\n  \n \n \n    You may enjoy helping someone who is very appreciative of your generosity.  This person may be full of compliments and gratitude and even much good humor.\n\n \n \n\n \n \n\n\n\n\n    Bringing your life into balance will require commitment and dedication.  You will also need to adopt or develop a healthy strategy.  Your daily responsibilities will seem less restrictive.\n \n \n\n \n \n\n\n    Your mind and body are strongly connected right now.  Feeling good  is as simple as eating nourishing foods.  Fruits and vegetables make your skin glow and eyes sparkle.\n \n \n \n \n\n\n    If you receive any correspondences regarding the health concerns of relatives or associates, you would do well to respond appropriately.  Don't overload yourself with work responsibilities.\n  \n\n\n\n\n\n\n\n\nMay 9th for Memo\n\n \n \n \n\n\n \n \n    Patience pays off if you have a problem that needs to be solved. Being on time can make a difference if you are meeting someone who can perform a service for you.\n\n\n \n\n \n \n    Don't be afraid to express your thoughts and opinions now, my friend, as the interaction is likely to solve long-standing problems quickly and easily.  Your resolve and courage rubs off on others.\n\n \n \n\n\n\n\n\n\n\n\n\nMay 10th for Memo\n  \n \n\n\n\n \n \n    You may have some worries concerning a major appliance.  Please don't hesitate to have an expert look at it.  However, be sure to take more than one bid if it comes to major repairs.\n\n\n \n\n \n \n    An unexpected windfall in the form of an insurance settlement or refund could fall into your lap.  Put the money toward a trip you've been longing to take for some time.  You deserve a treat.\n\n \n\n \n \n\n\n\n\n    It's never productive to let unresolved matters disturb you.  If something is bothering you, I hope you'll confront it now and work out a solution quickly.\n  \n \n\n\n\n\n\n\n\n\nMay 11th for Memo\n  \n \n \n\n\n \n \n    The possibility that you might find yourself with too much work and not enough time could become a reality.  It's time to sit down and make up a schedule and a list of priorities.\n\n\n \n\n\n \n \n    If you've been looking for ways to spend quality time with your family or loved ones, why not attend school, church or special community events?  A calm, serene, more reasonable outlook lends patience.\n\n \n\n\n \n\n\n\n\n\n    Insights you have gained into your own motivations and emotions will be helpful when giving advice or counsel to others today.  Your philosophic outlook has the right blending of caring and common sense.    \n \n\n\n\n\n\n\n\n\nMay 12th for Memo\n  \n \n \n \n\n \n \n    Excess intellectual enthusiasm could cause you to ask questions that offend your friends at this time.  It may be better to put that energy to a more constructive use by keeping a diary.\n\n\n \n \n\n \n \n    It may not be possible to combine family or domestic duties with your work and professional or social obligations.  You will probably have to choose one or the other.  Strive for clear, unbiased thinking.\n\n \n\n\n \n \n\n\n\n\n    Your schedule may be interrupted, but for only the very best of reasons, so you won't mind.  Someone who cares about you will extend a rather spontaneous invitation.   \n\n \n \n\n\n    Your ability to come up with viable compromises helps you to win points with important figures.  If someone comes to you with a problem, do your best to offer solutions.\n \n \n\n \n\n\n    An influential figure could single you out for favorable attention. Seize this opportunity to move on to another challenge.  The higher you aim, the greater your victory will be.\n\n\n\n\n\n\n\n\nMay 13th for Memo\n \n \n \n \n \n\n \n \n    Romance and close friendships could be very confusing for you at this time.  As long as you hang on to your commonsense and ask lots of questions, everything should be okay.\n\n\n  \n\n \n \n    Now is a good time to look at new insurance policies.  Shop around and see if there's anyone who can offer you more than what you are getting.  How about paying less for what you already have?\n\n \n\n\n \n \n\n\n\n\n\n\n    All eyes are focused on you today, my dear.  It may be a good idea to put on your most attractive outfit.  This will give you the confidence you need to put forth a great performance.\n \n \n\n \n \n\n\n    I sense that you may be trying to do too much now, my friend.  It's often best to first set your priorities and develop a plan, so that you don't waste your time and energy.   \n\n \n \n\n\n    Family participation in school events, religious gatherings and other community affairs are favored at this time.  My friend, thoughts of loved ones who live faraway could cause you to write or travel today.\n \n\n\n\n\n\n\n\n    It looks like a constructive week ahead, Memo – after a few bumps in the road first….\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}