{"category": "ham", "to_address": "parrot-porters@perl.org", "from_address": "chromatic <chromatic@wgz.org>", "subject": "Parrot 0.4.12 \"Of the Caribbean\" Released", "body": "    As I sailed into Shadow, a white bird of my desire came and sat upon my\n    right shoulder, and I wrote a note and tied it to its leg and sent it on\n    its way.  The note said, \"I am coming,\" and it was signed by me.\n\n    ...\n\n    The sun hung low on my left and the winds bellied the sails and propelled\n    me onward.  I cursed once and then laughed.\n\n    I was free and I was running, but I had made it this far.  I now had the\n    chance I'd wanted all along.\n\n    A black bird of my desire came and sat on my left shoulder, and I wrote a\n    note and tied it to its leg and sent it off into the west.\n\n    It said, \"Eric--I'll be back,\" and it was signed: \"Corwin, Lord of Amber.\"\n\n    A demon wind propelled me east of the sun.\n\n    -- Nine Princes in Amber, Roger Zelazny\n\nOn behalf of the Parrot team, I'm proud to announce Parrot 0.4.12 \"Of the\nCaribbean.\" Parrot (http://parrotcode.org/) is a virtual machine aimed at\nrunning all dynamic languages.\n\nParrot 0.4.12 can be obtained via CPAN (soon), or follow the\ndownload instructions at http://parrotcode.org/source.html.\nFor those who would like to develop on Parrot, or help develop\nParrot itself, we recommend using Subversion or SVK on the\nsource code repository to get the latest and best Parrot code.\n\nThe next release will take place on 19 June 2007.\n\nParrot 0.4.12 News:\n- Build:\n + even more refactorings and improvements in configuration system\n + improved tests and documentation for configuration system\n- Languages:\n + Updated abc, PHP (\"Plumhead\"), Lua, Tcl\n + Reclaimed Lisp\n- Design:\n + new PMC PDD draft partially completed\n- Implementation:\n + continued implementation of PDD 15 (Objects)\n + minor garbage collector and memory management improvements\n + several memory leaks resolved\n + extended support for compilers other than GCC\n + improved C++ compiler compatibility\n + enhanced support for Solaris, non-MSVC Win32, and other platforms\n\nThanks to all our contributors for making this possible, and our\nsponsors for supporting this project.\n\nEnjoy!\n\n"}