{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "This Week on Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on Reliable Sources: \n\nParis Deja Vu\n\nFor those who thought the\nmedia mania over Paris Hilton was on a three week hiatus while\nshe served a jail sentence were sorely disappointed this week\nwhen the celebutante was released from jail early, only to be\nsent right back.  The ensuing media mayhem hit epic\nproportions.\tWhy did the media place such importance on this\nthat a shakeup at the pentagon got just a quarter of an hour's\ncoverage so the networks could race back to the Paris stakeout?\nWill we ever hear the last of the heiress?\n\nScooter\nLibby Double Standard?\n\nWhile Paris Hilton's jail\ntime got practically non-stop coverage, the sentencing of\nScooter Libby seemed to barely get any media notice.  But while\nthe media dished about Paris representing a double standard,\nwhat about the pundits who were so hot on \"rule of law\" during\nClinton's purjury testimony that are now calling for Libby to\nbe pardoned?\n\nRating the Debates\n\nWe'll\nlook at this week's big debates in New Hampshire and talk about\nwhy the nightly newscasts seem not to be paying much attention\nto them at this stage in the game.  We'll look at how the the\nspin cycle launches into action to declare the winners and\nlosers nearly as soon as the last question is asked.\n\nPlus,  One columnist is suggesting we're seeing a\nlittle bit too much of the candidates' wives these days, We'll\ntalk about coverage of cleavage on the campaign trail.\n\nJoin us this Sunday and every Sunday at 10am ET / 7am PT\nfor our critical look at the media! \n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}