{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTUESDAY 3 JULY 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM GAVIN ESLER\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nToday's Quote for the Day:\n\n\"I love you Hugh Grant. He put my two kids through school and gave us the chance of a better life. Thanks to him we bought a new house, Rolex watches, a Rolls-Royce, a Mercedes and diamonds\" - Divine Brown, the Hollywood call-girl whose brief encounter with the British actor brought her fame and fortune.\n\n\nIn tonight's programme:\n\n\nTerror Cells\n\nWe'll have the latest on the terrorist attacks in Glasgow and London. We're working on a number of stories on the terror plots and how some of the suspects may have been radicalised. Can't say any more for now. But do watch the programme. \n\n\nConstitution\n\nToday some sweeping proposals on constitutional change from Zombie Brown. Is this to make government fit for the 21st century or to address the West Lothian question a particular problem for a Scottish Prime Minister? We'll be asking Jack Straw what it is all about?\n\n\nPardon Me President Bush\n\nYesterday Scooter Libby had a let off. President Bush ensured that he did not go to jail. Remember Scooter was the Vice President's chief of staff convicted after the wife of Ambassador Wilson was outed as a CIA agent. Tonight we hear from that Ambassador - Joe Wilson - about why he is not happy with the President's actions.\n\n\nEnvironment Agency\n\nAnd The \"Polluter Pays\"... it's a guiding principle of today's environment laws. But has the Environment Agency - still reeling from criticism over its handling of the floods - also blown its chance to force one of the world's largest chemicals companies to pay for pollution dumped here in the UK - leaving the British tax payer to foot a multi million pound bill? Susan Watts has an exclusive report. \n\n\nAnd finally:\n\nToday's Joke Fit For An Eleven Year Old comes from Newsnight viewer Mike Cohen. \n\n\nIn Jerusalem, a Reuters journalist heard about a very old Jewish man who had been going to the Wailing Wall to pray, twice a day, everyday, for a long, long time. So she went to check it out. She went to the Wailing Wall and there he was! She watched him pray and after about 45 minutes, when he turned to leave, she approached him for an interview.\n\n\"I'm Rebecca Smith from Reuters. Sir, how long have you been coming to the Wall and praying?\"\n\n\"For about 60 years.\"\n\n\"60 years! That's amazing! What do you pray for?\"\n\n\"I pray for peace between the Christians, Jews and the Muslims. I pray for all the hatred to stop and I pray for all our children to grow up in safety and friendship.\"\n\n\"How do you feel after doing this for 60 years?\"\n\n\"Like I'm talking to a ****** wall.\"\n\n\nNewsnight is at 10.30pm on BBC2. \n\n\nGavin \n\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}