{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "740a 6/14 Update: Telemetry restored but Russian computers still down", "body": "\n\n\n\n\n740a 6/14 Update: Telemetry restored but Russian computers still down\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 55\nPosted: 7:41 AM, 6/14/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-52 (06/13/07): Russian computer troubleshooting continues\n   SR-53 (06/13/07): Spacewalk ends\n   SR-54 (06/14/07): NASA considers shuttle mission extension if Russian computer glitch not resolved soon\n   SR-55 (06/14/07): Russian engineers troubleshoot computer problem; telemetry restored; false fire alarm sounds\n\n=================================\n\n7:41 AM, 6/14/07, Update: Russian engineers troubleshoot computer problem; telemetry restored; false fire alarm sounds\n\nRussian engineers cut off U.S. power and attempted to restart critical computers in the Zvezda command module of the international space station today using power from Russian systems. While the system showed a \"heartbeat,\" flight controllers said, they were unable to coax the machines into rebooting during a pass over Russian ground stations.\n\nOne orbit later, however, engineers were able to re-establish communications with a central computer in the command module and through it, another computer in the Zarya propulsion and storage module. And for the first time since the trouble began earlier this week, engineers began receiving a full stream of telemetry from the station to help troubleshoot the issue.\n\nThe station's guidance and navigation computers must be restarted before the shuttle Atlantis undocks next week to provide the necessary control over critical systems. All three guidance computers, along with three command-and-control computers, crashed earlier this week amid work by the Atlantis astronauts to install a new U.S. solar power array.\n\nRussian engineers said Wednesday the new array, which generates some 22 kilowatts of usable electricity, might have caused a subtle change in the station's power grid that, in turn, affected the control computers. So far, that remains speculation.\n\n\"In Moscow, they've been working overnight with their team in order to come up with a troubleshooting plan,\" NASA flight director Holly Ridings said early today. \"They were able to re-establish communications with the central computer. Downstream of that, they have re-established communications with the computer in the FGB (Zarya). Certainly, a lot of good progress overnight by our Russian colleagues.\"\n\nEarlier today, space station commander Fyodor Yurckikhin and flight engieneer Oleg Kotov tried to help flight controllers diagnose the problem, looking for signs of any patterns in flashing error messages. The computers seemed locked in a reboot cycle.\n\n\"Fyodor, I'm sorry, but so far here on the ground we haven't come together with a brainstorm,\" mission control, speaking through an interpreter, radioed the station.\n\n\"Yes, I understand,\" Yurchikhin replied.\n\n\"Hopefully we'll find a decision.\"\n\n\"Well, that's a highly desirable outcome!\" Yurchikhin joked.\n\n\"Are you up by yourself, or is Oleg next to you?\" mission control asked.\n\n\"Of course he is up and running, of course he is worried,\" Yurchikhin said.\n\n\"Guys, we are truly sorry.\"\n\nThe Russian space agency does not have its own communications satellites. To troubleshoot the computer problem, Russian engineers have to wait until the station is within line-of-site of Russian ground stations to downlink telemetry and beam up commands.\n\nDuring a communications pass around 7 a.m., flight controllers reported some success, telling the cosmonauts \"at last, for a change, after many hours without telemetry we finally have telemetry downstream.\"\n\n\"Well, that's great news,\" Yurchikhin replied. \"I feel much better.\"\n\n\"Of course, I understand.\"\n\nA few moments later, around 7:23 a.m., a fire alarm sounded in the Zarya module as the Russians were attempting to switch the crew's Soyuz lifeboat from internal power to station power. The Soyuz was put on internal power late Wednesday as a precaution.\n\nA fire alarm sounded in the Zarya module Tuesday when the computer problems first began occurring. There were no signs of a fire then or this morning.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}