{"category": "spam", "to_address": "Mail <mail@flax9.uwaterloo.ca>", "from_address": "Robert Frederick <lghka@gizmos2go.com>", "subject": "FYEO", "body": "\n\nCan't have sex like you had 10 years ago? Looking for an effective and cheap solution?\nOur pharmacy\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nOur pharmacy\nDon't miss your chance to recover your health!\nWith best regards,\nRobert Frederick\n \n \nU menia davno byli podozreniia, chto Nastoiatel sklonen k Mirovozzreniiu nabliudatelej. Ia zadumalsia. chuzhak iz-za Sfery ne mozhet znat legendy, a samo poiavlenie zasfernikov v Tenevom Mire Habusa, kak my znaem na opyte, iavliaetsia chistoj sluchajnostiu. Razve chto na Paru ladonej dlinnee ee sobstvennogo zhalnika, da golovka rukoiati bolee Shirokaia pod lapu dal-rokta, chtob ne soskalzyvala. \nTy Proboval kogda-nibud meniat svoiu vneshnost soznatelno? Ty eto tolko chto videla. Vy nashli ee, starshina? neterpelivo sprosil ia, propustiv vse Ostalnoe mimo ushej. Skolko sil i nervov udalos by sekonomit. Ne obizhajsia, no chto-to ty ploho soobrazhaesh s utra. Ia byl gotov k tomu, chto proizoshlo. O net, tolko ne eto, prostonal Kvin, gorestno zakatyvaia svetlo-serye Glaza, Vse eti bytovye podrobnosti, sovershenno ne imeiushchie smysla dlia Nastoiashchego muzhchiny, vse eti dosuzhie zhenskie spletni. Oni proigryvali Oba, medlenno, no neizbezhno. pripomnil ia, pervyj raz ia uslyshal eto slovo ot leshuka. \nChem menshe problem pri vstreche s shefirom, tem Luchshe. Pohozhe, Vestniki tmy reshili zaniatsia nashim podopechnym vserez, a znachit, i nam Pridetsia priniat dopolnitelnye mery predostorozhnosti. Golos ih mudrosti vybral vas vseh tebia, Bigmana, Otshelnika, Celitelia. No vse puteshestvie, do Kruga Prichastiia i obratno, dolzhno zaniat ne bolshe shesti-semi dnej, a dlia menia eto ne Tak uzh mnogo. ejisuminyon XFNaWHVCQlZRUUgcRkNURVdBWFpeHFBV\n \n\n\n"}