{"category": "spam", "to_address": "<simpsons@flax24.uwaterloo.ca>", "from_address": "\"Panos Danilakis\" <panos.danilakis@gmail.com>", "subject": "Computer Science and Computing: The WSEAS Press publishes high quality Textbooks for Educational Purposes or Research Monographs (see below)", "body": "(write WSEAS in the Subject, when you reply)\n\nDear Prof.Dr.Tudhope,\n\nThe usual great participation in the WSEAS Conference on Computers\n(July 2007) does not leave us margins to accept more papers. So, we\ncannot give any other prolongation in the deadline.\n\nTherefore, if you did not catch the deadline for the WSEAS Conference\non Computers (July 2007), you can upload now your paper(s) to the\nWSEAS Conferences on Computer Science(August 2007), www.wseas.org,  in\nVouliagmeni Beach (20Kms only outside Athens) and 15 minutes by car\nfrom the Athens International Airport.\nLast year in Vouliagmeni , we had received more than 1200 papers\nand from them only 600 papers were accepted and presented in this\nmulticonference of 2006.\nSee: http://www.worldses.org/reports/10th\n\n\nVouliagmeni Beach, Athens, Greece, August 24-26, 2007 \n\n* 7th WSEAS Int. Conf. on APPLIED INFORMATICS AND COMMUNICATIONS\n(AIC'07) http://www.wseas.org/conferences/2007/athens/aic\n\n* 7th WSEAS Int. Conf. on SIGNAL PROCESSING, COMPUTATIONAL GEOMETRY\nand  ARTIFICIAL VISION (ISCGAV'07)\nhttp://www.wseas.org/conferences/2007/athens/iscgav\n\n*7th WSEAS Int. Conf. on SYSTEMS THEORY AND SCIENTIFIC COMPUTATION\n(ISTASC'07)\nhttp://www.wseas.org/conferences/2007/athens/istasc\n\n\nPlease, upload your paper now\nuntil May 15.\n              www.wseas.org\n\t\t\t  \nNone extension in the deadline (May 15, 2007) will be given.\n\n\nAnother really important conference, with several Plenary and Invited\nSpeakers, Special Sessions, etc... is the\nEUROPEAN COMPUTING CONFERENCE that is co-organized by IARAS and WSEAS\nwith the Co-Sponsorship of Several European Universities\nhttp://www.iaras.org/ecc2007/\n\nFor the European Computing Conference the last day that you can upload\nyour paper is also: MAY 15, 2006.\nNone other extension will be given.\n(Several European Projects will be presented by IARAS Staff)\n\n\nFor all the other WSEAS Conferences of 2007, the deadlines exist on\nthe web and NONE extension will be given. \nFor example, the WSEAS Conferences of October 2007 in Arcachon, France\nhave deadline: June 15 and none extension will be given.\n\n\n\nWSEAS Press: \n=============\nNew Books have been published by WSEAS Press that have already promoted\nsuccessfully in several libraries worlwide. Some of them are excellent\nscientific monographs and textbooks. We are waiting to send us your\nBook for publication.\nhttp://www.worldses.org/books/index.html\n\n\nNew Editions (April 2007)\n----------------------------\n\n \"Heat and Mass Transfer in textiles\", Author: A. K. Haghi, pages 240,\nprice: 80 EUR, (contact us for details)\n\n\n\"Eddy Currents Modelling in Thin Layers\"\n Author: John K. Sakellaris, pages 210, price: 50 EUR (details) \n\n\n\"Experimental Analysis of Geotextiles and Geofibers Composites\"\nAuthor: A. K. Haghi, pages 102, price: 50 EUR, (contact us for\ndetails) \n\n\n\"Multimedia Systems and Signal Processing\", Editors: Anping Xu et.\nel., pages 190, price: 70 EUR\n\n\n\"Energy and Environment II\"\n Editors: Jurij Krope (Slovenia), Laszlo Garbai (Hungary), Dorde Kozic\n(Serbia), Darko Goricanec (Slovenia), pages 396, price: 80 EUR,\n(contact us for details)\n\n\"Studies in Mechanics, Environment, Geoscience\", Editors: Jurij Krope\n(Slovenia), et all, pages 365, price: 80 EUR (contact us for details)\n\n\"Applied Computer Science\", Editors: Anping Xu et. el., pages 670,\nprice: 130 EUR\n\n\"Proceedings of IMCAS'07 and Procedings of ROCOM'07\", Editors: Anping\nXu et. el., pages 330, price: 80 EUR\n \n\nAlso: under final preparations\"\n\n\"Finite Differences\"\n Editors: Nikos Mastorakis, Olga Martin (under final preparations)  \n\n\nThe WSEAS Press publishes high quality Textbooks following one of the\nnext Policies:\n-------------------------------------------\nPOLICY 1):  The WSEAS Press publishes high quality Textbooks in a\nparticular number of copies and can deliver them to the author(s) for\npromoting themselves in the international university community.\nWSEAS can also undertake to include them in several international\nindexes. \n\nReview process:  The full text is sent to five international reviewers\nand after 3 months the author(s) receive(s) the reviewers' comments\nwith the recommendation of the Associate Editor for publication or\nnot. At the same time interval of these 3 months the author(s) must\nnot negotiate(s) the publication of the book with any other\ninternational publisher.\n\n\nPOLICY 2):  The WSEAS Press can publish them and can promote them\ninternationally through the usual WSEAS Channels.\nWSEAS can also undertake to include them in several international\nindexes. \n\nReview process:  The full text is sent to five international reviewers\nand after 3 months the author(s) receive(s) the reviewers' comments\nwith the recommendation of the Associate Editor for publication or\nnot. At the same time interval of these 3 months the author(s) must\nnot negotiate(s) the publication of the book with any other\ninternational publisher.\n\n\n\n\n\nADDITIONAL FEATURES FOR THE WSEAS CONFERENCES OF AUGUST 2007\nwww.wseas.org\n\n\n1) Publication of the Proceedings in 3 media: hard-copy, CD, E-Library\n----------------------------------------------------------------------\n(A) Hard-Copy Proceedings (Book) with ISBN and ISSN indexed by the\nmajor Citation Indexes: www.worldses.org/indexes\n\n(B) CD-ROM Proceedings with pages' numbers with ISBN and ISSN \n    indexed  by the major Citation Indexes: www.worldses.org/indexes\n\n(C) E-Library:  http://www.wseas.org/online\n\nand possible:\n\n  (D) JOURNAL PUBLICATION: Authors of high - quality papers of\narchival value are invited to send extended versions of their papers\nto the international WSEAS Journals after the conference. Necessary\nCondition is the presentation of the paper in the congress\n\n\n2) A very strong and important feature is that the WSEAS is going to\ngive you a new username and password WITHOUT EXPIRY DATE for on-line\naccess in the WSEAS Conference proceedings FOR EVER.\n\n       \n3) We have already arranged and each of you will receive in the CD-ROM\nProceedings, not only the Proceedings of these WSEAS conferences of\n2007 , but also the Proceedings of the same conferences in 2006 in\nGreece. Except the CD-ROM proceedings you will also receive Books\n(Hard-Copy) Proceedings with all the papers of the Multiconference \n  *** (MORE than 600 pages per volume!!!) ***\n\n4) Because we will maintain the same policy in 2008, your paper will\nbe available and readable in the CD-ROM that we will distribute in\nGermany in August of 2008 where we will have the same conferences.\n \n\n5) After the presentation of your paper we are going to consider it\nfor possible publication in the WSEAS Journals that, as you know,\nparticipate in all the International Scientific Indices (Elsevier,\nScopus, EI, Compendex, INSPEC, CSA .... see: www.worldses.org/indexes \n  )\n\n\n6) Rich cultural and social part as usual in WSEAS events.\nThe importance of these conferences can be proved by the impact\nof these conferences in 2006: See, please\nhttp://www.wseas.us/reports\nSee other reports at:  http://www.wseas.us/reports\n\n\n7) The conference Books (Hard-Copy Proceedings), CD-ROM proceedings\nand (Journals with selected papers) published by WSEAS Press continue\nto sell for a long time after the meeting has taken place. This is\nanother demonstration of the prestige the scientific community\nattribute to the meetings organised by the WSEAS.\n\n\n8) WSEAS has arranged collaboration with Hindawi Publishing Corp\nhttp://www.hindawi.com and Springer Verlag,\nso, several papers will appear in Volumes of Hindawi Publishing\nand Springer Verlag. The authors can select between WSEAS Journals,\nSpringer Verlag Volumes and Hindawi Publishing Company, however, this\nrequires presentation of your paper in the conference, submission\nof extended version after the conference and additional review and\nrevision. As you can see we have already started a collaboration with\nthe Springer verlag and enhanced and revised versions of these\npresented papers might appear in Springer Verlag volumes after the\nConference.\n\n\nAll the best\n\nPanos Danilakis\n\n\n\n\nATTENTION\n-------------------------------------------------------------------\nIf you do not want to receive messages from the \"WSEAS Working Group\non Computer Science\" any longer, send an email to:\nomikron@worldses.org  where the Subject Line must contain the command: \n\n      STOP COMPUTERS simpsons@wheat.uwaterloo.ca WSEAS\n \n (Do not include this command in the main part of your email, only in\nthe subject please)\n\n"}