{"category": "ham", "to_address": "Sue Rochman <sue.rochman@earthlink.net>", "from_address": "Brendan Hickey <BHickey@law.harvard.edu>", "subject": "Re: [Ip-health] drug naming/patents/exclusivity", "body": "--\n[ Picked text/plain from multipart/alternative ]\nSue -\n\nMany countries, including the UK (see Patents Act 1977, c. 37 s. 2\n(6)) allow individuals to patent new uses of known chemicals,\ngranting a full patent term for the new use.  These types of patents\nare known as Swiss-form claims.\n\nThis type of innovation does happen a fair amount, as the email\nexamples you got demonstrate.  Researchers frequently try out known\nchemicals for new uses, just this morning I heard on NPR that Viagra\ncured jet lag in hampsters.   As for the role of IP, there is an\nargument that allowing patents on new uses of drugs spurs this type\nof innovation.  On the other hand, over-ownership of patents can make\nit difficult for researchers to have access to the drugs they need to\nconduct research on different uses until the drug's original patent\nterm expires.  Swiss-form patents also create problems of increased\nprices and therefore reduced access to new ways of treating\ndiseases.  In the UK, however, this is less of an issue than it might\nbe elsewhere because of nationalized health care.\n\nFinally, it is important to note that drugs are sometimes prescribed\nfor off-label use, which is where a doctor will prescribe a drug for\ntreating something other than an FDA-approved indication.  This means\nthat where there is a cheap generic of a chemical available for\ntreatment of one affliction and a more expensive patented version\nwith an indication for treating another, the doctor could simply\nprescribe the generic for 'off-label' use (even though the chemicals\nmay be identical) and save money for the patient/health care\nprovider.  Using the above example, a doctor might simply prescribe\ngeneric viagra (pretend this is several years down the road) to\nsomeone who wants treatment for serious jet lag symptoms rather than\nprescribing the expensive new patented version that is chemically\nidentical but patented for use in treating jet lag.  How often\ndoctors actually do this I don't know, nor do I know if it is\nconsidered ethical/professionally appropriate.  I do know that drug\ncompanies have historically given a lot of free samples, golfing\ntrips, etc. to doctors.  Perhaps these efforts  encourage doctors to\nprescribe the newer, patented, more expensive versions of drugs - but\nfor a definitive answer to those issues you'd need to look elsewhere\n(I'd ask a doctor).\n\nFeel free to give a call if you have more questions.\n\n-Brendan\n\n___________\nBrendan Hickey\nJD Candidate, Harvard Law School\n\n82 Sacramento Ave, #3\nSomerville, MA  02143\nUnited States of America\n\nBHickey@law.harvard.edu\n(+01) 617-388-8651\n\n\nOn May 19, 2007, at 9:17 AM, Sue Rochman wrote:\n\n> I'm doing a piece on pharmaceutical companies that sell the same drug\n> under two different names for two different uses.\n>\n> The most recent example I am aware of  is Novartis, which makes\n> zoledronic acid (Zometa). Zometa is approved for treating bone mets.\n> Novartis hopes to soon begin selling zoledronic acid as Reclast  for\n> the treatment of postmenopausal osteoporosis. It's the exact same\n> drug,\n> just two different names.\n>\n> I'm curious as to whether anyone knows of any other similar examples.\n> (I know that Wyeth has \"reformulated\" Effexor to sell under a\n> different\n> name for use as a hot flash treatment.)\n>\n> Also, can anyone explain, or recommend someone who can comment on, the\n> benefits that pharmaceutical companies get (patent or exclusivity\n> extensions or otherwise) when they remarket a drug with a new name or\n> for a new use?\n>\n> Thanks,\n> Sue Rochman\n> Freelance Medical/Health Writer\n> sue.rochman@earthlink.net\n> 415-346-0414\n>\n>\n>\n> _______________________________________________\n> Ip-health mailing list\n> Ip-health@lists.essential.org\n> http://lists.essential.org/mailman/listinfo/ip-health\n\n\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}