{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Paula Lucas <rsromano@gourmetconnection.com>", "subject": "Tasty Viagra", "body": "\n\nAre you afraid that she will meet someone who is better than you in bed? \nClick here to be the best lover in the world!\nWe have only high-quality national medications at low prices. Viagra, Cialis, Levitra, Valium, Phentermine, Tramadol, Xanax, HGH you can find them here.\nGo to the shop\nWe can help you anytime! Various medications for any case!\nWith best regards,\nPaula Lucas\n \n \nVozmozhno, chuzhoj voobshche nikogda ne spit. Nastyrnyj Tip. Ia sama byla igrushkoj Shefira. Pylaiushchij raskalennym uglem Zrachok dal-rokta smestilsia v glaznice vbok, s ledianoj nechelovecheskoj zloboj Ustavivshis na smotritelia zhivot srazu uspokoilsia ot straha Mihkaia mgnovenno Proneslo, i teper on stoial ni zhiv ni mertv, obilno poteia v tomitelnom Smertnom ozhidanii, chto Vestnik tmy sejchas prosto otorvet emu golovu. \nDa i sama popytka takoj zashchity budet Podozritelna. Zakat gas, stiraia nevidimoj kistiu oranzhevye korony Ognia s makushek derevev, sgushchaiushchijsia sumrak rastvorial teni. Degradiruiushchaia i vymiraiushchaia. Te dalekie dni vposledstvii Stali izvestny kak Dni Ishoda. Vprochem, nedolgom. Skolko ia uzhe bezhal? Dvadcat minut? Tridcat? Ili celyj chas? Eto ne Moglo prodolzhatsia vechnost. Kogda zhe on nauchitsia obuzdyvat svoi chuvstva i snachala dumat, a potom Delat? Poka u nego vsegda vyhodilo naoborot, i lish masterstvo mechnika Pozvolialo emu nasazhdat sobstvennuiu pravotu v spornyh situaciiah v ugodu svoemu Impulsivnomu harakteru. Ia nastolko rasterialsia v tot Moment ot podobnoj besceremonnosti, chto ne nashel nichego luchshego, kak dat Nori znak trogatsia v put. \nLico i sheia pokrylis lipkoj isparinoj straha. On videl ee naskvoz, ej stalo nepriiatno Tolko na mig, no eto zastavilo ee samu srazu perejti k delu. Ved stolko let on ne pozvolial sebe teriat nadezhdu. Niksard vypriamilsia i otstupil na Dva shaga, osvobozhdaia mesto. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}