{"category": "ham", "to_address": "OLPC Sugar <sugar@laptop.org>", "from_address": "\"Mike C. Fletcher\" <mcfletch@vrplumber.com>", "subject": "[sugar] A few small fixes for the GUI's PresenceService client", "body": "I've been trying to avoid modifications to code as we are focusing on \nthe documentation, but as I couldn't load or test Sugar due to whatever \nit is that's broken on my install, I felt I needed to fix a few problems \nthis evening.  With the checked-in changes I can run a Sugar checkout in \nmy emulated environment again (though without the PresenceService and \nwith all theme-based icons missing).\n\nTo answer any \"whys?\":\n\n    As a general rule, we should *not* be letting the Shell die/fail to\n    start just because it can't find a certain service.  The effect for\n    the user is to wind up staring at a blank Xephyr screen, with no\n    feedback on what went wrong and no way forward to try to solve the\n    problem other than a quick crash-course on how to manage and\n    configure a Unix machine from the command prompt.\n\n    Machines will get:\n\n        * borked configurations\n        * corrupted files\n        * messed up library versions\n        * conflicting service files\n        * disks or memory so full the system can't create a service\n        * aborted upgrade procedures\n        * \n\n    and we need the shell to be written to handle those situations as\n    much as possible.  The same changes also make it easier to develop\n    for the platform because the system can \"go\" even if some dependency\n    is malfunctioning at the moment.\n\nChanges:\n\n    * fix sugar.presence.presenceservice.PresenceService to deal with\n      failures to connect with the PresenceService (which is the\n      proximate error that has been preventing me from loading Sugar on\n      my emulator)\n          o uses a property object for the _ps member, catches dbus\n            exceptions on failure, caches on success\n          o adds an _OfflineInterface that provides a null\n            PresenceService API\n          o alters the unprotected interfaces on the class to watch for\n            dbus exceptions\n    * minor restructuring of sugar-emulator script\n          o avoid executing setup code at the top level of the script\n                + allows auto-documentation systems to process the\n                  module without side effects\n                + eventually allows for using automatic .egg \"script\"\n                  entry-points using the script as a module, should we\n                  decide to use .eggs for distribution at some point.\n          o adds console log messages  telling the developer what's\n            being done so they can tell what's failing\n\nOne weird thing seems to be happening; the logging module doesn't seem \nto be handling %s formatting for the logs I'm writing in presence \nservice.  I guess something's been wrapped around the standard logging \noperations that's causing that.\n\nHave fun all,\nMike\n\n-- \n________________________________________________\n  Mike C. Fletcher\n  Designer, VR Plumber, Coder\n  http://www.vrplumber.com\n  http://blog.vrplumber.com\n\n_______________________________________________\nSugar mailing list\nSugar@laptop.org\nhttp://mailman.laptop.org/mailman/listinfo/sugar\n\n"}