{"category": "ham", "to_address": "<ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"HowStuffWorks\" <newsletter@howstuffworks.com>", "subject": "HowStuffWorks Science & Technology Newsletter May 7, 2007", "body": "\nhowstuffworks® | science & technology May 7, 2007\nRSS\n   How Cell-phone Radiation Works\n \nIs cell-phone radiation a cause for concern or just useless fearmongering? There's actually evidence to support each side of the argument. Learn about the controversial issue of cell-phone radiation and the potential health risks of cell phone use.\n Also at HowStuffWorks\n\nHow Liquefied Petroleum Gas Works - Liquefied petroleum gas, or LP gas, is one of the most\ncommon alternative fuels used in the world today. In fact, in many places, it's\nactually a mainstay for heating and cooking. Learn where liquefied petroleum\ngas comes from, what it's used for and how you can convert your car to run on\nthis light, cheap fuel. \n\n\nHow Rainbows Work - Rainbows are one of the most beautiful spectacles nature has\nto offer, but the science of rainbows is really very simple. It's just basic\noptics! Find out how rain and the sun align to put color in the sky.\n \nHow CAT Scans Work - CAT scan machines allow doctors to take\nthree-dimensional images of the inside of the human body. They can even\npinpoint specific areas and \"slices\" of the body. Learn how CAT scan machine have\nallowed doctors to move far beyond a simple X-ray.             \nThis Week's Video \nDrawbridges span long distances, support tremendous weight\nand withstand the effects of weather, yet they can be easily opened to let ships\npass through. In this video from HowStuffWorks, discover the amazing technology\nbehind drawbridges.           This e-mail was sent to ktwarwic@speedy.uwaterloo.ca, by HowStuffWorks 3350 Peachtree Road, Suite 1500 Atlanta, GA, 30326 USA You received this because your e-mail address was submitted to the HowStuffWorks newsletter service. If this e-mail has been sent to you in error or if you would like to be removed from the list, please \nunsubscribe here or change your preferences using our profile manager.To view this email as a web page, click here.HowStuffWorks is a registered trademark of HowStuffWorks, Inc. © 2007, HowStuffWorks, Inc. All Rights Reserved\n "}