{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "5p 4/20 Update: Outgoing station crew set for Saturday landing", "body": "\n\n\n\n\n5p 4/20 Update: Outgoing station crew set for Saturday landing\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 05:00 p.m., 04/20/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/07/07 (02:00 p.m.): Soyuz launched\n   04/09/07 (03:20 p.m.): Soyuz TMA-10 docks with space station\n   04/09/07 (06:30 p.m.): Hatches opened; station crew welcomes Soyuz cosmonauts, Simonyi aboard\n   04/20/07 (03:30 p.m.): Station crew prepares for Saturday landing\n\n=================================\n\n03:30 p.m., 04/20/07, Update: Outgoing station crew, space tourist Simonyi, prepare for Saturday landing\n\nOutgoing space station commander Mike Lopez-Alegria and flight engineer Mikhail Tyurin are gearing up for a day-late landing Saturday in Kazakhstan to close out a seven-month mission. They will be joined aboard the Soyuz TMA-9 spacecraft by American businessman Charles Simonyi, who blasted off April 7 with the station's next full-time crew - commander Fyodor Yurchikhin and Oleg Kotov. Yurchikhin and Kotov are scheduled to return to Earth in the Fall.\n\n\"We have very mixed emotions about leaving, but it doesn't matter what we think - it is time,\" Lopez-Alegria told flight controllers in Houston early Friday. \"I just want to pass on for the whole crew that we've had a blast. It's been a short seven months in a way, but it's time to come home and hand over the torch to the next crew, whom I'm sure will be up for the challenge and continue the development and construction of the space station and all of the good things that are going on up here. It's been our pleasure.\"\n\n\"Speaking for everyone down here, it has been a double pleasure for us to work with (the) Expedition 14 crew and you,\" astronaut Shannon Lucid replied from Mission Control.\n\nSimonyi and the two Expedition 14 crew members originally were scheduled to undock and return to Earth Friday, but soggy conditions at the northern Kazakhstan landing zone prompted Russian mission managers to replan for a touchdown in a more southerly zone. To get there, the crew had to delay their departure by one day to achieve the proper trajectory.\n\nIf all goes well, Lopez-Alegria, Soyuz commander Tyurin and Simonyi will close the hatch to their re-entry vehicle around 2 a.m. EDT and undock at 5:08 a.m. A four-minute 18-second firing of the spacecraft's braking rockets is planned for 7:42 a.m. with landing on tap around 8:30 a.m. Here is a timeline of re-entry activities (all times in EDT; dV means change in velocity; dT means duration of event):\n\nEDT...........EVENT\n\n05:07:30 AM - Space station to free drift\n05:08:30 AM - Undocking command\n05:11:30 AM - Physical separation (dV: 0.27 mph)\n05:14:30 AM - Soyuz separation burn No. 1 (dT: 15 seconds; dV: about 1.45 mph)\n05:16:30 AM - Space station attitude control re-enabled\n\n07:42:30 AM - Deorbit ignition (dV: 257.7 mph)\n07:46:48 AM - Deorbit burn complete (dT: 4 minutes 18 seconds)\n\n08:05:37 AM - Soyuz module separation\n08:08:29 AM - Soyuz TMA-10 hits the discernible atmosphere at 400,000 feet\n08:10:03 AM - Entry guidance begins\n08:14:14 AM - Maximum deceleration\n08:16:33 AM - Parachute deploy command\n08:30:34 AM - Landing\n10:23:00 AM - Sunset at landing site\n\nA veteran of three space shuttle flights totaling more than 42 days, Lopez-Alegria will set a new U.S. record for the longest single flight - 215 days - when he lands in Kazakhstan. He now stands second in the world for most spacewalk time with 67 hours and 40 minutes during 10 excursions, five of them during Expedition 14.\n\nAsked what he's looking forward to the most coming home and what he will miss most about living and working aboard the space station, Lopez-Alegria told CBS News \"the sort of standard answer to the standard question is I'm going to miss floating around and I'm going to miss looking out the window. And all that is very true.\n\n\"But I think I'm going to miss the experience,\" he said. \"As opposed to a shuttle mission where you come up here and you're full throttle for a week and a half, it's just been living up here. We certainly work hard when we're working but we also have time to relax, we have a little bit more time to think about things. And I can say that I have lived in space, not just worked, and I think I'm going to miss that sensation of just having this be my home.\"\n\nOne thing he will not miss is the daily exercise required to stay fit in the weightlessness of space.\n\n\"One of the things that was a little bit more difficult for me than I anticipated was the physical exercise part,\" he said. \"We have a two-and-a-half-hour period scheduled every day and that's a lot more than I work out on the ground and I just didn't expect a couple of the effects. ... It's just a lot of wear and tear on your body.\n\n\"It doesn't take very long at all for you to become quite deconditioned. Those were big surprises for me and it's obvious to me now that you really have to approach that in sort of a slow and steady pace that you can maintain throughout the six months. Mentally, it was very good testimony to how good our training is because I felt pretty prepared for the mission and as it unfolded, I sort of felt like I was not too far behind most of the time, which was a little bit surprising as well. So the second message is the training community should be proud of the job they do preparing us for these long-duration flights.\"\n\nLast December, the shuttle Discovery delivered a fresh station crew member - NASA astronaut Sunita Williams - who will remain aboard the lab complex with Yurchikhin and Kotov. She will return to Earth later this summer. Asked if he thought it might be a bit strange to interact with more than three to five people for the first time in many months, Lopez-Alegria said \"I'll let you know what it's like afterward.\"\n\n\"I have thought about it a little bit,\" said. \"We interact with people quite a bit up here, both the professionals in mission control in Houston and in Moscow as well as in Huntsville (Ala.), but also friends and family via email and we have the IP (internet protocol) phone. However, we haven't really seen people and certainly not touched anybody in a long time and it's going to be interesting.\"\n\nFor his part, Simonyi, the fifth person to pay the Russians some $20 million for a flight to the space station, said in a video downlink the international outpost \"is just a fantastic place to live. It’s cozy. It’s complicated. It has been lived in for quite a while.\"\n\nDescribing the station shortly after he arrived April 9, Simonyi said \"I think that the most impressive thing would be the approach to the station and seeing it from outside. Inside it's a very cozy place ... and I can see why Fyodor thinks it's his home. It is a cozy place, it's full of stuff as you see, nick-knacks just like a home is.\n\n\"But from the outside, it is amazing how it appears from the blackness of the sky. We arrived at  dusk, just between sunlight  and darkness. It was very, very dramatic and it was like a big space set of a fantastic production of some incredible opera or modern play. \"\n\nThe decision to delay landing one day required significant replanning and redeployment of flight surgeons and recovery crews. But officials said Friday all is in readiness for the crew's return.\n\nFor entry, Lopez-Alegria will occupy the left seat of the Soyuz TMA-10 spacecraft, vehicle commander Tyurin will work from the center seat and Simonyi will strap in to his right. The spacecraft will undock from the aft port of the Zvezda command module around 5:11 a.m. Here is an overview of landing operations from NASA's Expedition 15 press kit, picking up at the point Tyurin undocks from the station:\n\n-----------------------------\n\nSource: NASA ISS-15 press kit\n\nSix minutes after un-docking, with the Soyuz about 20 meters (66 feet) away from the station, (Tyurin) will conduct a separation maneuver, firing the Soyuz jets for approximately 15 seconds to begin de-parture from the vicinity of the station.\n\nLess than 2.5 hours later, about 19 kilometers (12 miles) from the station, Soyuz computers will initiate a deorbit burn braking maneuver. The ... engine firing will slow the spacecraft and enable it to drop out of orbit to begin its re-entry to Earth.\n\nLess than a half hour later, just above the Earth's atmosphere, computers will command the separation of the three modules of the Soyuz vehicle. The crew will return in the descent module. The forward orbital module, containing the docking mechanism and rendezvous antennas, and the rear instrumentation and propulsion module, housing the engines and avionics, will pyrotechnically separate and burn up in the atmosphere.\n\nThe descent module's computers will orient the capsule with its ablative heat shield pointing forward to repel heat buildup as the craft plunges into the atmosphere. For the first time in (seven months), Lopez-Alegria and Tyurin will feel the effects of gravity during entry interface, three minutes after module separation when the craft is approximately 400,000 feet above the Earth.\n\nEight minutes later, when the Soyuz is at an altitude of approximately 10 kilometers (six miles) and traveling at 220 meters per second (492 mph), the ship's computers will begin a commanded sequence to deploy the capsule's parachutes. First, two \"pilot\" parachutes will be deployed, extracting a larger drogue parachute, which stretches out over an area of 24 square meters (29 square yards). Within 16 seconds, the Soyuz's descent will slow to about 80 meters per second (179 mph).\n\nDeployment of the parachute will create a gentle spin as the Soyuz dangles underneath the drogue chute, increasing the capsule's stability in the final minutes prior to touchdown. At this point, the drogue chute is jettisoned, and the main parachute is deployed. Connected to the descent module by two harnesses, the main parachute covers an area of about 1,000 meters (0.62 miles).\n\nInitially, the descent module will hang underneath the parachute at a 30-degree angle with respect to the horizon for aerodynamic stability. The bottom harness will be severed a few minutes before landing, allowing the descent module to hang vertically through touchdown. The deployment of the main parachute slows the descent module to a velocity of about seven meters per second.\n\nWithin minutes, at an altitude of a little more than five kilometers (3.1 miles), the crew will monitor the jettison of the descent module's heat shield. That will be followed by termination of the aerodynamic spin cycle and dumping of any residual propellant. Computers also will arm the module's seat shock absorbers in preparation for landing.\n\nWhen the capsule's heat shield is jettisoned, the Soyuz altimeter is exposed to the surface of the Earth. Using a reflector system, signals are bounced to the ground from the Soyuz and reflected back, providing the capsule's computers updated information on altitude and rate of descent.\n\nAt an altitude of about 12 meters (39 feet), cockpit displays will tell Tyurin and his crewmates to prepare for the Soft Landing Engine (SLE) firing. Just one meter (one yard) above the surface and seconds before touchdown, the six solid propellant engines of the SLE are fired in a final braking maneuver. The Soyuz touches down at a velocity of about 1.5 meters per second (3.4 mph).\n\n-----------------------------\n\nFlight surgeons and recovery crews will be standing by to help the returning spacemen out of the cramped Soyuz capsule and to render any assistance that might be needed before the long flight back to Star City near Moscow for reunions with friends and family members and the start of their physical rehabilitation to cope with the unfamiliar tug of Earth's gravity.\n\nWhile science was the original justification for the space station, NASA now touts the lab complex as a valuable training ground and test bed for future flights to the moon and eventual missions to Mars. Asked how he viewed the value of the station in that regard, Lopez-Alegria said \"the most obvious might be the scientific work we're doing up here to help understand the effects of long-duration microgravity on human physiology. I think that gets enough play so I won't go into much detail on it.\n\n\"Also, if we're going to do anything internationally cooperative, we need to learn how to work with our partners and that's quite a challenge day in and day out. We have learned a great deal with our Russian counterparts and in the next year or so we'll be doing operational things with the Europeans and the Japanese as well through the control centers and the science centers.\n\n\"And lastly, I think we're starting to think about what we do up here operationally every day that may not be applicable to long-duration flights when we're talking on to Mars, for instance, where the communication is going to be a very big factor because we can't just expect to have a conversation like you and I are having right now. Just the mere speed of light limitation will make the communication take a long, long time between question and answer. So we've got to start thinking about how to operate autonomously.\n\n\"We haven't done much of that because we're still concentrating on operating the station, but I think in the future we could use it as a test bed to try that concept out, of how we might alter our operational concepts to adapt better to that lack of constant communication.\"\n\n=================================\n\nQuick-Launch Web Links:\n\nNASA ISS-15 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition15/index.html\n\nNASA ISS-14 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition14/index.html\n\nCharles Simonyi:\nhttp://www.charlesinspace.com\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}