{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "Our Assignment America will satisfy your sweet tooth...just watch and enjoy.  That's tonight on the CBS Evening News with Katie Couric", "body": "\nCBSNews.com\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"There are two types of \n      people--those who come into a room and say, 'Well, here I am!' and those \n      who come in and say, 'Ah, there you are.'\" - Frederick L. Collins \n      \n\n\n\nDID YOU KNOW?Sea water is approximately 3.5 \n      percent salt. \n\n\n\nSATURDAY\nON 48 HOURSHere's a note \n      from Troy Roberts on Saturday's 48 Hours Mystery, POWER, \n      PASSION AND POISON: \"Kathy Augustine was a \n      rising star in Nevada state politics. Smart, ambitious, tough and \n      attractive she quickly ascended to one of the highest offices in the state \n      and many expected she'd eventually end up working in national politics. \n      But last year Kathy Augustine was found unconscious in her bed and later \n      died at the hospital. She was fifty-years-old. At first it was assumed \n      that Augustine died from a heart attack. But her family and friends didn't \n      believe it could be possible. Augustine had her annual physical just a \n      week before her death. She was given a clean bill of health and there was \n      no family history of heart disease. It just didn't add up. \n      Toxicology tests were ordered on fluid samples taken from \n      Augustine and the results shocked everyone. Traces of the powerful \n      paralytic drug Succinylcholine were found in her system. The drug is \n      normally given to patients to ease the insertion of a breathing tube. It \n      acts fast and nearly vanishes from the body within minutes...making it \n      extremely difficult to detect. Suspicions quickly fell on Augustine's \n      husband of three years, Chazz Higgs. The pair seemed an unlikely couple. \n      He was eight-years her junior. He was a bodybuilder who had three failed \n      marriages behind him. His relationship with Kathy was troubled as well. In \n      the months leading up to Augustine's death they had discussed divorce. But \n      there was more. Chaz Higgs was a critical care nurse and he had access to \n      Succincolyine. He knew how to adminster it and, most importantly, he knew \n      the drug could be potentially deadly. And then a witness came forward with \n      a damning claim about his allegedly role in the crime. Chazz Higgs \n      goes on trial for the murder of Kathy Augustine next month. Higgs claims \n      he is innocent. When we sat down for the interview, that you'll see this \n      weekend, he agreed to talk about the charges against him...charges that \n      could send him to prison for life, and you'll hear his theories on who \n      would want his wife dead...and why. I hope you'll join us on Saturday \n      night.\" - Troy Roberts (48 Hours Mystery \n      airs Saturday at 10pmET/9CT) If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us at: 48hours@cbsnews.com \n      \n\n\n\nTONIGHT ON THE CBS EVENING NEWSHere's an early look at what we are working on for \n      tonight's broadcast of the CBS Evening News, from Anchor and Managing \n      Editor, Katie Couric.. Hi everyone, Today a \n      Defense Department panel warned that more than one-third of U.S. troops \n      and veterans suffer from mental health problems such as traumatic brain \n      injury or post-traumatic stress disorder. With the conflicts in Iraq and \n      Afghanistan continuing, these numbers are only expected to grow, according \n      to the group. David Martin will have this story and a deeper look \n      at veterans\u0092 mental health issues. Correspondent Allen \n      Pizzey will introduce you to an Army specialist with a special \n      perseverance \u0096 and a unique perspective on the roadside attacks that \n      injure so many American troops: Specialist Jordan Spurlin has survived \n      four IED explosions. Now he\u0092s sharing his story. A boat carrying \n      an estimated 150 Haitian migrants capsized in the Atlantic Ocean this \n      morning. Kelly Cobiella will have the latest on the Coast Guard\u0092s \n      frantic search for survivors. Ten presidential hopefuls lined up \n      on stage last night, but what memorable about it? Our senior political \n      correspondent Jeff Greenfield will have a review of the first \n      Republican debate. Queen Elizabeth II is causing quite a stir at \n      the site of one of America\u0092s first colonies. Mark Phillips will \n      follow her through Jamestown \u0096 where Brits settled 400 years ago \u0096 and \n      take a look back through its history and how it is recently being revised. \n      A bit of trivia: Who is the only sitting U.S. senator to serve on \n      active duty in Iraq? Sharyl Attkisson will have that exclusive \n      story tonight, and she\u0092ll explain the work this lawmaker has done recently \n      for the military. Finally, for Assignment \n      America Steve Hartman will have a sweet \n      story about a small-town family fighting to save their roots \u0096 one \n      hand-dipped chocolate at a time. I hope you join us tonight and \n      have a great weekend!\n \nKatie\nIf you interested in more on two of the stories noted above, \n      please click on the following links: Mental Health Care \n      Failing At-Risk Troops Click Here Queen Visits \n      Jamestown With Cheney Click Here Here's an early look \n      at one of the stories we are working on for Monday's broadcast of the CBS \n      Evening News:\n \nAcross the country, beekeepers are facing stacks of \n      empty hives. The bees have simply DISAPPEARED. A mystery that could sting \n      us ALL. That story and a lot more, on Monday's broadcast of the \n      CBS Evening News. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: evening@cbsnews.com \n      \n\n\n\nTONIGHT ON DAVID \n      LETTERMANDave chats with actor/comedian \n      Ray Romano AND impressionist Reggie Reg... Plus, actor Dennis Haysbert \n      from the CBS drama series The Unit! \n\n\n\nTOMORROW ON THE SATURDAY EARLY SHOWTracy \n      Smith and Chris Wragge of our New York affiliate, WCBS, \n      anchor THE SATURDAY EARLY SHOW from New York. Ira Joe \n      Fisher will bring us the weather. Along with the top news \n      of the day, we will also have the following stories: HAPPINESS \n      MYTH: Can a person achieve true happiness? Not the traditional way is \n      Jennifer Michael Hecht\u0092s answer, author of The Happiness Myth: Why What \n      We Think Is Right Is Wrong. In her new book, she asks her readers to \n      rethink the modern methods of pursuing happiness \u0096 through money, our \n      bodies, celebrations, and drugs. Using historical examples, Hecht aims to \n      prove that individuals can achieve their own happiness when they snap out \n      of a \u0093cultural trance\u0094 and move beyond the societal constructs within \n      which we live our lives. She will join us with her unique perspective \n      Saturday morning. REPAIR OR REPLACE?: Electronics are \n      expensive investments, but sometimes it might be best to just replace it \n      than try to repair it. To show us the difference, AOL consumer adviser \n      Regina Lewis will offers tips on how to decide whether to fix that broken \n      PC, BlackBerry, cell phone, or iPod \u0096 or just buy a new one. \n      BIG-SCREEN ROMANCES: Saturday morning, we will preview this \n      summer\u0092s best on-screen romances from Peter (Spidey) Parker & Mary \n      Jane in Spiderman 3 to the timeless romance of Homer and Marge \n      Simpson in The Simpsons Movie. David Edelstein of New York \n      magazine and Jill Bernstein of Entertainment Weekly will join us \n      with what hopeless romantics can look forward to this summer. \n      QUEEN AT DERBY: Queen Elizabeth II, one of the world\u0092s \n      best-known fans of horses and horse racing, will attend her first Kentucky \n      Derby and associated festivities on Saturday. CBS News Correspondent \n      Mark Phillips has been following the queen\u0092s visit to the U.S. and \n      will bring us the latest on her activities from Louisville, KY. \n      BICYCLES: Biking enthusiasts can rejoice with spring \n      finally here. But is your bike on its last wheel? We will turn to \n      Bicycling magazine Editor-in-Chief Steve Madden for all we need to \n      know about buying a bicycle. He will show us some of the cool new features \n      on today\u0092s bikes. He will also offer upgrade suggestions for those who \n      just can\u0092t seem to part with their old trusty. CHEF ON A \n      SHOESTRING: Saturday is Cinco de Mayo and we\u0092re celebrating! Hot \n      Boston chef Ken Oringer has recently opened a Mexican restaurant called La \n      Verdad. He will join us with his Mexican-inspired dishes to help get your \n      holiday off to a spicy start\u0085 all on our $40 budget. SECOND CUP \n      CAFE: Carly Simon, a \u009170s singer-songwriter well-known for hits like \n      \u0093You\u0092re so Vain,\u0094 hasn\u0092t stopped her musical ambitions. The two-time \n      Grammy winner recently released Into White, an album that covers \n      classic songs by esteemed artists like Judy Garland and the Beatles. It \n      also features vocals by her children Ben and Sally Taylor. Simon will \n      perform songs from her latest album with her gifted daughter Sally in our \n      Second Cup Café. To look for our fabulous recipes... Click \n      Here If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: sat@cbsnews.com \n\n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY \n      MORNINGCHARLES OSGOOD ANCHORS FROM NEW YORK \n      WHAT'S FOR BREAKFAST?: Cereal still rules at the American \n      breakfast table, but the trend is toward dashboard dining and cup-holder \n      cuisine. Cynthia Bowers looks at how America eats the most \n      important meal of the day - in our Sunday Morning cover \n      story. SUNDAY ALMANAC: We'll look back to this day, May 6, \n      1937 when the airship Hindenburg crashed and burned in Lakewood, NJ. \n      EMAIL ETIQUETTE: Technology Correspondent Daniel \n      Sieberg has pointers on proper on-line etiquette. SUMMER \n      MOVIES: We'll get a sneak preview of some of the films that will be \n      coming to a theater near you this summer. Jerry Bowen tells us \n      which ones could bring in big bucks at the box office. TONY \n      SNOW: Correspondent Rita Braver talks with White House Press \n      Secretary Tony Snow about his battle with cancer and returning to his \n      position as the President's spokesman. MUSIC - ASLEEP AT THE \n      WHEEL: With his band Asleep at the Wheel, Ray Benson loves makin' \n      music with his friends. A booming baritone, Benson likes to say he's \n      reinventing the wheel - the title of their new CD. Asleep at the Wheel, a \n      western swing band from Austin, Texas, started rolling in 1970 and never \n      stopped. We'll ride along with them this Sunday Morning. \n      THE OUTER LIMITS: Throughout their lives the baby boomers \n      have done things their own way. And the same philosophy seems to apply to \n      how they intend to go into the great beyond. Instead of a traditional \n      burial, more and more people are opting for cremation these days. And \n      there are more and more ways to turn those ashes into memorials to the \n      departed. They can be scattered at sea, or made into jewelry, sporting \n      equipment, artificial reefs, or even fireworks. One of the most dramatic \n      tributes is to shoot them into space. Last weekend, Bill Geist \n      traveled to New Mexico where a private rocket launched so-called \n      \"cremains\" of 202 people into space. Onboard were some of the ashes of \n      pioneering astronaut Zombie Cooper and James Doohan-\"Scotty\" from Star \n      Trek. We'll meet the families of some of those on-board, and learn \n      more about how the baby boomers are redefining even death. If you \n      would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: sundays@cbsnews.com \n\n\nSUNDAY ON FACE THE \n      NATION Bob Schieffer moderates...Sunday on Face the \n      Nation, the subjects will be war and politics and the guests: For \n      the Republicans, former House Speaker Newt Gingrich who says he may throw \n      his hat into the Presidential ring this fall. For the Democrats: Chairman \n      of the House Ways and Means Committee, Charlie Rangel of New York. We'll \n      talk to both about the war, politics, the agenda of the parties and more. \n      There will be, as always, a final word. That's all on Face the \n      Nation, this Sunday, with Bob Schieffer. \n\n\nSUNDAY ON 60 MINUTESINSIDE THE ENEMY \n      CAMP: Until Osama bin Laden declared all Americans and Jews fair \n      targets for al Qaeda terror, Nazir Abas trained Muslim militants in the \n      jungles of Southeast Asia. Now he provides valuable intelligence to \n      authorities in the war on terror. Bob Simon reports. LOU \n      DOBBS: Lesley Stahl profiles the CNN anchor, whose stance against \n      illegal immigration has helped raise his ratings but also fueled \n      criticism. THRIFT SHOP MASTERPIECE?: Teri Horton knew \n      nothing about art when she bought a big, drippy painting for five dollars \n      years ago in a thrift store. But now she says a fingerprint proves it is a \n      $50 million Jackson Pollock original. Anderson Cooper reports. \n      \n\n\n\nMONDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Hannah \n      Storm, Julie Chen and Russ Mitchell anchor THE \n      EARLY SHOW from New York. Dave Price will bring us the \n      weather. Along with the top news of the day, we will also have \n      the following stories: WITHOUT A TRACE: What happened \n      to Khoi Vu? Khoi Vu was last seen by his family sometime between the hours \n      of midnight and 1 a.m. on the morning of April 7, 2007, at the home which \n      he shares with his family in Clark County, Washington. On Sunday\u0092s \n      Without A Trace, Khoi Vu was revealed as this week\u0092s missing \n      person. Find out the story behind his bizarre disappearance and see if you \n      can help solve this mystery. CSI WEEK: A VISIT TO THE SET OF \n      CSI MIAMI: Monday morning we kick off CSI week with a look at \n      the most popular show in the world. It may be called CSI Miami, but \n      thanks to Hollywood magic the show normally shoots in California. Several \n      times a year they go on location to it's namesake city. That's where \n      EARLY SHOW National Correspondent Tracy Smith caught \n      up with the show's cast. Monday morning, she\u0092ll take us on a tour of the \n      red hot show. PITFALLS OF MEDICAL SCREENING: Traditionally \n      it has been your doctor who has decided if you need to have a medical test \n      done. But now a growing number of people are paying to have medical \n      screenings done without the approval of their doctors. Our Dr. Emily \n      Senay will join us to explain. PERFECT PARENTING: FINDING A \n      NANNY: The days of your neighborhood babysitter are long gone and \n      finding a more permanent caretaker for your child can be a daunting task. \n      What should you look for when you search for a nanny? We\u0092ll have tips that \n      can help you avoid a nanny nightmare and make sure that your child will be \n      in good hands. SHRINK YOURSELF: THE BEST YOU CAN BE: For \n      many people food offers a time out from life's stresses and \n      disappointments. A delicious bowl of ice cream can make a bad day seem \n      better. Psychiatrist Roger Gould writes about freeing yourself from \n      emotional eating in his new book, Shrink Yourself. He will join us \n      Monday morning with some ways to begin a healthier relationship with food. \n      BRYCE DALLAS HOWARD ON SPIDERMAN 3: It's been a pretty good \n      year for actress Bryce Dallas Howard. Last summer, she got married and in \n      February Howard gave birth to son Theo. Now, she gets to celebrate the big \n      opening of the blockbuster Spiderman 3, in which plays the new \n      character Gwen Stacy. Monday morning Bryce will join us to give us the \n      inside scoop on what is was like to be a part of the Spiderman \n      phenomenon. AMAZING RACE: ALL STARS WINNING TEAM!: On \n      Sunday night\u0092s season finale of the Amazing Race: All Stars, Dustin \n      and Kandice have a disagreement and Charla and Mirna rely on their wit in \n      order to beat the physically stronger teams. Who will walk away with a \n      first place finish? Monday morning, the final two teams will join us live \n      on our plaza where we will present the winning team with their million \n      dollar check! If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: earlyshow@cbs.com \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}