{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "630a 6/21 Update: Russian computer test on tap; shuttle crew preps for entry", "body": "\n\n\n\n\n630a 6/21 Update: Russian computer test on tap; shuttle crew preps for entry\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 84\nPosted: 6:32 AM, 6/21/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-82 (06/20/07): Entry flight director outlines landing strategy; MMT meets to clear final issues\n   SR-83 (06/20/07): MMT clears Atlantis for entry; final issues resolved\n   SR-84 (06/21/07): Astronauts prepare for entry; Russian computer test on tap\n\n=================================\n\n6:32 AM, 6/21/07, Update: Astronauts prepare for entry; Russian computer test on tap\n\nKeeping tabs on threatening weather, the Atlantis astronauts were awakened today around 5:40 a.m. to begin preparations for re-entry and landing at the Kennedy Space Center. The crew has two opportunities to land in Florida today, at 1:55 p.m. and 3:30 p.m., but forecasters predict low clouds and afternoon thunderstorms in the area. If the weather prevents a return to Earth today, the astronauts will remain in orbit an additional day and try again on Friday.\n\nAboard the international space station, meanwhile, commander Fyodor Yurchikhin and flight engineer Oleg Kotov plan to carry out a test to help Russian engineers figure out what might have caused computer failures last week that crippled the lab complex.\n\nDuring installation of a new set of U.S. solar arrays, the Russian command module's three guidance, navigation and contgrol computers, known collectively as the terminal computer, along with three high-level command-and-control machines known as the central computer, failed to reboot after the guidance system crashed. After three days of around-the-clock troubleshooting, Russian engineers asked Yurchikhin and Kotov to install jumper cables to bypass suspect secondary power supply switches.\n\nThe repair worked and after additional tests and checkout, two computers, or \"lanes,\" in each system were brought back on line. The other two were kept off line in backup mode. But engineers still don't know what caused the so-called soft switches in the secondary power supplies to act up. The circuitry is designed to cut off power to the computers if the incoming electricity isn't stable to within fairly narrow parameters.\n\nSome engineers suspected the new solar arrays caused some slight change in the station's power grid that affected the power supply switches. But during a test last Friday, the computers were isolated from the new arrays and they still failed to boot up. Yurchikhin and Kotov then bypassed the secondary power supply switches and all six computers ultimately were successfully activated.\n\nToday, around 9:05 a.m., the two off-line backup computers - lane No. 1 of the central computer and lane No. 2 in the terminal computer - will be activated during a pass over Russian ground stations. One orbit later, Yurchikhin and Kotov will shut down both computers and remove the jumper cables installed last week. One orbit after that, around 12:25 p.m., Yurchikhin will attempt to restart the two computers in their original configuration. The test should help engineers pin down whether the cause of last week's problem was transitory or the result of some ongoing issue.\n\nRussian mission managers plan to launch replacement computer gear aboard an unmanned Progress supply ship scheduled for takeoff July 22. But before they install any new gear, engineers would like to pin down the root cause of the earlier computer problems.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}