{"category": "ham", "to_address": "undisclosed-recipients: ;", "from_address": "Buddhima Lokuge <Buddhima.Lokuge@newyork.msf.org>", "subject": "[Ip-health] AP -- Lack of doctors and nurses killing AIDS patients, says MSF", "body": "Lack of doctors and nurses killing AIDS patients, says MSF\n\nThe Associated Press\nThursday, May 24, 2007\n\nCAPE TOWN, South Africa. Lack of medical staff is emerging as one of the\nbiggest obstacles to providing patients with anti-AIDS drugs, condemning\nuntold numbers of Africans to an unnecessary death, says a new report.\n\nAs Africa slowly gets to grips with providing anti-AIDS drugs \\u2014 increasing\nthe number of people on treatment from 100,000 in 2003 to 1.3 million in\n2006 \\u2014 the dire shortage of doctors and nurses is now jeopardizing more\nwidespread provision of the lifesaving therapy, according to a report\nThursday by Medecins Sans Frontiers. 'The international community says it\nwants to achieve universal access, and in Khayelitsha we were coming\nclose, but at a certain point things started to collapse,' said Eric\nGoemaere, who heads MSF \\u2014 also known as Doctors Without Borders \\u2014 in a\nsprawling Cape Town suburb. 'We are absolutely saturated, we have come\nback to waiting lists, and it feels again like we are losing the battle,'\nhe said.\n\nSouthern Africa is hardest hit by the AIDS epidemic, accounting for the\nvast majority of the 40 million infections and the daily death toll of\n8,000. Despite the advances of providing treatment taken for granted in\nrich countries, more than 70 percent of the Africans in need of treatment\nare still waiting. On an average day, around 200 AIDS patients flock to\nsee Mpumelelo Mantangana and her closely knit medical team at a clinic in\nan impoverished part of town. Many others languish at home, not for lack\nof drugs but rather lack of health workers to administer them. At the\nclinic started by MSF in Khayelitsha \\u2014 where about 30 percent of adults\nhave the AIDS virus \\u2014 nearly 6,000 people are currently receiving\nanti-retroviral therapy. But the number of new people starting treatment\neach month dropped from 270 last May to 100 in December \\u2014 mainly because\nof lack of health workers. Mantangana, a nurse at the clinic, says her\nworkload has soared as other nursing staff have left for greener pastures\nin the private sector or abroad. She understands them \\u2014 the work is\nexhausting and the pay is peanuts.\n\n'I work purely because of passion for what we are doing. People come in\nand they are very sick and we see them get better. That is the only thing\nwhich gives us strength,' she said in an interview at the clinic, gazing\nat the long lines of people waiting patiently on wooden benches on the\nconcrete floor. South Africa has 393 nurses and 74 doctors per 100,000\npeople, but a high percentage work in the private sector and shortages are\nespecially acute in rural areas. This compares to 247 doctors and 901\nnurses per 100,000 people in the United States. In tiny Lesotho, which is\nalso ravaged by AIDS, there are just 5 doctors and 63 nurses per 100,000.\nIn Malawi, it is 2 doctors and 56 nurses and in Mozambique 3 doctors and\n20 nurses.\n\nThe MSF report, which focussed on the four southern African countries,\nmade grim reading. It said that in the Thyolo district of Malawi, a single\nmedical assistant can see up to 200 patients per day. In Mavalane district\nin Mozambique, many patients died during the two month wait to start\ntreatment because of the lack of doctors and nurses. In one of Lesotho's\nmain hospitals, more than half the professional nursing posts were vacant.\nThe report said that countries would only be able to cope with the crisis\nby 'task-shifting' \\u2014 allowing nurses to do work assigned to doctors,\nmedical assistants to do the work of nurses and using more community\nworkers. Malawi is already doing this and a new AIDS plan recently adopted\nin South Africa also decentralizes treatment and care away from hospitals\nand gives community a much bigger role. Lesotho also has nurse-based\ntreatment \\u2014 but there simply aren't enough nurses.\n\nThe report also pointed the finger of blame at donor governments, who were\nwilling to pay for antiretroviral drugs and new clinics but not contribute\ntoward staff salaries to operate them. For instance, it said the US\nMillennium Challenge Account had committed an unprecedented $US 140\nmillion to improve physical infrastructure at health facilities. But no\nplans had been made to recruit the estimated 600 additional health care\nworkers needed to staff the facilities. 'People living with HIV/AIDS do\nnot only need drugs and clinics, they need trained, motivated health care\nworkers to diagnose, monitor, and treat them,' the report said.\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}