{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nOur top story tonight is the London bomb plot. British police forces\n  found and dismantled a bomb made of a deadly mix of gases and nails parked\n  outside of a popular nightclub in London's\n  theater district. A second suspicious vehicle was found in a nearby\n  neighborhood. Richard Roth will have the latest on the thwarted apparent\n  attack and Bob Orr will report on the implications of this scare for the United States.\n  \n \nAnd I’ll talk to the former CIA head of\n  counterterrorism, John Brennan. \n  \nOne day after the Supreme Court struck down public\n  school integration programs, school districts across the United States\n  are wondering what's next. National correspondent Byron Pitts will take a\n  close look at one North Carolina\n  district once hailed as a model for school integration and the demographic\n  changes its schools have seen.\n \nThe iPhone finally makes its debut this evening, but\n  with Apple's aggressive — and appealing — marketing campaign, is\n  it possible that we’ve already heard too much? Our science and\n  technology correspondent Daniel Sieberg will look at Apple's marketing\n  strategies that have piqued so many people's interests.\n \nWe’ll end our broadcast tonight with a special\n  Assignment America story that might leave you seeing double. Steve Hartman\n  will introduce you to Fernando and Fernando, two young chess champs with an\n  uncanny number of things in common — including their rivalry.\n \nThanks and I hope you have a great weekend!\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}