{"category": "ham", "to_address": "ip-health@lists.essential.org, e-drug@healthnet.org", "from_address": "Alexandra HEUMBER <Alexandra.HEUMBER@brussels.msf.org>", "subject": "[Ip-health] EU Urged To Back Poor Countries\n =?UTF-8?B?4oCZIFVzZSBPZiBUUklQUyBGbGV4aWJpbGl0aWVz?=", "body": "This is a multipart message in MIME format.\n--\n[ Picked text/plain from multipart/alternative ]\nhttp://www.ip-watch.org/weblog/index.php?p=642&res=1024\n\n6 June 2007\nEU Urged To Back Poor Countries\\u2019 Use Of TRIPS Flexibilities\nBy David Cronin for Intellectual Property Watch\nBRUSSELS - The European Union should stop demanding that poor countries\napply its intellectual property rules to medicines through trade\nnegotiations with the African, Caribbean and Pacific (ACP) bloc, legal\nexperts argued at an 4 June event here.\nThe EU\\u2019s executive arm, the European Commission, is hoping to conclude\nfree trade deals known as Economic Partnership Agreements with 76 ACP\ncountries by the end of this year. Under proposals put forward by the\nCommission, these would require ACP countries to place EU intellectual\nproperty rules on their national statute books.\nFrederick Abbott, a professor of international law at Florida State\nUniversity (US), said that if the Commission is successful, it would\nimpose a \\u201csubstantial burden\\u201d on the countries concerned and that there\ncould be adverse consequences for public health. Instead, he recommended\nthat the EU encourage poor countries to make use of flexibilities in rules\non intellectual property rights at the World Trade Organization (WTO).\nDoing so could drive down the cost of drugs that would prove prohibitive\nshould the patents on them be enforced.\nAbbott has been hired by the European Parliament\\u2019s committee on\ninternational trade to prepare an analysis of what policy options the EU\nhas to boost the supply of medicines in poor countries.\nPresenting his initial findings on 4 June, Abbott considered whether the\nParliament should endorse a December 2005 protocol amending the WTO\\u2019s\nAgreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)\n(IPW, WTO/TRIPS, 6 December 2005).\nThe protocol is designed to give permanent effect to a 2003 waiver from\nTRIPS agreed by to by WTO members. The waiver allows countries lacking\ndrug manufacturing capacity the increased possibility to import generic\nversions of patented medicines produced under compulsory license. It\nfollowed the declaration of the 2001 WTO ministerial conference in Doha,\nQatar, that intellectual property rights should be interpreted in a way\nthat protects public health and promotes \\u201caccess to medicines for all.\\u201d\nAbbott said that if members of Parliament decide to push for a\nrenegotiation of the amendment, there is a risk that the pharmaceutical\nindustry will succeed in restricting the protocol\\u2019s scope so that it could\nonly be used to cover certain diseases.\nYet while the WTO has asked its 150 member governments to ratify the\nprotocol by the end of 2007, Abbott argued that the Parliament may be\nright to stall on approving it. Delay could be used as a tactic to\npressure the Commission and the 27 EU governments to refrain from\ninsisting that ACP countries agree to apply EU standards on intellectual\nproperty.\nJerome Reichman, professor of law at Duke University (US), said that poor\ncountries in general have seen \\u201can enormous flood of patent applications\\u201d\nin recent years. Colombia\\u2019s patent office, for example, has some 3,500\napplications pending.\nReichman, who is co-author of the report with Abbott, said that the\nEuropean Commission\\u2019s proposals to the ACP countries would require them to\nenforce intellectual property in a way that presumed in favour of patent\nholders and compensate them for losses incurred when patents are infringed\nupon.\nEuropean Union Silence\nA Commission official said, however, that the ACP should use European\nrules on intellectual property as a \\u201csource of inspiration,\\u201d in particular\nto prevent fraud. \\u201cWe have to face the reality that poor people are often\nconfronted with fake medicines,\\u201d the official added. \\u201cThis is certainly\nthe case in Africa.\\u201d\nThe humanitarian organisation Médecins Sans Frontières (MSF) has called on\nthe EU to support countries that have decided to issue compulsory licenses\nto overrule drug patents.\nPaul Cawthorne, MSF\\u2019s head of mission in Thailand, said \\u201cit is of\nconsiderable concern that the European Union has been silent\\u201d in the\ninternational dispute that followed the Thai government\\u2019s decision to\nissue a compulsory license for the AIDS treatment efavirenz in November\n2006. At $468 per patient per year, the price charged by Merck, the drug\\u2019s\npatent-holder, was more than twice that of a generic version of the same\nmedicine, made in India. Yet while the Thai decision was taken on public\nhealth grounds, it was opposed by drug firms and by the US government.\n\\u201cIn Thailand, I saw men, women and children dying because they could not\nhave access to medicines at prices MSF or the Thai government could\nafford,\\u201d said Cawthorne, adding that the issuing of compulsory licenses\nhad led to an \\u201cimpressive scaling up of treatment\\u201d.\nBut Jon Pender, director of government affairs with GlaxoSmithKline,\nclaimed it is \\u201cmisleading and counter-productive to focus on intellectual\nproperty protection as a significant barrier to access to medicines in\ndeveloping countries,\\u201d arguing that rampant poverty and inadequate\nhealthcare systems are bigger problems. More than 95 percent of all drugs\non the \\u2018essential medicines list\\u2019 compiled by the World Health\nOrganization (WHO) are not covered by patents, he noted. \\u201cAnd yet the WHO\nsays that one-third of the world\\u2019s population do not have regular access\nto these drugs \\u2013 in parts of Africa and Asia, this rises to two-thirds.\\u201d\nItalian Liberal MEP Gianluca Susta complained that \\u201cnot a single member of\nthe WTO\\u201d has yet decided to use the system agreed in 2003 \\u201cto import cheap\nlife-saving medicines.\\u201d This, he said, \\u201ccould mean that the decision does\nnot address in a satisfactory way the problems faced by developing\ncountries in accessing medicines at affordable prices.\\u201d\nGreg Perry, director-general of the European Generic Medicines\nAssociation, complained that the 2003 decision is \\u201conly likely to have a\nmarginal impact.\\u201d Companies making generic versions of drugs would not\nfind it financially rewarding to supply drugs to small countries, even if\nthey issue compulsory licenses, he said, while recognising that it may be\npossible to overcome that difficulty if several governments could issues\nlicenses jointly.\n\nDavid Cronin may be reached at info@ip-watch.ch.\n\nAlexandra Heumber\nEU Advocacy Liaison Officer\nMédecins Sans Frontières\nAccess to Essential Medicines Campaign\nRue Dupré, 94. 1090 Brussels\n++32 (0) 2 474 75 09 (Dir off)\n++ 32 (0) 479 514 900 (Mob)\n++ 32 (0) 2 474 75 75 (Fax)\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}