{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Tamara Bowen <extrasilver@gillm19.fsnet.co.uk>", "subject": "Hymen penetrator", "body": "\n\nOnline pharmacy presents top products that will make you healthy! You do not need to go to your local drug store, you can buy here any pill that you need.\nOur pharmacy\nWe have only high-quality national medications at low prices. There is no need for someone to know about your sexual problems. \nBuy medications at RX online drug store!\nCompletely conidential and secure purchase.\nWith best regards,\nTamara Bowen\n \n \nIziashchestvo i ottochennost ego dvizhenij nevolno vyzyvali uvazhenie. Tebia sviazyvaiut s etim chelovekom Rodstvennye otnosheniia? Rodstvennye otnosheniia sviazyvaiut Ostina Valigasa s tem, kto poprosil menia Ego razyskat. Alani prav Leshu mnoj eshche nedostatochno horosho obkatano. S etoj mysliu ia pozvolil sebe otkliuchitsia. \nPoka ty byl bez soznaniia, on mog vzhivit tebe etu Shtuku. Serdce moe ot volneniia bilos gulko i nerovno. Bolshaia zhe dolzhna byt nuzhda, chtoby tak udalitsia ot svoego otriada, Siazvil Leks. Potomu chto i sama oshchushchala Opredelennyj emocionalnyj podem ot vseh etih sobytij, i ne ej sejchas sledovalo Osazhivat syna, da bolshe bylo nekomu. Mercaiushchee lezvie priblizilos k moemu licu. Nepovinovenie budet nakazano! vnov zlobno prorokotal vsadnik i shiroko Vzmahnul rukami v storony, prinimaia pozu, harakternuiu dlia sotvoreniia Zaklinaniia. Prekrasno, skazal Nkot, na etot raz shchedro obnazhaia klyki v svoej Nepovtorimoj ulybke: slovno raznial dva nozhovochnyh polotna. Oshibka volnogo Nastupivshee utro bylo ne stol vetreno, kak poslednie neskolko dnej, i Volnye, sobravshiesia vokrug zharkogo kostra na dne Veseloj Balki glubokogo Ovraga bolshoj protiazhennosti, gde oni ukryvalis eshche s leta, bolshe po Privychke, chem po neobhodimosti, kutalis v mehovuiu odezhdu. \nMinutu nazad on byl znachitelno vyshe menia, no Teper ia uravnial ego rost so svoim. Liubimym zaniatiem Altaresa iavliaetsia szhiganie eretikov na kostrah v vospitatelnyh celiah pri Massovom stechenii naroda. Ne slishkom priiatno videt svoiu pokalechennuiu plot. Ne imel prava. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}