{"category": "ham", "to_address": "\"Gerald \\(Jerry\\) Carter\" <jerry@samba.org>", "from_address": "derrell.lipman@unwireduniverse.com", "subject": "Re: svn commit: samba r23120 - in branches/SAMBA_3_0_25/source:\n\tinclude libsmb", "body": "\"Gerald (Jerry) Carter\"  writes:\n\n> Hey Derrell,\n>\n>>> I've already cut the tarball and Fedora RPMs.  We'll \n>>> catch this for 3.0.25b.\n>> \n>> This is *really* frustrating.  Having *THREE* trees to \n>> have to check in to, with some of them temporarily\n>> \"locked\" makes code management completely unreasonable.\n>> This change was made weeks ago.\n>\n> But *you* did not merge it into SAMBA_3_0_25.  This has\n> been a long standing policy and IIRC not the first time that\n> you failed to merge your own fixes.\n\nActually, although it's certainly possible that I missed some, I don't\nbelieve I have missed any in the last year or more.  (Jeremy took some\nthat I had intentionally not checked into the soon-to-be-released\nbranch, but that's different.)\n\n> I've mailed the list\n> several times when the release branch was sync'd with\n> SAMBA_3_0_25.  You have to realize that if you don't check\n> you code it, it would not be in the 25a release.\n\nYes, it's my fault.  I'm not debating that.  What caused it, though, was...\n\n> btw...the only tree that is actually locked is\n> SAMBA_3_0_RELEASE.  The SAMBA_3_0_25 may be temporarily\n> frozen but what that means is that I'm not pulling in\n> any more changes from that branch currently.\n\n... my misunderstanding of this.  I made the change in my local tree but\nI didn't check the change in to SAMBA_3_0_25 when I checked it into the\nother two branches because you had said that SAMBA_3_0_25 was frozen and\nI took that to mean that you did not want any checkins to that branch.\nI now understand that frozen doesn't tell me not to check things in,\njust that you will ignore those checkins for the release you are\ncurrently working on.\n\n>> I was awaiting release of 3.0.25a with these changes, \n>> and this is going to completely screw me up.  (You\n>> said you'd be cutting tomorrow and asked for testing\n>> today, which is what I did, and which is how I found\n>> this.)\n>\n> ok.  Fine.  I'll take it.\n\nThank you!\n\n> In the future, please merge your own changes.  The strategy is\n> straightforward:\n\n> SAMBA_3_0_25 \t\t-> Samba 3.0.25 series\n> SAMBA_3_0_26\t\t-> Samba 3.0.26 series\n> SAMBA_3_0\t\t-> research or works-in-progress\n>\n> I'm not planning any bulk merges between SAMBA_3_0 and\n> SAMBA_3_0_26.  I might do some house cleaning but don't\n> depend on it for inclusion in the release.\n\nI understand.  It's a royal PITA, but I understand.  And I do not\nbelieve there are any current discrepancies in code that I've worked on\nbetween the three branches.  Everything should, I think, be in sync.\n\nThanks again!\n\nDerrell\n\n"}