{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Reynaldo Bateman\" <neddtidatadoq@dtidata.com>", "subject": "Burn pounds off with Anatrim", "body": "\nMelt away fat easily\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most delighting lose flesh product is made available now – As you could see on BBC.\n\n\nDo you retain all the times when you asked yourself to do anything for being rescued from this fastly growing number of kilos? Fortunately, now no major price is to be paid. Thanks to Anatrim, the ground-breaking weight-reducing mixture, you can get naturally health lifestyle and a really slender figure. Take a look at what people state!\n\n\n\n\"I hate to acknowledge it but I was an awful food addict. \n\n\nI devoured all this garbige \n\n\nand just could not stop. \n\n\n\n\nThis torment stopped after I started taking Anatrim! \n\n\nOh, God,\n\n\n\n\n my craving for food abated, \n\n\nspirits improved and I became the happiest person on the planet 22 pounds in 2.8 months. \n\n\n\n\nI can tell you now I’m the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Boston\n\n\n\n\n\n\"I had weight problems since I was a boy. \n\n\nYou can't even fancy how I detested being ridiculed at school. \n\n\n\n\nI detested my stoutness and I detested myself. \n\n\nAfter trying many different remedies I learned about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horror! Many and many thanks to you, my friends.\"\n\n\n\n\n\nMike Brown, San Diego\n\n\n\n\n\n\"Know what? My marriage was saved thanks to Anatrim! I got into this circle, depression – more eating – just more depression. My wife was going to leave the overweight psycho I was turning in. \n\n\nMy best friend pointed to your site and I called for my pack of Anatrim at the same time. \n\n\nThe final result was magnficent, my appetite came to admissible level, I was often in good spirits, and, of course, I became able to tighten my belt on some holes. And you see, the bed became cool, too!\"\n\n\n\n\n\nDave\n\n\n\n\n There is a great number of gratitudes left by happy people taking Anatrim. Don’t you wanna join the thousands and thousands of slender people and take this original appetite-suppressing power raising product now!\n\n\nDon’t miss your opportunity!\n\n\n\n\n"}