{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "CNN AM QuickNews <mailings@mail.cnn.com>", "subject": "State Department official resigns over 'D.C. madam'", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApr 28, 200705:15 AM EDT\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTOP STORIES\nCNN.com \n\n\n\n\n\n\n\n\nState Department official resigns over 'D.C. madam'\n\n\n\n\n\nA top State Department official resigned Friday after revealing to ABC News\nthat he had been a client of the alleged \"D.C. madam's\" escort service.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew York trooper believed killed by fellow officer\n\n\n\n\n\nA New York state trooper who was thought to have been shot and killed by an\nescaped convict this week is now believed to have been killed by friendly\nfire, authorities announced Friday.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWEATHER\n CNN.com/WEATHER \n\n\n\n\n\nYour personalized weather is temporarily out of service. In the meantime, go to http://www.CNN.com/WEATHER for your local weather forecast. Personalized weather will return soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nU.S.\n CNN.com/US \n\n\n\n\n\n\n\n\nWeary Georgians try to wait out wildfires\n\n\n\n\n\nFirefighters worked Friday to keep wildfires from spreading to miles of\ndrought-stricken forest near the Okefenokee Swamp as most residents evacuated\nfrom more than 100 homes were allowed to return.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPet food companies say FDA searched their plants\n\n\n\n\n\nFederal agents searched facilities of a pet food manufacturer and one of its\nsuppliers as part of an investigation into the widening recall of products\nmade with ingredients contaminated by an industrial chemical, the firms\ndisclosed Friday.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPolice officer faces new charges in bartender beating\n\n\n\n\n\nProsecutors announced 14 additional felony charges Friday against a Chicago\npolice officer whose videotaped beating of a female bartender made\ninternational headlines.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStudent arrested for essay's imaginary violence\n\n\n\n\n\nA high school senior was arrested after writing that \"it would be funny\" to\ndream about opening fire in a building and having sex with the dead victims,\nauthorities said.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nWORLD\n CNN.com/WORLD \n\n\n\n\n\n\n\n\nSaudis say they've busted massive terror plot \n\n\n\n\n\nSaudi Arabia's Interior Ministry has confirmed the arrests of scores of\nsuspects in an anti-terror sweep related to a terror plot involving attacks on\nsenior officials and government oil, military and security installations,\naccording to a statement posted on the state-run Saudi Press Agency Web site.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSource: Saudi king refuses al-Maliki\n\n\n\n\n\nSaudi Arabia's King Abdullah has denied Iraqi Prime Minister Nuri al-Maliki\nentrance into Saudi Arabia, according to a senior Saudi intelligence source.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSomalia capital peaceful; government says rebels routed\n\n\n\n\n\nGuns and mortar launchers were silent Friday as residents of Somalia's\nshattered capital gave mixed reactions to the government's claim of victory\nafter nine days of fierce fighting with Islamic insurgents.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDowned Russian helicopter kills 18\n\n\n\n\n\nEighteen people are dead after a Russian-made Mi-8 military transport\nhelicopter crashed in the volatile province of Chechnya.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nBUSINESS\n CNNmoney.com \n\n\n\n\n\n\n\n\nDoes Intel fear $100 laptops?\n\n\n\n\n\nNicholas Negroponte, founder and chairman of the One Laptop Per Child (OLPC)\nnon-profit group, on Thursday revealed big news about his laptop for the poor\nchildren of the world. His biggest revelations at a Cambridge press and\nanalyst briefing: The laptop will run Windows, and the group is seriously\nconsidering selling it in the United States.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor Dow, good things come in 3s\n\n\n\n\n\nWall Street showed its mettle Friday, with the Dow industrials closing at a\nrecord high for the third day in a row and the Nasdaq hitting its highest\npoint in 6 years, despite a weaker-than-expected GDP reading.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nSPORTS\n SI.com \n\n\n\n\n\n\n\n\nPeter King: First-round NFL mock draft\n\n\n\n\n\n\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx-Mets employee admits to selling steroids\n\n\n\n\n\nSAN FRANCISCO (AP) -- A former New York Mets clubhouse employee pleaded guilty\nFriday to distributing steroids to major league players for a decade and has\nagreed to help baseball's steroids investigators.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nHEALTH\n CNN.com/HEALTH \n\n\n\n\n\n\n\n\nBreak your kid's whining habit\n\n\n\n\n\nWhen it comes to torture, we could all learn a thing or two from kids. Who\nknows better than they how to extract most anything they want within minutes\nof applying the technique? I'm talking about whining, of course -- that\ngrating mewling that causes us to do anything (anything!) just to make it go\naway. But you can break the habit. And the rewards of victory can be rich for\nboth of you.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAddictive drugs harm brain's natural brake\n\n\n\n\n\nA single dose of morphine was found to lower the inhibitions of rats, even\nafter the drug had left their systems, a finding that may help scientists\nbetter understand addiction in humans, U.S. researchers say.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nTECHNOLOGY\n CNN.com/TECH \n\n\n\n\n\n\n\n\nSocial-networking sites link Hispanic youth\n\n\n\n\n\nIndie rocker Eric Monterrosa checks his ElHood.com Web page at least three\ntimes a day, answering fans, surfing for other new Latin artists and keeping\nin touch with friends from his native Colombia.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchools say iPods becoming tool for cheaters\n\n\n\n\n\nBanning baseball caps during tests was obvious -- students were writing the\nanswers under the brim. Then, schools started banning cell phones, realizing\nstudents could text message the answers to each other.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTop Stories\n\nWeather\n\nU.S.\n\nWorld\n\nBusiness\n\nSports\n\nHealth\n\nTechnology\n\nEntertainment\n\nFeatures\n\n\n\n\n\n\n\n\nENTERTAINMENT\n CNN.com/SHOWBIZ \n\n\n\n\n\n\n\n\nReview: 'Next'? Go to the back of the line\n\n\n\n\n\nEven when we haven't seen an action movie before, we've seen it before.\n\n\n\n\n\nFULL STORY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGere apologizes in kissing controversy in India\n\n\n\n\n\nRichard Gere tried to quell the storm over a public kiss he gave a Bollywood\nstar at an AIDS awareness event, apologizing Friday for any offense.\n\n\n\n\n\nFULL STORY\n      WATCH VIDEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network. A Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us.\n\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the American Morning Quick News, click here.\n\n\n\n\n\n\n\n\n"}