{"category": "spam", "to_address": "theorize@plg.uwaterloo.ca", "from_address": "\"Jess F. Evans\" <bpx@fugro.com>", "subject": "I met a friend who was staying next door but was not aware of the problem.", "body": "ERMX Jumps 12.5% and Volume Goes Through The Roof!\n\nEntreMetrix Inc. (ERMX)\n$0.18 UP 12.5%\n\nBig news last week pushed investors to the table. Wallst.net release of\nan audio interview got them excited. This is only the first day after\nthe release. Act fast and get on ERMX Tuesday morning!\n\nSo, what's The Great Paradox I'm talking about regarding all\nthecontroversy over The Secret? , has launched dozens of web sites which\noffer online shopping, free stuff, website reviews and more.\n\nThank you so much for the question. There's no mushrooms in the pizza!\n\nMy father was extremely verbally and emotionally abusive. He is in what\nthey call permenant remission. I am deeply greatfull to God that I was\nable to give to Him all the justified rage and hatred of my abusers. Or\nat the very least, a nice little increase.\n\nMy heart begins to race. My family prayed over my dad while he laid in\nhis hospital bed barely conscious. I know I would have called for the\nreason that I didn't get what I had ordered and that's what I was\nlooking forward too.\n\nIn my own style, via my own life, via the vessel of my ownexperiences\nand soul, this is what I was writing to you about, and what every other\ninspirational writer . I believe I am in the awakening of a miracles and\nthe beautiful unconditional conscousness of love, Banditta will be full\ncured.\n\nThe Universe and God awaits you. I don't want to 'win' a pizza. My son\nsaid \"Mom, let me leave you with this. Now my question to you, my friend\n- What do you think happened next? It's not there either! or so they\nappeared at the time.\n\nWeather you liked the pizza or not.\n\nPlain cheese pizza is so FABU!\nAs you sat there pondering what to do, it hit you. Asked for the manager\nand said, \"Hey, my monthly pizza arrived without mushrooms and onions\nUNDER the cheese\".\n\nI worried about who would be taking care of him. \"You Can\" realize your\nLife Vision. Certainly, the miracle of his recovery from this condition\nis much bigger than the fact that probably the best doctor in the nation\nwas his doctor.\nI look down at the pizza.\n\nIt's said that money doesn't grow on trees, right? Google will now lets\nyou put three link units instead of two on the same Web page.\n\nAll was successful until he got home.\n\nAnd yet, at different times of our lives,we glimpse the possibility of\nthe magic weyearn for, and for just an instance, the skyopens up and the\nlight of the true Creatorsparkles in our eyes.\n\nHe is now at home and is alive and still getting better.\n\nIn the meantime, the loss of such a big advertiser is likely to drag\nprices down across the network. And now -      The first bite.\nValuable content at no cost!\n\nI take two stove-hot boxes from the bright-eyed Papa John's courier.\nWhat a bright and new fresh day it will be when you become accountable.\n\nGuess it right first on the blog, and in the next few days I'll share\nwith everyone what special bonus you win in addition to the home\ndelivery of pizza. A few weeks later, a widower who had been married to\none of mama's friends asked her to lunch after church. I worried about\nwho would be taking care of him.\n\nI prayed for both, and the next day the drapes came - the exact size and\ncolor to fit the window and match the carpet!\nIn the grander scheme of things, things like pizza, or postings, are\ntrivial. \"That\" Secret is the biggest bunch of nonsense served to the\npublic on a shiny platter all year. Therefore, the question is - \"So\nwhat do I do now? I found an old email with information on \"Dream\nHealer\" by Adam. Have them say \"hello\", upload it, and away you go! My\nbrother asked me, is it working in your life? When we first found out\nabout his condition, we had no idea what his condition was. Stay still,\njust enjoying the moment.\n\nMy family prayed over my dad while he laid in his hospital bed barely\nconscious. I believe that God through the Holy Spirit touched my heart\non that particular day to pray that prayer about my mother.\nI felt so compeled to do the service, and as I stood there that day I\ntruly knew I was a miracle in the making.\n\n- and reframing it in such a way as to show youthe hidden gifts,\nstrengths and wealth to be had when looking atthese same challenges in a\ndifferent light. But it does raise a question though.\n\nIt's sitting there right in front of your eyes!\n\n"}