{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "645p 4/9 Update: Soyuz crew welcomed; NASA announces station contract", "body": "\n\n\n\n\n645p 4/9 Update: Soyuz crew welcomed; NASA announces station contract\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 06:30 p.m., 04/09/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/07/07 (02:00 p.m.): Soyuz launched\n   04/09/07 (03:20 p.m.): Soyuz TMA-10 docks with space station\n   04/09/07 (06:30 p.m.): Hatches opened; station crew welcomes Soyuz cosmonauts, Simonyi aboard\n\n=================================\n\n06:30 p.m., 04/09/07, Update: Soyuz docks with space station; NASA announces Russian contract extension\n\nA Russian Soyuz spacecraft carrying two fresh crew members and a wealthy American space tourist docked with the international space station today to close out a two-day orbital chase. NASA, meanwhile, announced a $719 million contract extension with the Russian federal space agency to, in part, provide the Soyuz lifeboats and supplies needed to eventually boost the station's crew size from three to six.\n\nWith spacecraft commander Oleg Kotov monitoring an automated approach, the Soyuz TMA-10 spacecraft docked at the downward facing port of the Russian Zarya module at 3:10 p.m. as the two spacecraft sailed high above Eastern Europe.\n\nJoining Kotov in the cramped capsule were Expedition 15 commander Fyodor Yurchikhin and U.S. software developer Charles Simonyi, who paid the Russians more than $20 million to become the fifth private citizen to visit the space station.\n\n\"Contact and capture, docking confirmed, at 11:10 p.m. Moscow time (3:10 p.m. EDT),\" said NASA commentator Rob Navias from the Russian mission control center. \"Docking confirmed, a perfect arrival. Soyuz TMA-10 has arrived at the international space station.\"\n\nMartha Stewart, a close friend of Simonyi who attended launch at the Baikonur Cosmodrome, was on hand at the Russian control center in Korolev for today's docking. She spoke to Simonyi during a brief welcome-aboard ceremony.\n\n\"The launch was beautiful, Charles,\" Stewart radioed. \"I just want you to know we all think you are intrepid, a pioneer and above all - guess what? - you're out of this world!\"\n\n\"Martha, it's really an honor to be at this outpost,\" Simonyi replied, smiling and looking relaxed. A few moments later, he flipped about 180 degrees, putting himself upside down relative to his crewmates as Yurchikhin and Kotov spoke to family members.\n\nEarlier, Simonyi said he had written out \"three or four pages, handwritten pages of notes\" describing Saturday's launching and the two-day orbital rendezvous aboard the Soyuz TMA-10 and \"I'm very anxious to transcribe them\" for posting on his blog. \"I wrote down practically every interesting moment of the flight.\"\n\nYurchikhin and Kotov will replace Expedition 14 commander Mike Lopez-Alegria and cosmonaut Mikhail Tyurin, who were launched to the station last Sept. 18 aboard the Soyuz TMA-9 spacecraft currently docked to the aft port of the Zvezda command module.\n\nLopez-Alegria, Tyurin and Simonyi will return to Earth aboard the TMA-9 spacecraft April 20 after a 12-day handover period to familiarize the incoming cosmonauts with space station operations. Astronaut Sunita Williams, who joined the Expedition 14 crew in December after launch aboard the shuttle Discovery, will remain aboard the station with Yurchikhin and Kotov, returning to Earth aboard the shuttle Endeavour later this summer.\n\nLopez-Alegria eclipsed the American single-mission record of 196 days April 2. With landing April 20, the new record for longest time aloft on a single mission by a U.S. astronaut will stand at 214 days. Williams will beat that mark and set a new U.S. endurance record when she ultimately lands on the shuttle.\n\nHer return date is not yet known because it depends on when the shuttle Atlantis finally takes off on the flight before hers, a mission delayed by hail damage to the ship's external fuel tank.\n\n\"I wish you the utmost success in your mission on behalf of NASA,\" NASA astronaut Mike Baker radioed the station crews today from the Russian control center. \"Fyodor, it's good to see you, you look good, Oleg, you look great, too, and Charles, welcome to space, all of you.  Michael, Misha and Sunita, we look forward to seeing you soon. And Suni, we're still working on your ride home.\"\n\nNASA plans a teleconference Tuesday to discuss the progress of work to repair Atlantis's external fuel tank. A news conference with the combined crews of the station also is on tap Tuesday afternoon.\n\nIn other space station developments, NASA today announced a $719 million modification to a current contract with the Russian Federal Space Agency \"for crew and cargo services through 2011.\"\n\n\"The firm-fixed price extension covers crew rotations for 15 crew  members, six in 2009, six in 2010 and three in 2011, delivery and the  removal of 5.6 metric tons of cargo,\" NASA said in a statement. \"U.S. Commercial Orbital Transportation Services (COTS) are still planned to provide the bulk of cargo transportation needs from 2010 and beyond to the space station.\"\n\nNASA plans to retire the space shuttle in 2010 and replace it with the Orion crew exploration vehicle, an updated Apollo-style capsule that will be safer and less expensive to operate. But Orion will not be ready for use until 2014 or 2015, forcing NASA to buy seats on Russian Soyuz spacecraft to ferry U.S. astronauts to and from the space station in the interim.\n\nIn the near term, NASA, the Russians and their international partners want to boost the station's permanent crew from three to six. But to do so requires additional three-seat Soyuz spacecraft to serve as lifeboats and to ferry crew members to and from the outpost. Additional supplies also are needed.\n\nThe statement said NASA would pay the Russians to launch 1.4 metric tons of cargo to the station inside a Russian docking cargo module scheduled for launch in 2010 and  pay for a Russian Soyuz flight to and from the station in 2009 to honor a previous commitment to launch an international partner astronaut to the outpost.\n\n=================================\n\nQuick-Launch Web Links:\n\nNASA ISS-14 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition14/index.html\n\nNASA ISS-15 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition15/index.html\n\nCharles Simonyi:\nhttp://www.charlesinspace.com\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}