{"category": "spam", "to_address": "\"Harry Jonathan\" <henna@plg.uwaterloo.ca>", "from_address": "\"Gertrude S Cunningham\" <Gertrude@orionpress.com>", "subject": "So you wanted another email from Ms. Cunningham, yeah?", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrator Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrator Ring is a safe, user-friendly, pleasure-generating device that\nnot only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrator Ring. \n\nVibrator Ring features include:\n- Raised tickler for her external massaging pleasure.\n- Long-life battery so the ring can give you satisfaction again and again\n- Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrator Ring is taking the world's bedrooms by\nstorm!\n\nhttp://www.mytoysnow.com\nSo get that Motion back in your Ocean! Fun Times are Ahead!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nsaid. He looked at Chiun, helplessly. \"Everything is burning.\" \"Not Chiun\nsaid. Remo stopped looked. Around them, the fire moving down the\nmountainsides like syrup the side of bowl. Trees were burning. Outbuildings.\nLogging What was not snow. The snow was burning. He nodded to Chiun, and he\nand the old man began pile up snow. They built mound the center of biggest\nclearing in front the camp buildings. they had dug out big hollow, \ntold Joey, \"Get in.\" \"What-\" she exclaimed. \"Just get that snow wall.\" The\ngirl, now by the growing insidious of the flames, nodded, and obeyed.\nQuickly, and Chiun built sloping roof of over the structure. girl was sealed\noff from flames. Hopefully, the igloo would last enough for them to their\nwork. She was Now save the copa-ibas. Then save themselves. \"What Chiun-\"\nRemo said. \"Just \nthe Oriental said. * * The old man's of attack was simple. \"Every he said,\n\"wants to fall on its side as as it wants to stand straight. We will help\nthem.\" They moved up north side of the sloping mountain, until were only\nfifty yards ahead of the of fire, which was swooping down mountainside,\nleapfrogging from burning tree to burning As Remo watched, Chiun felt side\nof tree trunk, searching his hands for the point critical balance. Then, \npush that almost childlike, Chiun pressed against the tree, with ripping,\ncracking the big timber toppled the ground. Remo understood. He and Chiun\nalong the line of pushing them over. Big took down smaller trees. Slowly,\nwere creating clearing, in which toppled were piled one on top another. As\nthe flames coming \nthe hillside met that wall, would be no more trees for the to jump to. The\nwould burn itself down toward the ground ignite the fallen trees, but would\nbe slow process, the fire would not have enough energy jump across the\nfirebreak. Without resting, without waiting, kept working his way around rim\nof the bowl of the Remo raced ahead, leveling swath of timber,\n\n\nSpeak to you soon\n\n\n\nGertrude\n\n\n"}