{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Golf Retreats <Harden@efkfempaxo.greatbigsports.net>", "subject": "Let us buy you a Golf Retreat. Participate now ", "body": "You registered to receive this and similar offers from  on\n03/25/2007 15:03.\n\nFREE Golf Retreat\nIncludes two rounds of golf, hotel accommodations and airfare (a $1500\nvalue) \nhttp://efkfempaxo.greatbigsports.net/t/l?aq-uvq-1-nmc-8j9ul\n\nParticipation Required - See site for details\n\nNotice: To claim your reward you must participate in our program and\nmeet all of the offer eligibility requirements as outlined in the Terms\n& Conditions (you may view our Terms & Conditions on the\nRewardsGateway.com site) before you can receive your FREE reward.\nEligibility requirements include signing up for at least two Silver,\nGold and Platinum offers. Copyright (c) 2004-2005 RewardsGateway.com -\nRewardsGateway.com is an independent rewards program and is not\naffiliated with any of the listed products or retailers. Trademarks,\nservice marks, logos, and/or domain names (including, without\nlimitation, the individual names of products and retailers) are the\nproperty of their respective owners, who have no association with or\nmake any endorsement of the products or services provided by\nRewardsGateway. This is a Rewards Gateway e-mail message. If you\nprefer not to receive e-mails from Rewards Gateway in the future, please\nsend an e-mail to: Unsub@RewardsGateway.com or write to us at:22647\nVentura Blvd Suite 258 Woodland Hills, CA 91364 or click here:\nhttp://efkfempaxo.greatbigsports.net/t/l?aq-uvq-2-nme-8j9ul\nThis email is a commercial advertisement sent in compliance with Federal Law.\nWe have no desire to send you information that is not wanted, therefore, \nif you wish to stop future mailings, please follow this link http://efkfempaxo.greatbigsports.net/remove?r.Harden.17-91e7b20-29d4.speedy.uwaterloo.ca.-producttestpanel?r, send a blank message to:\nmailto:r.Harden.17-91e7b20-29d4.speedy.uwaterloo.ca.-producttestpanel@efkfempaxo.greatbigsports.net,\n\nor contact us at: \nHarden Mailers| 9600 Great Hills Trail Suite 150W | Austin, TX 78759 | 512.532.6829\n\n\n\nPhone number for unsubscribe purposes only.\n\nPlease allow 3 business days for request to be processed.\n\n\n\n\n"}