{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 20, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESNation Grieves With Virginia Tech\nGrief blanketed Virginia Tech's campus as bells tolled to honor the 32 victims of the deadliest shooting rampage in modern\n                        U.S. history. Virginia's governor declared Friday a day of mourning, and tributes were conducted across the country. More...Watch: Cho's Video Not Revealing\n• U.S. Walls Off Sunni Enclave In Baghdad\n                     \t\t\t\t\t| Watch• McCain's \"Bomb Iran\" Joke Draws Fire\n                     \t\t\t\t\t| Watch• Senator Reid On Iraq: \"This War Is Lost\"\n                     \t\t\t\t\t| WatchU.S.Rape-Torture Suspect Arrested In New York\nA homeless ex-convict was arrested in the rape and torture of a Columbia University graduate student. She was held hostage\n                        for 19 hours in her apartment, cut with a knife and left tied up with the bed set ablaze. More...\n• Nation Grieves With Virginia Tech\n                     \t\t\t\t\t| Watch• Columbine Families Mourn Virginia Tech\n                     \t\t\t\t\t| Watch• One Missing Coal Miner's Body Found• More StoriesWorldU.S. Walls Off Sunni Enclave In Baghdad\nEven as Secretary of Defense Gates presses Iraqis to reconcile their sectarian differences, the U.S. military is building\n                        a wall around a Sunni enclave surrounded by Shiite communities in Baghdad to stop a cycle of revenge attacks.  More...Watch: Has The Troop Increase Helped?\n• Paintings Found In House Fetch $3.4M\n                     \t\t\t\t\t| Watch• World Bank Weighs Wolfowitz's Fate• Va. Tech Hero Remembered In Israel\n                     \t\t\t\t\t| Watch• More StoriesPoliticsMcCain's \"Bomb Iran\" Joke Draws Fire\nRepublican presidential candidate John McCain's joke about bombing Iran has raised the ire of liberal group MoveOn.org, which\n                        is launching an ad saying the nation \"can't afford another reckless president.\" More...Watch: McCain Defends Iraq Strategy\n• FBI Probe Sidelines GOP Lawmaker• Keene Of The Conservatives• Senator Reid On Iraq: \"This War Is Lost\"\n                     \t\t\t\t\t| Watch• More StoriesHealthReducing Salt Cuts Heart Disease Risk\nEven modest reductions in salt intake can dramatically lower heart disease risk. But cutting down can be a challenge; the\n                        average American eats three times as much salt as is healthy every day, much of it in processed foods.  More...\n• College Mental Health Services Feel Strain\n                     \t\t\t\t\t| Watch• FDA Mulls Motive In Pet Food Case• Heavy Drinking In College May Hurt Heart• More StoriesSciTechYouTube A Conduit For Va. Tech Footage\nA quick YouTube search yields dozens of videos posted in the wake of the Virginia Tech massacre. Many are simply news footage\n                        taken from the various networks, but there are also tributes to the victims and dramatizations of the killer's manifesto. More...Watch: Reflection On A Tragedy\n• Dead Whale Retrieved From Brooklyn Bay • Report: Cars Still Beat SUVs In Safety\n                     \t\t\t\t\t| Watch• Could Global Warming Cause War?\n                     \t\t\t\t\t| Watch• More StoriesBusinessGoogle Leads Dow Toward 13,000 Milestone\nGoogle reported a better-than expected 69 percent jump in first-quarter profit. Caterpillar was a heavy mover, too, with a\n                        good first-quarter report, as the Dow industrials pushed toward the 13,000 mark. More...\n• Watch Out For Store Credit Cards• Ex-Qwest CEO Convicted Of Insider Trading• Report: Iraqi Oil Supply Could Be Doubled• More StoriesEntertainmentCustody Of Anna Nicole's Baby Unresolved\nThe dispute between Anna Nicole Smith's estranged mother and ex-boyfriend over the late model's baby remaine unresolved after\n                        a closed hearing in a Bahamas court Friday.  More...Watch: Birkhead Confirmed As Father\n• Tom Cruise Raises Money For 9/11 Detox• Baldwin's Apologizes For Vicious Voicemail\n                     \t\t\t\t\t| Watch• Cam'ron: Snitching Hurts \"Code Of Ethics\"\n                     \t\t\t\t\t| Watch• More StoriesOpinionKnow-Nothing Gonzales\nAlberto Gonzales faced some very basic questions before the Senate Judiciary Committee. But as the National Review Online\n                        notes, his answers amounted to an admission that he knew nothing about what was happening on his watch. More...Watch: Gonzales Defends Firings\n• Gonzales Disowned By GOP\n                     \t\t\t\t\t| Watch• Guns And Abortions• Attack On The Oppressor Class\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: True Emotional Impact Could Lie Just Ahead\nA mental health expert says Virginia Tech students and faculty, most of whom have been so strong and resilient in the wake\n                        of Monday's shootings, are probably in for some very rough days and weeks, as their true feelings hit them, hard. More...Watch: Dealing With Shootings' Scars\n• EARLY SHOW: Va. Tech Women's Softball Games To Go On\n                     \t\t\t\t\t| Watch• EARLY SHOW: Tragedy Turned To Something Positive\n                     \t\t\t\t\t| Watch• EARLY SHOW: Paintings Found In House Fetch $3.4M\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nHouses Slide Off CliffCBS News RAW: Structures tumbled off a hillside on the coast of the Canadian province of Newfoundland, where erosion\n                                    is causing landslides and endangering homes.\nTOP VIDEOS\nFirst Look: Pet Food Recall\nFrance Set To Pick New Leader\nAlec Baldwin's Nasty Message\nReflection On A Tragedy\nNotebook: A Cruel April\nMoving On After Tragedy\nDriver Sets Gas Pump Ablaze\nCampus Tries To Move On\nRepublicans Grill Gonzales\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesAmid the debate whether life in Baghdad is getting better, Lara Logan meets ordinary Iraqis to find out. Sunday at\n                           7 p.m. ET/PT.\n                        48 Hours MysteryNightmare In Napa:A surprising murderer is unmasked in the Halloween killings of two young women. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}