{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nOutsourcing the CIS: Do Utilities and Energy Companies Do That? (UtiliPoint.com - Jun. 8, 2007) \n\n\n\nUtiliPoint.com - Jun. 8, 2007 - Recently I was making a presentation on utility and energy company outsourcing and someone in the audience challenged research UtiliPoint had performed.\n\n\nJun 9, 2007 PowerMarketers Industry Publications\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 23) (June 1 - June 7, 2007)\n\n\n\nEIA - Jun. 8, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nJun 9, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 8, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 8, 2007\n\n\nJun 9, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 7, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 7, 2007\n\n\nJun 9, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nNot plugged into feds' probe: LIPA was unaware that Justice Dept. is questioning KeySpan in investigation of NYC electricity market\n\n\n\nJun. 8--KeySpan Corp.'s revelation this week that the U.S. Department of Justice is seeking information about its role in New York City's troubled electric-energy market did not sit well with the Long Island Power Authority, which had voted just a few hours earlier to approve KeySpan's takeover by London-based National Grid Plc.  The department issued a \"civil investigative demand\" to KeySpan on ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nBGE trade with parent under scrutiny: PSC pledges close look at how relationship affects supply, price\n\n\n\nJun. 8--As a public utility, Baltimore Gas and Electric Co. is obligated to get the lowest price possible for customers. By contrast, its corporate owner, Constellation Energy Group, has a duty to stockholders to sell the power it produces for as much as it can get.  This disconnect is highlighted by the fact that Constellation , which assumed ownership of BGE's former power plants when Maryland ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nTexas, N.J. firms plan coal power plant in Midland: Facility might be open in 6 years, create 100 jobs\n\n\n\nJun. 8--Two out-of-state energy companies want to spend an estimated $1.5 billion to build a high-tech coal-fired power plant in Midland.  LS Power Group of New Jersey and Houston-based Dynegy Inc. have formed a joint venture called Mid-Michigan Energy that would construct a 750-megawatt plant. The proposed project likely would result in 100 permanent skilled jobs with about 600 to 1,200 ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU ENERGY ANNOUNCES CUSTOMER PROTECTIONS\n\n\n\nJun. 8--TXU Energy said Wednesday that it has instituted new electricity service options for low-income customers and seniors. They are aimed at easing financial strains caused by high summer bills.  North Texas' largest electricity provider: Will not disconnect for nonpayment those customers who are either low-income or at least age 62 who sign up for a deferred-payment plan.\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nCoal-fired power plant to go up in Midland\n\n\n\nJun. 7--A pair of out-of-state companies plan to spend $1.3 billion to build a coal-fired power plant in Midland, according to a report in the Midland Daily News.  New Jersey-based LS Power and Houston-based Dynegy have formed a joint venture called Mid-Michigan Energy that would construct a 750-megawatt plant. The project is expected to take about six years to complete, including two for ...\n\n\nJun 7, 2007 Knight Ridder Tribune Business News\n\n\n\nLegislators looking at alternative fuels plant incentives: Senate presidents want special session, but Democrats hesitant\n\n\n\nJun. 8--A proposal designed to lure an alternative fuels plant to Kentucky will be pitched to members of a legislative energy subcommittee during its meeting next week at the TVA Paradise power plant in Muhlenberg County.  The meeting is one of three planned during the next two weeks as Gov. Ernie Fletcher and Senate President David Williams push for a special session of the legislature they say ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU eases rules on deposits, cutoffs\n\n\n\nJun. 8--TXU Corp. on Thursday eased its rules for charging deposits to new customers and shutting off electricity for nonpayment during the summer.  The company's retail unit, TXU Energy, won't charge a deposit to new customers who have paid their bills on time for 12 months and will extend the deal to customers who have one late payment during the year. That puts TXU in a more competitive ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nTalks over proposed coal-fired power plant south of D-FW rile Dallas mayor\n\n\n\nJun. 8--Central Texas leaders are quietly working on a deal that could pave the way for TXU Corp. to build a controversial power plant south of Dallas-Fort Worth in exchange for the energy company agreeing to spend $30 million to make the coal-fired plant cleaner than proposed.  The possible deal comes days before the Texas Commission on Environmental Quality is scheduled to decide whether to ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nPlant in Wharton powers up: Colorado Bend Energy Center starts generating electricity\n\n\n\nJun. 8--WHARTON -- There is now more electricity available to power both economic development and keep home air-conditioners running in Texas this summer. Colorado Bend Energy Center, a new gas-fired combined cycle power plant near Wharton, started generating electricity this month with the completion of the first of two phases.  Once completed, the plant will have the capacity to generate ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nNegotiations under way to sell biogas to Finland\n\n\n\nJun. 8--ZARQA -- The Jordan Biogas Company in Ruseifa is currently conducting negotiations with the government of Finland to sell biogas generated from the Ruseifa landfill, the company's director, Hatem Ababneh, said on Thursday. \"Selling the biogas to Finland is an outcome of Jordan signing the UN Framework Convention on Climate Change in 1992 and the Kyoto Protocol, which allow industrialised ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nOlver, Dems denounce renewable energy plan\n\n\n\nJun. 8--WASHINGTON -- Massachusetts Democrats are criticizing aspects of their party's effort to develop renewable energy sources, saying the legislation would undercut Northeastern states trying limit tailpipe emissions -- a move aimed at combating global warming.  They warn that Massachusetts and 11 other states working to curb auto emissions would be blocked by a provision in an energy bill ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nO'Malley adds $5 million to energy-aid program: 3,000 more families to get help in paying higher bills for electricity\n\n\n\nJun. 8--An extra 3,000 families will be able to get help from the state to cope with steeply rising electric rates this summer, Gov. Martin O'Malley said yesterday as he announced $5 million in additional funding for the Electric Universal Service Program.  O'Malley, who has been under fire from critics for his inability to stop the 50 percent Baltimore Gas and Electric Co.\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nWind leaves damage and power outages\n\n\n\nJun. 8--Toppled trees and snapped branches littered Boulder County on Thursday, businesses remained dark well into the day and crews scaled ladders to restore damaged power lines after unseasonably strong winds blew across the Front Range overnight.  Wind gusts Thursday morning hit a high of 92 mph near Rocky Flats, along Colo. 93, said Matt Kelsch, a Boulder meteorologist.\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nWinds wreak havoc around Weld\n\n\n\nJun. 8--High winds caused a power outage in Windsor, felled several trees and caused general problems in Greeley and Weld County Thursday.  About 400 Xcel customers lost power for about two hours in Windsor Thursday afternoon, including several downtown businesses on the north side of Main Street. Other sporadic power outages were reported around the state, and there were several reports of tree ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\nOG&E announces customer savings\n\n\n\nJun. 8--OG&E Electric Services customers saved more than $177 million over three years since the Oklahoma City company integrated the McClain Generating Plant into its system, OG&E said Thursday.  That's significantly more than the $75 million in savings the company guaranteed that customers would save from 2004-2006. The cost savings won't result in a cut in the rates OG&E charges, because the ...\n\n\nJun 8, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nFeds investigating KeySpan\n\n\n\nKeySpan Corp.'s revelation this week that the U.S. Department of Justice is seeking information about its role in New York City's troubled electric-energy market did not sit well with the Long Island Power Authority, which had voted just a few hours earlier to approve KeySpan's takeover by National Grid. The DOJ issued a 'Civil Investigative Demand' to KeySpan on May 31, but the company didn't ...\n\n\nJun 7, 2007 Newsday\n\n\n\nWind work winds up\n\n\n\nWind work winds up Xcel restores power cut by 100-mph no injuries reported STORY TOOLS   MORE STORIES By Hector Gutierrez, Rocky Mountain News June 8, 2007 Xcel Energy had restored service to all but about 4,000 customers late Thursday after winds exceeding 100 mph toppled trees and knocked out power to 45,000 Colorado homes. Boulder, where winds reached 92 mph at 1:20 a.m.\n\n\nJun 8, 2007 Rocky Mountain News\n\n\n\nQuestar's earns ire for bid to limit customers' participation in regulation\n\n\n\nA Public Service Commission meeting packed with utility customers Wednesday drew the usual complaints about high rates and a regulatory deck stacked in favor of energy companies. But among the three dozen customers who showed up were those worried state regulators would adopt a Questar Gas suggestion to restrict individual Utahns from fully participating in rate cases.\n\n\nJun 8, 2007 Salt Lake Tribune\n\n\n\nBrief storm knocks out power to 20,000\n\n\n\nA brief but intense thunderstorm rolled over Metro Detroit this afternoon, downing limbs and wires from Westland to the Grosse Pointes. Electricity was knocked out for about 20,000 DTE customers scattered through southeastern Michigan. Detroit Edison spokesman Scott Simons said power should be restored to almost all by nightfall. The National Weather Service had issued a severe thunderstorm ...\n\n\nJun 8, 2007 Detroit News\n\n\n\nWal-Mart Now Canada's Biggest Commercial Buyer of Green Power\n\n\n\nJUNE 08, 2007 -- MISSISSAUGA, Ont. -- Wal-Mart Canada Corp.'s three-year agreement to buy 31,000 megawatt hours of clean, renewable power from Bullfrog Power to green the electricity of three of its Alberta stores, together with continuing alternative-energy contracts in Ontario and British Columbia, makes the company the nation's largest commercial purchaser of green power.\n\n\nJun 8, 2007 Progressive Grocer\n\n\n\nLIPA board OKs KeySpan-Grid pact\n\n\n\nOver the objections of two county legislators, the Long Island Power Authority board of trustees Wednesday approved a contract for National Grid Plc and KeySpan Corp. to manage the regional power grid, providing a crucial endorsement as the companies seek a state nod to complete their merger. In a unanimous vote after a year of negotiations and a month of deliberations, the board approved the ...\n\n\nJun 7, 2007 Newsday\n\n\n\n\n\nTXU Energy Announces Enhanced Residential Customer Protections\n\n\n\nCommitments Include Summer Protections Regarding Disconnection, Flexible Payment Terms for At-Risk Customers, Expanded Deposit Waivers     DALLAS, June 7 /PRNewswire-FirstCall/ -- Today, TXU Energy, a subsidiary of TXU Corp. (NYSE: TXU), announced new customer protections, including a summer moratorium on disconnects for critical care, low-income, and customers that are at least 62 years ...\n\n\nJun 7, 2007 PR Newswire\n\n\n\nContractor Selected for $30 Million Environmental Project at NRG Energy's Huntley Plant, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources (Sugar  Researched by Industrial Info Resources (Sugar Land, Texas). A design, supply and construct contract has been awarded for the estimated $30 million fabric filter (baghouse) project at NRG Energy's Charles R. Huntley Power Station in New York.  For details, view the entire article by subscribing to Industrial Info's Premium Industry News at ...\n\n\nJun 8, 2007 Internet Wire\n\n\n\nPSE&G Endorses New Transmission Lines To Improve Long-term Electric Reliability in New Jersey\n\n\n\n500-kilovolt reinforcements will ease future transmission reliability concerns NEWARK, N.J., June 8 /PRNewswire-FirstCall/ -- Public Service Electric and Gas Company (PSE&G) today endorsed construction of several new 500-kilovolt transmission lines that will significantly improve the long-term reliability of the electric system that serves New Jersey customers.\n\n\nJun 8, 2007 PR Newswire\n\n\n\nFitch Rates PEPCO Holdings' Sr. Notes Issuance 'BBB'; Outlook Stable\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings has assigned a rating of 'BBB' to Pepco Holdings, Inc.'s (PHI) (NYSE: POM) $250 million issuance of 6.125% unsecured senior notes due June 1, 2017. The Rating Outlook is Stable. The new notes will rank equally with other senior notes of PHI. Fitch expects that PHI will use the proceeds for general corporate purposes, including to redeem at maturity ...\n\n\nJun 8, 2007 Business Wire\n\n\n\nProgress Energy Carolinas Seeks Slight Fuel Factor Increase in North Carolina\n\n\n\nFiling reflects settlement agreement from 2006; average residential impact is 1.3% RALEIGH, N.C., June 8 /PRNewswire-FirstCall/ -- Progress Energy Carolinas today filed a request for a slight increase in the fuel rate charged to its North Carolina customers. The increase reflects a settlement agreement from 2006, which spread prior fuel costs over a longer recovery period to minimize the effect ...\n\n\nJun 8, 2007 PR Newswire\n\n\n\nEC Power Experiencing Strong Growth\n\n\n\nHOUSTON--(BUSINESS WIRE)--EC Power, the leading transaction service provider (TSP) in the Electric &amp; Gas Industry, reported today several significant milestones thus far in 2007. The strong growth for the Texas-based company follows an impressive year of growth in 2006, when EC Power greatly broadened their customer base by adding 7 new customers and grew revenue by 14%.\n\n\nJun 8, 2007 Business Wire\n\n\n\nEPRI Analysis Finds California Can Meet Greenhouse Gas Reduction Goals, But Economic Costs Depend on Approach\n\n\n\nPALO ALTO, Calif.--(BUSINESS WIRE)--The Electric Power Research Institute (EPRI) today released the results of an analysis that shows that California can achieve its goals of reducing greenhouse gas emissions to 1990 levels by 2020, but at a cost to the states economy. Depending on how California implements its climate legislation, cumulative real costs to the states economy range from 0.2 ...\n\n\nJun 7, 2007 Business Wire\n\n\n\nOG&E's McClain Savings Exceed $177 million\n\n\n\nCompany's rates improve to 24 percent below national average OKLAHOMA CITY, June 7 /PRNewswire-FirstCall/ -- OG&E Electric Services customers have saved more than $177 million since the company integrated the McClain Generating Plant into its system. The savings, reported Thursday in a filing with the Oklahoma Corporation Commission, are significantly greater than the $75 million the company ...\n\n\nJun 7, 2007 PR Newswire\n\n\n\nEverton Energy Selects R.J. O'Brien for Risk Management Services\n\n\n\nWICHITA, Kan.--(BUSINESS WIRE)--Everton Energy, LLC announced today that it has selected R.J. OBrien and Associates, Inc. (RJO), as a strategic partner in implementing its risk management program. Everton Energy is in the business of developing and acquiring renewable energy production and is initially focused on ethanol plants. RJO is the nations largest independent futures brokerage firm.\n\n\nJun 7, 2007 Business Wire\n\n\n\n\n\nU.S. Wind Industry Milestone: GE Ships 1,000th 1.5-Megawatt Wind Turbine For FPL Energy\n\n\n\nLos Angeles, CA - Two leaders of the U.S. wind industry, GE Energy and FPL Energy, recently announced a milestone for their wind businesses: the shipment of the 1,000th GE 1.5-megawatt wind turbine for an FPL Energy project. The landmark unit will be among the 267 machines GE is supplying for FPL Energy's Peetz Table Wind Energy Center in Colorado. By year-end 2007 the number of GE wind turbines ...\n\n\nJun 8, 2007 Power Online\n\n\n\nUS FERC approves reduced conditional ComEd transmission rate hike\n\n\n\nThe US Federal Energy Regulatory Commission has approved conditionally an increase in Commonwealth Edison's transmission rates, Exelon, the Chicago-based utility's parent company, said Friday. In a US Securities and Exchange Commission filing Friday, Exelon said FERC on Tuesday approved a formula-based transmission rate that would see the average bill of a ComEd residential customer rise by about ...\n\n\nJun 8, 2007 Platts\n\n\n\nTXU Energy Adopts New Measures Designed to Protect Customers\n\n\n\n- 5:52 p.m. DALLAS (AP) - TXU Energy, the electricity generation unit of TXU Corp., said Thursday it has initiated new customer protections including a summer moratorium on disconnects for critical care, low-income and older customers. TXU said it will also waive deposit requirements for low-income residential customers that are at least 62 years old, and for all customers with a good record of ...\n\n\nJun 7, 2007 Canadian Business Magazine\n\n\n\nEconomics Mines Lecture\n\n\n\nEconomist advocates strategic national energy framework Accra, June 8, GNA- Mr. Kwame Pianim, an Economist on Friday stressed the need for a national strategic framework that would ensure adequate and reliable energy to power the nation's new thrust for accelerated development. 'The recurrent cycle of load shedding must be put to an end, it happened in 1998 and again in 2007.\n\n\nJun 8, 2007 UPI\n\n\n\nOldest U.S. Nuke Plant Seeking Re - Licensing\n\n\n\nOldest U.S. Nuke Plant Seeking Re-Licensing Wayne Parry June 8, 2007 - 12:29 a.m. LACEY TOWNSHIP, N.J. (AP) - Nearly three decades after the accident at the Three Mile Island nuclear power plant highlighted the issue of atomic energy safety, fears of a catastrophic accident or terrorist attack are at the forefront of the debate over whether the nation's oldest nuclear reactor should be allowed to ...\n\n\nJun 8, 2007 Canadian Business Magazine\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nYingli Green Energy Announces Pricing of Initial Public Offering of its American Depositary Shares\n\n\n\nBAODING, China--(BUSINESS WIRE)--Yingli Green Energy Holding Company Ltd. (NYSE: YGE), a leading vertically integrated manufacturers of photovoltaic, or PV, products in China, announced the pricing of its initial public offering of American Depositary Shares (ADSs) at a price to the public of US$11.00 per ADS. Each ADS represents one ordinary share of Yingli Green Energy.\n\n\nJun 8, 2007 Business Wire\n\n\n\nSan Francisco Building to Raise the Bar on Sustainability\n\n\n\nKMD Architects' 'green' design for Public Utilities Commission headquarters set to exceed LEED Platinum, go off grid and minimize carbon footprint. SAN FRANCISCO, June 8 /PRNewswire/ -- KMD Architects' design for a new 12-story headquarters for the San Francisco Public Utilities Commission is expected to be a leader in demonstrating energy efficiency, water recycling and reduced carbon footprint ...\n\n\nJun 8, 2007 PR Newswire\n\n\n\nAcciona Connects to the Nevada Grid the World's Largest Solar Thermal Plant in 16 Years\n\n\n\nBOULDER CITY, Nevada--(BUSINESS WIRE)--Acciona Solar Power, a world leader in the design, development and ownership of solar thermal technologies, has announced that its Nevada Solar One project, the largest-capacity solar power plant built in the world in 16 years and the third-largest of its kind, has begun supplying power to the Nevada Power grid. The plant represents an investment of more ...\n\n\nJun 7, 2007 Business Wire\n\n\n\nEnel wins auction for 25 per cent of Russia's power generator OGK-5\n\n\n\n7 June 2007 - Italy's Enel has won an auction for a 25 per cent stake in wholesale power generating company OGK-5 from electricity monopoly UES, offering 39.2bn roubles ($1.52bn) for the shares. The other bidders were E.On Russia Power, aluminium giant RUSAL and natural gas producer Novatek. The initial bidding price was set at 24.6bn roubles. OGK-5 is one of the six wholesale power generating ...\n\n\nJun 7, 2007 Power Engineering\n\n\n\nUSW, GAMESA Announce Ratification of First Contract\n\n\n\n03:27 PM Eastern Daylight Time USW, GAMESA Announce Ratification of First Contract PHILADELPHIA--(BUSINESS WIRE)--New USW members at Gamesa in Ebensburg, PA and Fairless Hills, PA have voted to approve their first contract by an 80% vote in favor. The ground-breaking three year agreement lays the foundation for a strong USW-Gamesa partnership, as well as significant pay raises, bonuses, and ...\n\n\nJun 7, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}