{"category": "spam", "to_address": "\"Ernesto Luke\" <theorize@plg.uwaterloo.ca>", "from_address": "\"Marjorie\" <Marjorie@halloran-sage.com>", "subject": "You know about the 9th don't you?", "body": "TIRED OF THE SAME OLD ROUTINE?\n\nThis is just the solution you've been searching for- the Vibrator Ring has\nbeen specifically designed to increase both his and her pleasure. The\nsilicone rubber ring expands to comfortably fit all sizes, and will give you\nthe same incredible results every time. \n\nThe Vibrator Ring is a safe, user-friendly, pleasure-generating device that\nnot only stimulates her, but also allows him to maintain it longer and\nstronger. If it's an enjoyable, vigorous love-life you want, then try the\nVibrator Ring. \n\nVibrator Ring features include:\n Raised tickler for her external massaging pleasure.\n Long-life battery so the ring can give you satisfaction again and again\n Non-toxic, silicone rubber for the everyone's comfort.\n\nRead on and see why the Vibrator Ring is taking the world's bedrooms by\nstorm!\n\nhttp://service46.vibetimes.com\nLoads of fun, so easy to use, will Bring a Smile every time.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManage your email preferences: http://service46.vibetimes.com/index.asp\n\n\n\n\nthis, we ain't got no chance. wanna know how the Mafia woulda this-\" \"What\ndo you know about the you clown-\" Tolan said. Gregory realized were the\nfirst words Tolan said since arriving, except \"Bang, bang\" under his breath.\n\"Enough. Enough,\" Gregory \"You see what mean- men, all of we're so bored,\ndon't have anything better to do to pick on each Picky. Picky.\" \"Dicky\ndoo,\"' Tolan. Gregory ignored him. pointed at each of the men, in turn, with\nhis Eberhard Faber \n482 #1 yellow pencil. \"But all over now. got something to live for. We're\nto live big lives. They're going know we were here. We're to live huge.\"\n\"Ah, life, its sweetness challenges said Lizzard, who had returned his head\nhis hands and was drifting off sleep. \"How we gonna live-\" said. \"I'm giving\nup good job union organizing.\" \"Money's not your anymore,\" Gregory said.\n\"We're an army and well-financed army. And \nenemy is the Mafia Bay City. We're after them, boys.\" \"Good,\" said Tolan.\n'em all. Blow their eyes Shoot their brains all over street. Gut shoot so\nthey die slow. Fill up with compressed air and them blow up. them alive\nbefore we shoot them. their guts in street. Set fire to their intestines.\"\nLizzard retched. covered his mouth with his so he wouldn't throw up on the \nsomething like that,\" Gregory said. pointed with his pencil at table of\norganization. is it. Our army. We name.\" \"What for-\" said nervously. He did\nwant anyone to out he was connected with these we don't have how will we get\nmail-\" Tolan said. \"That ain't funny,\" said Baker. \"We \nname because we them to know who's after them. We them to fear dark,\"\nGregory said. \"To know that each could be their last. know that each person\nthey pass the street might live only to them die. We want them be afraid as\nthey have made afraid. That's why...\" He pointed his pencil. \"That's why\nneed name.\" To emphasize the point, grabbed the pencil in both\n\n\ngotta go\n\n\n\nMarjorie\n\n\n"}