{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "445p 5/31 Update: Shuttle cleared for 6/8 launch", "body": "\n\n\n\n\n445p 5/31 Update: Shuttle cleared for 6/8 launch\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 16\nPosted: 4:30 PM, 5/31/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-12 (05/11/07): Hail damage repairs virtually complete; Atlantis, external tank cleared for rollout\n   SR-13 (05/14/07): Rollout moved up one day to 5/15\n   SR-14 (05/15/07): Shuttle rollout begins\n   SR-15 (05/24/07): Updating flight plan, launch windows\n   SR-16 (05/31/07): FRR concludes; Atlantis 'go' for June 8 launch\n\n=================================\n\n04:17 PM, 05/31/07, Update: Flight readiness review concludes; Atlantis 'go' for June 8 launch\n\nNASA managers today wrapped up a two-day flight readiness review and cleared the shuttle Atlantis and its seven-member crew for blastoff June 8, at 7:38 p.m., on a hail-delayed mission to deliver a new set of solar arrays to the international space station.\n\n\"We had a very good review over the past day and half,\" said Bill Gerstenmaier, director of space operations at NASA headquarters. \"I have two things I'd like to announce. First, we've set the launch date for June 8 at 7:38 in the evening. And the second thing is that there was no hail storm the evening before the meeting began.\"\n\nLaunch originally was scheduled for March 15, but the flight was delayed in the wake of a freak hail storm Feb. 26 - the day before the original flight readiness review - that caused major damage to foam insulation protecting the shuttle's external tank. That damage has now been repaired, and shuttle Program Manager Wayne Hale said there are no other major issues to be resolved.\n\n\"We have a team, particularly in the external tank area, that was hit with this unforeseen and unexpected occurrence of the hail storm,\" he said. \"In spite of a great deal of work that had to be done, they accomplished it in a very professional manner. ... We are extremely confident, we have done perfectly good repairs and we will have a tank that is safe to fly.\"\n\nThe primary goals of mission STS-117 are to deliver a new crew member - Clayton Anderson - to the space station; to install a $367 million set of solar arrays and a powerful rotary joint to help them track the sun; and to complete the retraction of another set of arrays so it can be moved later this year.\n\nThree spacewalks are planned and the crew is prepared to stage a fourth, supplies permitting, if they run into problems retractiong the P6 array.\n\nThe work is a critical step in a sequence of three shuttle flights to build up the station's electrical power system and clear the way for the long-awaited attachment of European and Japanese research modules late this year and early next.\n\nAt the controls aboard Atlantis will be commander Frederick Sturckow, pilot Lee Archambault and flight engineer Steven Swanson. Their crewmates are Patrick Forrester, James Reilly, John \"Danny\" Olivas and Anderson, who will replace astronaut Sunita Williams aboard the space station.\n\nThe astronauts are scheduled to fly to the Kennedy Space Center from Houston Monday evening, arriving around 6:30 p.m. If all goes well, engineers will begin Atlantis' countdown at 9 p.m. Tuesday.\n\n\"The processing out at the launch pad is going extremely well,\" said Launch Director Mike Leinbach. \"We got our ordnance on board the ship last night, we'll be pressurizing our hypergolic and MPS (main propulsion system) tanks over the weekend, we have one more round of battery charging for the payload and we'll be ready to pick up the launch countdown Tuesday night.\n\n\"The team is really pumped to get this done this time,\" he said. \"We've endured three months of down time due to the hail storm and the recovery from that. ... Team, Atlantis is ready to go and we'll look forward to launch next Friday night.\"\n\nAtlantis' launch period extends through July 19. But a Lockheed Martin Atlas 5 rocket carrying a classified National Reconnaissance Office payload is scheduled for launch from the Cape Canaveral Air Force Station the morning of June 14.\n\nNASA can make four attempts to launch Atlantis over a five-day period - June 8-12 - before standing down for the Atlas and to top off on-board supplies of hydrogen and oxygen. The shuttle launch period would reopen on June 17, regardless of whether the Atlas went on June 14 or 15.\n\nAssuming Atlantis gets off on time, however, the shuttle will dock with the space station around 3:40 p.m. on June 10. Landing back at the Kennedy Space Center is targeted for June 19 at around 2:44 p.m. A detailed timeline is available on the CBS News STS-117 Quick-Look page.\n\n=================================\n\nQuick-Launch Web Links:\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}