{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "940p 6/8 Update: Shuttle managers pleased with external tank", "body": "\n\n\n\n\n940p 6/8 Update: Shuttle managers pleased with external tank\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 28\nPosted: 9:32 PM, 6/8/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-24 (06/08/07): Shuttle Atlantis fueled for launch; weather 80 percent 'go'\n   SR-25 (06/08/07): Fueling complete; ECO sensors working normally; crew in final preparations\n   SR-26 (06/08/07): Astronauts strap in for launch\n   SR-27 (06/08/07): Atlantis rockets into orbit\n   SR-28 (06/08/07): NASA managers pleased with performance of repaired external tank\n\n=================================\n\n7:50 PM, 6/8/07, Update: Space shuttle Atlantis rockets into orbit (9:30 p.m. update to add quotes and details from post-launch news conference)\n\nRunning three months late, the space shuttle Atlantis, carrying seven astronauts and a $367 million set of solar panels, roared to life and raced into orbit today, hot on the trail of the international space station. The shuttle's patched-up external fuel tank, its foam insulation heavily damaged by hail in February, appeared to withstand the rigors of launch without shedding any dangerous foam debris.\n\nWith commander Rick Sturckow and pilot Lee Archambault at the controls, Atlantis' three hydrogen-fueled main engines roared to life and spun up to full throttle before ignition of the ship's twin solid-fuel boosters at 7:38:04 p.m.\n\nThe fuel-laden 4.5-million-pound spaceship instantly climbed away from pad 39A at the Kennedy Space Center, wheeled about to line up on a northesterly trajectory and rocketed away up the East Coast to kick off NASA's 118th shuttle flight.\n\nLaunch originally was scheduled for March 15, but the flight was put on hold after a freak Feb. 26 hail storm that blasted the top of the tank's foam insulation. More than 3,000 dings and gouges had to be repaired with poured or sprayed-on foam insulation, giving the tank a pockmarked, two-tone complexion.\n\nThe first 135 seconds or so of flight are considered the most critical from a debris impact perspective because during that period, the shuttle is still in the lower atmosphere. Any lightweight foam debris that separates from the tank would decelerate rapidly in the thicker atmosphere, allowing the shuttle to run into it at a high relative velocity. Higher up in thinner air, debris does not slow as rapidly and impact velocities are lower.\n\nWhile detailed analysis of launch camera and video footage is not yet complete, television views beamed down from a camera mounted on the side of the tank showed a clean ascent with only one small piece of debris spotted just after solid rocket booster separation two minutes and five seconds after launch.\n\n\"We are glad to report that the external tank has performed in a magnificent manner,\" said shuttle Program Manager Wayne Hale. \"I couldn't be prouder of the team and I think this bodes well for the future as we look forwared to the completion of the international space station.\"\n\nAs for the debris, Hale said a preliminary analysis of launch video \"indicates it didn't strike the orbiter.\"\n\n\"It was at the very end, or just past, the aerodynamically sensitive time,\" he said. \"Hopefully as we continue to make improvements in the tank we will eliminate even that, which should not be a hazard occurring that late in the flight.\"\n\nThe remainder of Atlantis' eight-and-a-half-minute climb to orbit was uneventful. Aboard the space station half a world away, commander Fyodor Yurchikhin, flight engineer Oleg Kotov and Sunita Williams watched the launch on a video feed provided by flight controllers in Houston. If all goes well, Sturckow will guide the shuttle to a docking with the space station around 3:38 p.m. Sunday afternoon.\n\n\"What a great way to start the year and what a great way to start this mission,\" said Bill Gerstenmaier, chief of space operations at NASA headquarters.\n\nThe primary goal of Atlantis' mission is to attach a huge new set of solar panels to the right side of the station's main power truss, along with a powerful rotary joint to keep the huge arrays face-on to the sun. The combined truss segments tip the scales at nearly 36,000 pounds, making this one of the heaviest space station payloads to date. The two new solar panels, when fully extended, will stretch 240 feet from tip to tip and slowly rotate like giant paddle wheels.\n\nThe astronauts also hope to complete the retraction of another set of identical arrays, used to provide power to the lab complex during the initial stages of assembly, so it can be moved to its permanent position on the left end of the power truss later this year.\n\nThe crew of shuttle Discovery ran into major problems retracting one side of the P6 array in December and ultimately staged an unplanned spacewalk, manually shaking free stuck grommets on frayed guide wires to fold the pleated blind-like array into its storage canister. While Atlantis' crew hopes to benefit from lessons learned and retract the remaining blanket automatically, they will be standing by to provide hands-on spacewalk assistance if necessary.\n\nAttaching the new $367.3 million S3/S4 solar array truss segments, completing the retraction of P6 and ultimately re-extending its two wings on the port side of the main power truss later this year will clear the way for attachment of European and Japanese research modules, both major milestones on the road to completing the station in 2010.\n\n\"I hesitate to say any part of the sequence is more critical than any other,\" NASA Administrator Mike Griffin told CBS News. \"It's a chain and you can break any link, and the chain doesn't function. But you have to recognize that the sequence leading up to getting our first international partner module, the (European Space Agency's) Columbus lab, up is a very, very significant thing. It's going to assume an importance maybe even larger than it really has just because of the imagery of that.\"\n\nIn August, the shuttle Endeavour will carry supplies to the station and attach a spacer segment to the S4 solar array installed during Atlantis' mission to permit the eventual attachment of a fourth and final set of arrays, known as S6.\n\nIn October, Discovery will deliver a new multi-hatch node called Harmony, temporarily mounting it on the port side of the Unity module that connects the U.S. and Russian segments of the station. The astronauts then will move the retracted P6 solar array to its permanent location the left end of the main power truss in one of the most challenging assembly tasks yet attempted. If all goes well, the arrays will be re-extended, boosting the station's electrical power.\n\nAfter Discovery departs, the station crew will use the lab's robot arm to remove the shuttle docking port now on the forward end of the Destiny laboratory module and attach it to Harmony. The station astronauts then will move Harmony and its shuttle docking port to the front end of Destiny and stage a series of spacewalks to route power and cooling to the new module.\n\nThat will set the stage for the long-awaited December launch of the Columbus research module, which will be attached to Harmony's starboard port. The Japanese Experiment Module will be bolted to Harmony's port hatch early next year.\n\n\"Everything now is pretty serial ... it is quite a production,\" said Anderson, a station crew member hitching a ride to the outpost aboard Atlantis. \"We're going to put those pieces in place one step at a time and then if we do have any problems, we'll deal with those one step at a time such that we can get the Columbus module, the JEM modules on board the station, docked to Harmony, because that is a huge step to the international capability of the station. This is going to be a big four or five flights in a row.\"\n\nUnder the original schedule, Anderson was to launch in June aboard the Endeavour, replacing astronaut Sunita Williams aboard the station as a member of the Expedition 15 long-duration station crew.\n\nBut during an unusually violent storm that thundered over the launch pad on Feb. 26, Atlantis' external tank was blasted by hail. Most of the damage was restricted to the upper liquid oxygen section of Atlantis' tank and when all was said and done, it took three months to repair. As a result, Atlantis' flight slipped to June and Endeavour's to August.\n\nWilliams was launched to the space station aboard Discovery last December. NASA managers initially said she could safely remain aloft until August but after additional consideration, they decided to bring her home in June, as originally planned, but on mission STS-117 instead of STS-118. Staying up through August was not a health threat for Williams, officials said, but her cumulative exposure to space radiation could preclude a future station flight. And so, the decision was made to bring her back to Earth on schedule aboard Atlantis.\n\nAt the same time, NASA managers decided to move Anderson, Williams' replacement, from Endeavour to Atlantis.\n\nIWith today's on-time launch, Atlantis is scheduled to undock from the station June 17, leaving Anderson behind with Expedition 15 commanderYurchikhin and Kotov. Williams will return to Earth with Atlantis' crew, gliding to a touchdown at the Kennedy Space Center around 2:45 p.m. on June 19.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}