{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Raul Dupree\" <nexcapitalaccesswod@capitalaccess.us>", "subject": "Burn pounds off with Anatrim", "body": "\nGetting thinner can be enjoyable\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most exciting flesh loss product is now readily available – As told on Oprah.\n\n\nDo you hold in your memory all the cases when you told yourself you would do anything to get rid of this fastly growing number of kilos? Luckily, now no big price is to be paid. Thanks to Anatrim, the ground-shaking pound-melting medley, you can get healthier lifestyle and become really slimmer. Take a look at what our customers state!\n\n\n\n\"It’s rather difficult to admit it but I was exceedingly addicted to food. \n\n\nI greedily devoured all this garbige \n\n\nand was unable to stop. \n\n\n\n\nThis ruinous passion stopped after I started course of taking Anatrim! \n\n\nGod,\n\n\n\n\n my craving for food decreased, \n\n\nspirits increased and I became the happiest person 20 pounds in 2.3 months. \n\n\n\n\nSo, I can tell you now I’m the happiest person!\"\n\n\n\n\n\nRita R., Chicago\n\n\n\n\n\n\"Since my early childhood I was a bulky boy. \n\n\nYou can't imagine how I abhorred being derided at school. \n\n\n\n\nI hated my stoutness and I detested even myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally dragged me out of this fearful nightmare! A plenty of thanks to you, my friends.\"\n\n\n\n\n\nMike Brown, Washington\n\n\n\n\n\n\"You know what? My marriage was saved thanks to Anatrim! I went into this circle, depression – more eating – just more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nMy best friend pointed at your web site and I ordered my pack of Anatrim right off. \n\n\nThe final result was excellent, my appetite came to admissible level, I was often in a good mood, and, certainly, I went some belt holes back. And the sex became fantastic, too!\"\n\n\n\n\n\nKarl\n\n\n\n\n There are lots of sincere gratitudes happy people leave after trying Anatrim. Why don't you join the thousands and thousands of slender people and try this original appetite-abating power lifting product now!\n\n\nDon’t miss the opportunity!\n\n\n\n\n"}