{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Common Dreams <commondreams@mail.democracyinaction.org>", "subject": "What Would Molly Do?", "body": "\n\n\n\n\n \n\n\nJune 21, 2007\nDear Friend of Common Dreams,\nEarly this year, the progressive community lost one of its most passionate, colorful, and relentless voices.\nMolly Ivins, whose columns appeared regularly on CommonDreams.org, spoke out loudly and often for peace and democracy. \nAbove all, Molly preached the politics of hope. \nMolly's unique and inspirational voice has gone silent. But we - you and I - can and must keep her message and her spirit alive.\nWill you help?\nWe must raise $75,000 to meet our summer goal. So far, we're only about a third of the way there.\nIf you've already contributed, thank you! \nIf not, can you make a donation now - large or small - so that we can continue to bring you the news and views that really matter? The news and views you won't get from the likes of FOX, CNN and the rest of today's bottom line-driven media? \nI'm sure you shared our optimism last November when the American people signaled their dismay with the current state of national and world affairs - and especially, with the disaster in Iraq. \nAnd yet, here we are . . . no closer to ending this illegal occupation.\nJust weeks before she died, Molly mustered the strength to plead with us all to act. She told us to step outside and take some action - just like the people we told you about last week, in Arrowsic, Maine, who overwhelmingly approved a resolution asking President Bush and Congress to immediately end the American occupation in Iraq.\nMolly reminded us that it's up to us. She told us to raise hell. \"We need people in the streets, banging pots and pans and demanding, 'Stop it, now!,' she wrote. \nDo we even have to wonder, what would Molly do?\nThis fierce defender of democracy, who once described herself as \"ever optimistic to the point of lunacy\" never gave up.\nAnd neither should we.\nCommonDreams.org is committed to bringing you news and opinions free of the influence of corporate advertising or sponsors. We rely 100% on you, our readers, to keep us going.\nBut it's an uphill battle. And we just can't do it without your help.\nWe can't replace Molly's big, booming Texas voice.\nBut with your help, we can carry on her mission by bringing you the voices of the many other journalists and activists who share her passion for peace, as well as her conviction that we can all make a difference. \nPlease take a minute to think about how much reading CommonDreams.org is worth to you, and contribute what you can. We value every donation - large and small.\nYou can make your secure, tax-deductible online donation right now here. Or, you can print our donation form and mail it back to us with a check here.\nThanks so much. We can't do it without you!\nWith thanks and hope,\nKatherine Paul for the CommonDreams.org team \nP.S.Our readers are our only source of funding. We need more of you to pitch in. Thanks!\nAll contributions to Common Dreams are now tax-deductible to the fullest extent allowed by law.\n\n\n\nYou may make a secure on-line donation right now or print & mail a contribution form: \n\n\n \n \n\n \nWe respect our supporters privacy. Information provided by you will never be sold, rented, exchanged or otherwise disclosed to any other organization. Read our privacy policy here.\n \nTo unsubscribe, send an email to unsubscribe@commondreams.org with \"Unsubscribe\" in the Subject field."}