{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Cheapflights Travel Deals <cheapflights@list.cheapflights.com>", "subject": "American, jetBlue; $70 U.S. Airfares, More", "body": "\n\nAmerican, jetBlue; $70 U.S. Airfares, More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tApril 12, 2007\n\n\n\n\n\n\n\n\nFrom: \nTo: \n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n \n\nIN THIS ISSUE: U.S., CARIBBEAN & EUROPE DEALS\n\n\n\n\n\n\nCheap Flights From Your Local AirportBest airfares from your hometownAustin, TX Baton Rouge, LA Chicago, IL Cincinnati, OH Cleveland, OH Columbus, OH Corpus Christi, TX Dallas/Ft. Worth, TX Detroit, MI El Paso, TX Fort Wayne, IN Houston, TX Indianapolis, IN Kansas City, MO Lexington, KY Lincoln, NE Louisville, KY Madison, WI Memphis, TN Milwaukee, WI Minneapolis, MN Nashville, TN New Orleans, LA Oklahoma City, OK Omaha, NE St. Louis, MO San Antonio, TX Toledo, OH Tulsa, OK Wichita, KS Click here for more city departure choices.\n\n\n\n\n\n\n\nfrom $89 RTKayak\n\njetBlue Bargains! jetBlue's Best Airfares The lowest fares we've seen on popular U.S. routes; includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $93 RTOrbitz\n\nFlights Under $200 Roundtrip\nU.S. Airfares for Under $200 \nSelect departure city from pull-down menu to view sale airfares; includes taxes. \n\n\n\n\n\n\n\n\nfrom $119 RTKayak\n\nFlorida Airfare BargainsFlorida Savings: jetBlue, United, More The best airfares to Orlando, Tampa, Miami and more. Includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $78 RTAmerican Airlines\n\nAmerican Airlines \u0097 Spring  Deals \nAmerican Airlines U.S. Flight Bargains Low fares on dozens of popular U.S. routes \n\n\n\n\n\n\n\n\nfrom $78 RTMajor U.S. Airlines\n\nAirfare Deals to New York City!New York City Spring Airfare Savings Enjoy the Big Apple at its springtime best!\n\n\n\n\n\n\n\n\nfrom $86 RTMajor U.S. Airlines\n\nCheap Flights From Detroit! Detroit to Your Favorite U.S. Destinations Don't miss these low fares from the Motor City.\n\n\n\n\n\n\n\n\nfrom $93 RTOrbitz\n\nUnited Airlines: Nationwide Sale\nUnited Airlines U.S. Spring & Summer Sale \nSave now, save later on flights to/from dozens of cities. One-way fares available. \n\n\n\n\n\n\n\n\nSave Up to 75%Vacations To Go\n\nTropical Cruise Deals of the Week \nLast-Minute Cruises: Up to 75% Discounts \nCruise away your cares: Caribbean, Mexico and Hawaii sailings on top lines.\n\n\n\n\n\n\n\n\nfrom $329 RT1800FlyEurope\n\nEurope Airfare Deals of the Week\n  Europe  Airfare Savings + 5%  Hotel Discount\n Europe's top cities this spring +  Cheapflights' exclusive 5% hotel discount.\n\n\n\n\n\n\n\n\nfrom $549 /personBritish Airways\n\nEurope Airfare & Hotel Packages \nEurope Spring Air/Hotel Packages Includes airfare, 3-nights accommodations at centrally located hotels and daily continental breakfast. \n\n\n\n\n\n\n\n\nfrom $98 RTMajor U.S. Airlines\n\nCheap Flights From Dallas! Dallas to Your Favorite U.S. Destinations See how far your dollars can take you around the U.S.\n\n\n\n\n\n\n\n\nfrom $83 RTTravelocity\n\nOnly 1 Day Left! Major Airlines Sale on Travelocity \nNationwide Spring-Thru-Summer Airfare Savings Lock in savings for your vacation travel. Purchase by April 12.\n\n\n\n\n\n\n\n\nfrom $297 RTKayak\n\nHawaii Deals of the WeekHawaiian Islands Airfare Savings Nationwide departures to Honolulu, Hilo, Maui and more. Includes taxes, fees.\n\n\n\n\n\n\n\n\nfrom $404 /personPriceline\n\nVegas \u0097 Incredible Savings at The PalmsLas Vegas Palms Casino 3-Night Air/Hotel Package \n  Enjoy one of the  trendiest Vegas resorts with these low rates for multi-star luxury. Check out Ghost Bar, Rain (dance club) and Skin (outdoor nightclub).\n\n\n\n\n\n\n\n\nfrom $70 RTMajor U.S. Airlines\n\nAirfare Deals to San FranciscoSan Francisco Spring Airfare Savings Don't miss these low fares to the City by the Bay.\n\n\n\n\n\n\n\n\nfrom $78 RTMajor U.S. Airlines\n\nCheap Flights From Chicago! Chicago to Your Favorite U.S. Destinations Low fares on flights from the Windy City \n\n\n\n\n\n\n\n\nSave Up to 60%Hotwire\n\nThis Week's Top Hotel Specials 4-Star Hotels at 2-Star Prices! Pick your favorite city: Get up to 60% off retail rates on hotels all over the U.S.\n\n\n\n\n\n\n\n\nfrom $189 /personTravelocity\n\nCruise Price-Breakers Caribbean, Mexico, Hawaii Cruise Deals Cast off your cares with a 3-night \u0097 or longer \u0097 cruise. Sail on top lines including Disney, Royal Caribbean and Celebrity.\n\n\n\n\n Universal Orlando® Resort Limited Time Offer: Unlimited Admission to Two Parks for $85.99/person! Explore two amazing theme parks for an entire week for less than the price of a Disney® 1-day ticket (with Park Hopper Option). \n\n\n\n\n\nfrom $263 RTPriceline\n\nMexico Airfare Deals of the WeekMexico Flight Savings Nationwide departures to Cancun, Acapulco, Puerto Vallarta, Mazatlan and other top cities. No advance purchase required; travel April 17 thru June 30.\n\n\n\n\nThe TRENDSETTER Deal\n Bhutan\nBhutan Custom Tour: Designed Exclusively for You! Explore Druk Yul, the Land of the Thunder Dragon, on a guided land tour to Paro, Thimphu, Punakha, Bumthang and more. Get expert advice on what to see and do in the mysterious jewel of the Himalayas.Asia Transpacific Journeys \n\n\n\n\n\n\n\n\n\n Tell a friend   Change \nyour profile  |  Unsubscribe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nTRAVEL NEWS\n\n\n\nIn the Headlines\u0085 From Cheapflights.com's daily travel news and other sources: \u0095 Last days for Southwest Airlines' summertime fare savings \u0095 US Airways slashes fares up to 65% on Northeast routes \u0095 FCC retains ban on in-flight passenger cell phones \u0095 Delta Air Lines discounts Boston/Logan airfares \u0095 Hawaiian Airlines, jetBlue earn top honors in Airline Quality Rating study \u0095 Mid-April union strikes could affect air, ground travel in Italy \u0095 Delta Air Lines to offer seasonal JFK to Nantucket service \u0095 Improvements at Phoenix Airport's Terminal 2 enhance travelers' experience \u0095 New Vegas/McCarran off-airport rental car center debuts The Lighter Side of Travel \u0095 Astronaut Will Run Boston Marathon in Space \u0095 California Amusement Park Bans Shrieking, Screaming on Rides \u0095 New Travel 'Trend': Nuclear Tourism Is Hot! \u0095 Vegas Flight Cancelled Because of Pilot's Language, Behavior Trip Planning & Destinations \u0095 Act Now to Lock In Savings on Summer Travel \u0095 World Series of Poker to Hold Ladies-Only Poker Camp in Vegas \u0095 Best Caribbean Golf Courses \u0095 Europe's Top Resorts Are Off-Season Treasures \u0095 The Latest Aviation News \u0097 and How It Will Affect Travelers \u0095 Vegas' Aladdin Will Morph Into Planet Hollywood Resort & Casino on April 17 \u0095 Bikes and Bulls: An Alpha Male Adventure\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nGETAWAY CALENDAR\n\n\n\nApril 16\u009622: Spa treatments at top venues are only $50 during Spa Week in over a dozen top U.S. cities. Chicago (IL), April 23: Chicago Improv Comedy Festival; April 27\u009630: Art Chicago; International Antiques Fair Dallas (TX), April 27\u009628: Texas Tales Storytelling Festival Del Mar (CA), April 19\u0096May 5: Del Mar National Horse Show Houston (TX), April 28\u009629: Pod Chili Cook-Off Hunter Mountain (NY), April 28\u009629: TAP Craft Brew & Fine Food Festival Nashville (TN), April 27\u009628: L'Eté du Vin, wine tasting and auction Natick (MA), April 20\u009622: New England Folk Festival Philadelphia (PA), April 25 & 27: Philadelphia Wine Festival San Francisco (CA), April 28: International Beer Festival Washington, D.C., April 19\u009620: Smithsonian Craft Show; April 27\u009630: ArtDC Coming Soon: Baltimore (MD), May 11\u009619: Preakness Celebration; May 19: The Preakness horse race Las Vegas (NV), May 11\u009612: Cars, Stars and Guitars Motorhead Festival Memphis (TN): The month-long Memphis in May celebration\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   Want the \nlatest airline and related news? Visit Cheapflights.com Flights News\n\n\nFind the best airfare deals on Cheapflights.com\n\n\n\n\n\n  From: \nTo: \n\n\n\n\n\n\n\n\n\nFlights | \nPrivacy Policy | \nContact us\n\n\n\n\nWould you like to \nUnsubscribe? \n\n\n\nTerms and Conditions:\n\nCheapflights.com does not sell tickets, but publishes deals and displays \ninformation only. Prices do not include taxes and other fees unless \nstated.   We list deals that are correct when \npublished, but cannot guarantee accuracy or completeness. \n\nThe information provided in this e-mail may include inaccuracies and \ntypographical errors. Terms and Conditions apply to the above deals and \nthese deals may expire or be subject to change. Cheapflights.com (USA) \nInc., its subsidiaries & affiliates are not liable for any claims of \ndamages, loss or injury to persons or property arising out of this \nnewsletter. For more details on a specific deal, check with the agent or \ncompany selling the tickets.\n\nFor written correspondence please contact Cheapflights (USA) Inc. at 24 School \nStreet, Boston 02108.\n\n\n\n\n\n"}