{"category": "ham", "to_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "from_address": "Thomas Lumley <tlumley@u.washington.edu>", "subject": "Re: [R] help comparing two median with R", "body": "On Tue, 17 Apr 2007, Frank E Harrell Jr wrote:\n\n> The points that Thomas and Brian have made are certainly correct, if one is \n> truly interested in testing for differences in medians or means.  But the \n> Wilcoxon test provides a valid test of x > y more generally.  The test is \n> consonant with the Hodges-Lehmann estimator: the median of all possible \n> differences between an X and a Y.\n>\n\nYes, but there is no ordering of distributions (taken one at a time) that \nagrees with the Wilcoxon two-sample test, only orderings of pairs of \ndistributions.\n\nThe Wilcoxon test provides a test of x>y if it is known a priori that the \ntwo distributions are stochastically ordered, but not under weaker \nassumptions.  Otherwise you can get x>y>z>x. This is in contrast to the \nt-test, which orders distributions (by their mean) whether or not they are \nstochastically ordered.\n\nNow, it is not unreasonable to say that the problems are unlikely to occur \nvery often and aren't worth worrying too much about. It does imply that it \ncannot possibly be true that there is any summary of a single distribution \nthat the Wilcoxon test tests for (and the same is true for other \ntwo-sample rank tests, eg the logrank test).\n\nI know Frank knows this, because I gave a talk on it at Vanderbilt, but \nmost people don't know it. (I thought for a long time that the Wilcoxon \nrank-sum test was a test for the median pairwise mean, which is actually \nthe R-estimator corresponding to the *one*-sample Wilcoxon test).\n\n\n \t-thomas\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}