{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Evening News <cbsnews_evening_news_newsletter-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "CBS Evening News with Katie Couric E-Mail Alert", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Home\n    | U.S.\n    | World\n    | Politics\n    | SciTech\n    | Health\n    | Entertainment\n    | Business\n    | Opinion\n    | Sports\n    | Blogs\n    | Interactives\n    | Video\n\n\n\n\n\n  The Early Show | CBS Evening News | 48 Hours\n    | 60 Minutes | The Saturday Early Show | CBS Sunday\n    Morning | Face The\n    Nation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi everyone,\n \nAn appeals court panel today took a shot at the Bush\n  administration’s terror-detention policies. The court ruled the\n  administration cannot legally detain a U.S. resident suspected of ties\n  to al Qaeda without charging him. Indefinite detention of civilians would\n  have “disastrous consequences for the constitution and the\n  country,” the court said. Wyatt Andrews will tell us about the man at\n  the center of this case – Ali al-Marri – and what it could mean for\n  the future of fighting terrorism within our country.\n \nMeanwhile, fighting al Qaeda in Afghanistan is complicated by its neighbors\n  – especially Pakistan,\n  which is used as a safe haven by many terrorists. Our chief foreign\n  correspondent Lara Logan will report on how the sanctuary provided by Pakistan’s tribal areas is taking a toll\n  on Afghanistan.\n \nIn the United States, thousands of\n  claims have been filed in recent years against the government alleging that\n  required vaccinations caused autism in kids. The first test case among those\n  began today in the U.S. Court of Federal Claims. The vast majority of\n  research finds no link between vaccines and autism, but now it’s the\n  court’s turn to chime in. Sharyl Attkisson will report.\n \nIn other health news, as a new study forecasts that\n  the number of Alzheimer’s patients will quadruple by 2050, controversy\n  is brewing over an experimental drug. Dr. Jon LaPook will have the story.\n \nIf you live in an urban area of the United States,\n  you may have seen detailed pictures of your neighborhood, your street, your\n  home and even yourself online\n  – thanks to Google Maps. Is the Internet search-engine giant’s\n  new “street view” a helpful navigation tool or an invasion of\n  privacy? Daniel Sieberg will take a look.\n \nFinally, if you watched the last episode of the\n  Sopranos last night, chances are you either loved it or you hated it. Richard\n  Schlesinger will report on the landmark last episode that has everybody talking.\n \nI hope you’ll join us for these stories and\n  more,\n \n\n\n\n\nKatie Couric\nCouricandCo@cbs.com \n\n\n \n\n\n \n\n\n \n\n\nAdvertisement\n\n\n\n\n\n\n\n\n\n\n\n\nTo unsubscribe or change your subscription options, click here.\nContact: Email Administrator,\nCBSNews.com, 524 W. 57th St.,\nRoom 514/1, New York, NY, 10019\nHelp | Advertise\n| Terms of Service | Privacy Statement\n©MMVI, CBS Worldwide Inc, All Rights Reserved. \n\n\n\n\n\n"}