{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Gomez U. Hugo\" <vav@email.com>", "subject": "10:30am London 1986 Day 2 - Alan Parsons And Eric Wolfson From Alan Parsons Project.", "body": "\n\n\n\n\n\n\n\nHe said that they have a full line-up of people \ncoming in like Ian Anderson of Jethro Tull. Gary said they did 5 days worth of shows \nover there from 3 different locations. Howard asked him to turn off the music so \nthey could do the show.\nHoward said he thinks that they didn't know that \nthey were going to be there at all so maybe that's why things like that were \nhappening.\n8:15am London 1986 Day 4 - Outside Edge Performs \nLive.\n7:40am London 1986 Day 4 - Robin's News. They \ntalked about what they had hanging up there at the Hard Rock. 6:05am Jackie Craps In \nThe Stanley Cup.\n6:20am London 1986 Day 1 - Comparing Breasts And \nMore.\n7:40am Wack Pack Politically Incorrect With Bill \nMaher.\nHe said that maybe he was upset about the goofing \non the TV shows. 7:10am London 1986 Dan 1 - Dee Snider Visits.\nThe people over there got really annoyed with them \nso they weren't very hospitable at all. He then had to take a commercial break \nbefore having Victoria perform her song parody. He said it would be great if she \ntook off her bra for them. He got sidetracked when he brought up the hotel room he's \nstaying in and how it was like sleeping in a room with another person because he \ncould hear some guy coughing like he was in the same room.\nThe manager said he hopes that they have a great \nbroadcast and wanted to make them feel welcome. The people barely knew they were \ncoming so there was a lot of stuff that didn't get done before they got there. \nHoward took another call and it was working so he talked to the guy for a short \ntime.\nGary said that's what type of Superfan that guy was \nback then. 9:00am London 1986 Day 2 - Penthouse Isn't The Same In England. He said \nthey have some really weird stuff there.\nThe manager said he would do what he \ncould.\n6:00am Various Stuff. Howard said he wanted to get \nto know some of the audience too. He then had to take a commercial break before \nhaving Victoria perform her song parody. He told Gary that he was the one who was \nsupposed to tell the guys not to do that but he apparently forgot to do \nthat.\nHe said that they were pretty much out of material \nalready as well.\nHe said that they were pretty much out of material \nalready as well. 9:55am London 1986 Day 2 - Waiting For Alan Parsons.\nGary said that guy actually won another contest and \ngot into the Private Parts movie where he and his wife were supposed to get naked  \nbut refused.\n8:15am London 1986 Day 4 - Outside Edge Performs \nLive. Live From London 1986 - Day 1.\n8:45am The Gary Puppet Gets Stolen.\nHe said they butter and salt everything even if you \ndon't want it.\nHe talked to Velma and her very white \nboyfriend.\nHe got sidetracked when he brought up the hotel \nroom he's staying in and how it was like sleeping in a room with another person \nbecause he could hear some guy coughing like he was in the same room.\nHe took a phone call after that. That got some \napplause from them.\nHe took one call but could barely hear the woman on \nthe line.\n"}