{"category": "spam", "to_address": "pabuhr@plg.uwaterloo.ca", "from_address": "\"Katy Goff\" <miqekomputerfew@ekomputer.net>", "subject": "Control your weight and appetite", "body": "\nMelt away fat easily\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting product for weighty people is now readily available – As you could see on CNN\n\n\n\nDo you see excessive body kilograms kill more and more people for every new year? We know that you hate the unsightly appearance of those people and the low status they obviously have in society. \n\nOr, maybe, you’ve not the will to withstand a siege of fatal eating habits of yours. Does it sound familiar? Then we have something for you!\n\n\n\n\n\nHere Anatrim comes, the ultimate product for the reduction of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing your feeling of hunger and giving you better cheer. Here you may read what people say about this product:\n\n\n\n\n\n\"It’s outstanding! \n\n\nInstead of watching TV constantly and stuffing myself with food \n\n\nI became keen on taking exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I am in a great shape now and there are lots of men around me!\"\n\n\n\n\n\n\nSilvia D., Chicago\n\n\n\n\n\n\n\"Passive weight reducing was of little result to me. This terrible appetite would just rush in and spoil everything. \n\n\nOnce I was told on Anatrim my very best friend by and I rather liked the information.\n\n\n I had tried to use it, and my wife said to me that I’m not more a weighty man now, 5 months later. \n\n\n25 pounds have gone away and I continue to become slimmer! \n\n\nAnd you know, I’m a passionate lover again.\"\n\n\n\n\n\n\nSteve Doubt, Bellevue WA\n\n\n\n\n\nAnatrim helps your mind to realize you doesn’t have such a great need for that much food. It lifts your mood up, supplies you with additional energy, and attacks unnecessary kilos. All thanks to its mighty original formula!!\n\n\n\nWorm out latest news!\n\n\n\n"}