{"category": "spam", "to_address": "gjditchf@plg.uwaterloo.ca", "from_address": "\"Alisa Bonds\" <heddorogroupses@dorogroup.com>", "subject": "Make your fat friends envy you", "body": "\nAnatrim will change your life\n\n\n\n\n\nAnatrim – The newest and most enchanting product for over-weight people is now readily available – As could be seen on CNN\n\n\n\nDo you realize that superfluous body kilos kill very much people around the whole world? We believe that you hate the unsightly look of people like those and the social stigmata attached to them. \n\nMoreover, you can’t withstand an assault of your baneful eating habits. If you think it sounds familiar, then we got something for your consideration!\n\n\n\n\n\nHere Anatrim comes, the ultimate product for the reduction of your body’s extra weight. The most astonishing thing is that Anatrim improves the quality of your life, making you eat less and giving you better spirit. Pay you attention to what people write on this product:\n\n\n\n\n\n\"It is great! \n\n\nI stopped watching TV constantly and stuffing myself with food \n\n\nI became keen on exercise.\n\n\n\n\n\n\n Anatrim made me take a step up.\n\n\n I have a great shape now and there are lots of men following me with their eyes!\"\n\n\n\n\n\n\nAmely S., San Francisco\n\n\n\n\n\n\n\"Passive weight burning was of no result to me. It was very hard for me to hold back and not to eat something just at hand. \n\n\nOnce I was told on Anatrim my very best friend by and I rather liked the information.\n\n\n I had tried taking it, and my wife said to me I had changed for the better since then, 5 months later. \n\n\n34 pounds have gone away and it is not a limit! \n\n\nAnd you know, I’m an impetuous lover again.\"\n\n\n\n\n\n\nRikky Martin, Las Vegas\n\n\n\n\n\nAnatrim gives you an opportunity to understand you doesn’t have such a great need for that much food. It lifts your mood up, provides you with extra energy, and attacks unnecessary kilos. Especial thanks to its powerful comprehensive formula!!\n\n\n\nElicit more information!\n\n\n\n"}