{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Dorthy Prescott\" <mawcheckrentlistfig@checkrentlist.com>", "subject": "Melt away fat easily", "body": "\nAnatrim will change your life\n\n\n\n\n\nAnatrim – The latest and most fascinating product for weighty people available – As told on Oprah\n\n\n\nDid you understand that redundant body kilos kill more and more people around the planet? We believe you hate the unattractive look of those people and the low status they obviously have in society. \n\nMoreover, you have not the will to resist a pressure of your ruinous eating habits. If it all sounds familiar, then we have something for you!\n\n\n\n\n\nIntroducing Anatrim, the later product for the elimination of your body’s extra weight. The greatest thing is that Anatrim improves the quality of your life by repressing the feeling of hunger and always cheering you up. Here’re what people say about this product:\n\n\n\n\n\n\"This is a great thing! \n\n\nInstead of watching TV constantly and always glutting myself with food \n\n\nI became more interested in doing sport.\n\n\n\n\n\n\n Anatrim put me back on the right track.\n\n\n I have a great shape now and lots of men follow me with their eyes!\"\n\n\n\n\n\n\nMaria H., San Diego\n\n\n\n\n\n\n\"Passive weight burning was of no help to me. This terrible appetite would just rush in and spoil everything. \n\n\nOnce I heard about Anatrim in the commercial and I was really effected by the information.\n\n\n I had tried to take it, and my wife said I look very good now, 3 months later. \n\n\n30 pounds off and I keep still losing them! \n\n\nAnd you know, it’s rather hot in our bedroom now.\"\n\n\n\n\n\n\nMikkey Fox, San Francisco\n\n\n\n\n\nAnatrim gives you an opportunity to realize that you don't need that much food. It lifts your mood up, gives you energy, and attacks useless kilos. Great thanks to its mighty newly-elaborated formula!!\n\n\n\nFind out more about this great product now!\n\n\n\n"}