{"category": "ham", "to_address": "ip-health@lists.essential.org", "from_address": "Mike Palmedo <mpalmedo@wcl.american.edu>", "subject": "[Ip-health] USA for Innovation Calls on Administration Officials to Confront\n Thailand's Theft of US Property", "body": "http://usaforinnovation.org/news/display_article.cfm?ID=19\n\nUSA for Innovation Calls on Administration Officials to Confront\nThailand's Theft of US Property - U.S. Government should elevate\nThailand to the Special 301 Priority Watch List\n\nApril 23, 2007\n\nUSA For Innovation (www.usaforinnovation.org) today released an open\nletter to Secretary of State Condoleezza Rice, Commerce Secretary Carlos\nM. Gutierrez, Secretary of Health and Human Services Michael O. Leavitt\nand U.S. Trade Representative Susan C. Schwab reminding them of the\nimportance of intellectual property (IP) to the American economy and to\nencourage them to use this week's visit by Thailand's Minister of Health\nMongkol Na Songkhla to confront the recent threats by Thailand to seize\npatents owned by American companies.\n\nClick here to read the letter (PDF)\n\nEarlier this month and in anticipation of the Special 301 Report\nannually issued at the end of April, USTR noted that Thailand continues\nto suffer from .widespread commercial IPR counterfeiting and piracy..\nThe new Thai military regime, which assumed power by coup last\nSeptember, has now introduced direct government theft of American\ninnovation into the quickly deteriorating U.S.-Thailand relationship\nthrough its theft of the intellectual property of three drugs produced\nby American and European companies. These drugs, for HIV/AIDS and heart\nconditions cost billions of dollars to develop and market.\n\nIn the open letter, USA for Innovation urges the U.S. Government to\neducate the new Thai government on the consequences of its endorsement\nof dismantling IP protection when Minister of Health Mongkol Na Songkhla\nvisits Washington for high-level government-to-government meetings. In\naddition, the U.S. Trade Representative should elevate Thailand to the\nPriority Watch List in its Special 301 Report to be released at the end\nof April.\n\n.\"Our letter sends a clear message to the U.S. Government about the\nimportance of protecting American IP from theft by the Government of\nThailand,\". said Ken Adelman, Executive Director of USA for Innovation\nand a former US Ambassador to the United Nations. .\"We encourage\nThailand to reconsider the compulsory license of American products.\nMoving forward would represent a further weakening of the US-Thai\npartnership and raises the possibility of U.S. retaliation against the\nKingdom,.\" said Adelman.\n\n.\"This latest action is so disturbing because it comes from the Thai\ngovernment,.\" Adelman said. \".Theft of American innovations by vendors\non the streets of Bangkok is bad enough. Sanctioning, endorsing and\npromoting to other countries a movement to steal U.S. assets in public\nhealth care systems around the world is something else entirely. It\nespecially hurts coming from a long-standing ally of the United States..\"\n\nA scholarly paper commissioned by USA For Innovation finds intellectual\nproperty squarely at the heart of American economic growth -- \"The\nEconomic Value of Intellectual Property\" by economists Dr. Robert\nShapiro and Dr. Kevin Hassett quantifies the value of American\nintellectual property at $5 - 5.5 trillion, equivalent to about 45\npercent of U.S. GDP and greater than the GDP of any other nation in the\nworld\n\nAbout USA for Innovation\n\nUSA For Innovation is a non-profit organization dedicated to the\nprotection of intellectual property and continued innovation around the\nglobe. USA For Innovation educates decision makers, the media and\ngeneral public about threats to innovation. For additional information,\nplease contact us at 866-646-8668 or maura@usaforinnovation.org.\n\n###\n\nExcerpts of the letter:\n\n-  Thailand's Minister of Health Mongkolna Songkhla is in Washington\nD.C. this week and is scheduled to meet with Members of Congress and top\nofficials of the Administration, including Secretary Gutierrez and\nAmbassador Schwab.'s deputy Karan Bhatia. These meetings present an\nexcellent opportunity for U.S. policymakers to remind Thailand of its\nobligations in the global trading system, the numerous benefits the\ngovernment of Thailand receives through U.S. preference programs, the\nimportance of intellectual property (IP) protection to American\ninterests, and concerns that recent actions by the new government in\nThailand threaten our allied bilateral relationship..\n\n-  In September of last year, the military assumed control of the\ngovernment in Thailand, and appointed new officials throughout the\ngovernment. Failure in the new regime appears to be systemic..\n\n-  The important distinction between theft of American assets on the\nstreets of Bangkok and theft of American assets in Thailand.s public\nhealth care system is that the latter is sanctioned, endorsed and\npromoted by the government of Thailand..\n\n-  When Thailand's Ministry of Health issues a compulsory license, it\ndoes so to the GPO, a historically corrupt state-owned, for-profit\nmonopoly..\n\n-  In 2002 Thailand's then-Auditor-General Jaruvan Maintaka issued a\nreport saying that the GPO sold about 60% of its medical products to\ngovernment agencies at above market prices. In some cases, prices were\nmarked up 1,000 percent..\n\n-  Even more disturbing than Thailand's desire to rob American\ninnovation for the sole benefit of building up its state-owned drug\ncompany are the implications such actions have on public health in\nThailand. For starters, the facilities used by GPO to manufacturer these\nHIV/AIDS medicines have not been approved by the World Health\nOrganization for meeting basic internationally acceptable standards for\nsafety and efficacy. Even worse are the resistance levels Thai patients\nare developing as a result of shoddy medicines distributed by the GPO..\n\n-  Thailand's Minister of Health has repeatedly claimed that compulsory\nlicenses are necessary because \"we don't have enough money to buy safe\nand necessary drugs for the people under the government's universal\nhealth scheme.\" This claim comes at a time when new military leaders\nawarded themselves wage increases totaling $9 million and raised\nmilitary spending by more than 30%, or $1.1 billion..\n\n-  Consider additional measures to protect American intellectual\nproperty in Thailand, including:\n\n   a. the revocation of benefits accrued to Thailand under the\nGeneralized System of Preferences; b. the imposition of import tariffs\nto redress direct takings by the government of Thailand from American\ninnovators and legitimate patent holders c. the removal of additional\ngovernment aid to the current regime due to concerns over democracy and\ncorruption..\n\n--\nMike Palmedo\nResearch Coordinator\nProgram on Information Justice and Intellectual Property\nAmerican University, Washington College of Law\n4910 Massachutsetts Ave., NW Washington, DC 20016\nT - 202-274-4442 | F 202-274-0659\nmpalmedo@wcl.american.edu\n\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}