{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Daniel Hammond <isternitzk@glen-oak.com>", "subject": "Preved!", "body": "\n\nDo you have problems with prescriptions?\nGo to the site\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nEverything for your health\nYou can buy absolutely legal, perfect quality must have medications at lowest prices just in few minutes!\nWith best regards,\nDaniel Hammond\n \n \nKogda-to, okolo dvuh s polovinoj Tysiach mezhlet nazad po vashemu vremeni, odin iz nas, leshuk, umiral v Odinochestve na planete, kotoruiu izbavil ot Prokolda, umiral ot povrezhdenij, Poluchennyh v bitve, i na nego nabreli llery, aborigeny planety, na kotoroj On srazhalsia. Ty mne nichego ne Dolzhen. Vse, chto ty reshish pokazat varshe, ia uvizhu v svoem zerkale, Voland kivnul na zasloniavshee ugol komnaty bolshoe ovalnoe zerkalo vysotoj v Chelovecheskij rost i peredal pechatku Gilsveri. On nas Prosto ispytyval, gotovil dlia reshaiushchego srazheniia. \nOn vzial ocherednuiu liazhku treskuna i s zavidnym appetitom prinialsia ee Obgladyvat, demonstrativno ne obrashchaia vnimaniia na vytianuvsheesia ot dosady i Zlosti lico Gronta, i bez togo bezobrazno dlinnoe. A esli Vestniki razdeliatsia? Esli chast Vestnikov napravitsia siuda, a Ostalnye rvanut k nubesam, chtoby uzh naverniaka nadrat zadnicu zasferniku? Vybiraj vyrazheniia, paren. Zhenshchin podobnye Oshchushcheniia obhodiat storonoj kuda chashche. Alkash i poslednij merzavec. Tem ne menee Altares ne upustil sluchaia povorchat po povodu etoj nebolshoj Zaderzhki. V ostalnyh gorodah Istochniki Okazalis stol slaby, chto ne sposobny byli podderzhivat dazhe odin parnyj Portal. Shataias, ia ostanovilsia v dvuh shagah ot poverzhennogo protivnika. Bros sejchas zhe! Gront ne obratil na nee ni malejshego vnimaniia, slovno krome nego i Altaresa zdes bolshe nikogo ne bylo. \nChto-to mne govorilo, chto bolshe Segodnia my dvigatsia ne budem i Nkot privel nas na mesto nochlega. Vspyshka sveta. chto zh, vpolne vozmozhno, ne toropias proshelestel Dos. I tak kak ia edinstvennyj ostavshijsia ot vsej kompanii, on Uhvatitsia za menia rukami i nogami. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}