{"category": "spam", "to_address": "Myrtless <myrtless@flax24.uwaterloo.ca>", "from_address": "Zachary Ratliff <extraex@gite-tilleuls.ca>", "subject": "Healthy life is your dream?", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nOur pharmacy\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nOur shop\nEverything you need to cure yourself.\nWith best regards,\nZachary Ratliff\n \n \nPole snovideniia gotovilos k sleduiushchim koshmarnym vshodam. Posledoval tugoj pronizyvaiushchij udar, i potoki energii hlynuli v moe telo, Okutav ego nesterpimym fioletovym siianiem. Sadilas na Plecho Sholana chasa dva tomu nazad. A tut tut tolko s lysunami voevat. \nHorosho. Ne shali, sluzhivyj, ne liubliu. Tozhe mne, usy, nasmeshlivo hmyknula Onni. Ee neozhidannyj Vopros zastal menia vrasploh: Ty liubil kogda-nibud? Po-nastoiashchemu? Gluboko zhe ia ee zadel, esli ona reshilas sprosit ob etom menia, ne prosto Postoronnego, chuzhogo ej cheloveka, a chuzhaka iz sovsem drugogo mira. Leshuk cherpaet iz nego Energiiu, koncentriruet ee, upravliaet. V temnyh glazah snova polyhnulo groznoe zelenoe Plamia, i gruppa ispugannyh, vozbuzhdennyh i zapyhavshihsia bolshe ot perezhitogo Straha, chem ot stremitelnogo bega liudej zamerla pered nim kak vkopannaia, Edva izbezhav stolknoveniia s etim otpryskom zagadochnoj rasy. Rebenkom! U etih zhenshchin sovsem net predstavleniia o Muzhskoj gordosti! Eto bylo tak unizitelno, tak bestaktno. Ia shevelnul rukami i velichavo raspravil golubye krylia, nakryv luzhu i Bolshoj uchastok zemli vokrug nee gigantskoj sheveliashchejsia teniu. \nZhelanie pristavat k liudiam u mastera mechej momentalno Propalo. Ia uzhe raz spravilsia s nim. Razve chto eti samouverennye bolvany, Absoliutno uverennye v prevoshodstve svoej rasy i liubogo ee predstavitelia nad Vsemi ostalnymi, poslali k Altariu samogo hudshego voina. Uzkij priamoj nos Tonkaia shchel rta, Bescvetnye guby. ejisuminyon XF5FVVtTW1Z0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}