{"category": "ham", "to_address": "Volker.Lendecke@SerNet.DE", "from_address": "Jiri Sasek - RPE Prague <Jiri.Sasek@Sun.COM>", "subject": "Re: VFS module handling ACL on ZFS", "body": "\n>> Thanks... Let me explain a little bit please: I tried to find some \n>> ACL-skilled people who can help me to test this VFS-module first. I had \n>> already discussed with Jeremy about we will release this module in \n>> opensolaris (for me it appears as the Nevada - development branch of \n>> Solaris 11 - which is periodically released [sources] as open solaris) \n>> to ensure more testing than this module will be adopted into the samba \n>> tree. But currently I am trying tho short the period of waiting for the \n>> 3.0.25 release because I am also asked to give this module out for testing.\n>>     \n>\n> Do you want me to check it in now, or do you want to wait?\n>   \nThe best for me could be if somebody more ZFS/ACL-experienced of me (10 \nfrom 10 :-) ) will check it andsend me a feedback what is wrong. I have \nonly tested the \"clicking in WinXP\" will retrieve the same ACE as I set \nbefore. I have also checked the \"ls -V\" lists \"expectable\" (more or \nless) results but there are some details I need to discuss it with \nsomebody experienced....  ...for instance the OWNER@,GROUP@,... default \nACE's behavior. Currently it looks these default ACEs are striped and it \ndoes not have any impact on the WinXP behavior but the POSIX permissions \nmask (obtained by \"ls -l\") seems to be lost on ZFS.\n\n> How confident are you that it works?\n>   \nI need more somebody to peer my observations to check the correctness of \nthe behavior of this module.\n\n\n> It won't make it into 3.0.25, but this is so simple and not\n> compiled by default that I'd rather check it in sooner than\n> later.\n>   \nAlso me ...and Jeremy too. I want to test this code first out of the \nsamba tree than it can be adopted. We will release it in OpenSolaris \nthan it will be adopted in 3.0.26 (or 3.0.25b?) this is up to you and \nthe samba.org team opinion.\n\nJiri\n\n"}