{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nSaturday, 05 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nMan City 0-1 Man Utd\nMan Utd move to within touching distance of the title after victory at derby rivals Man City.\n\n\n\n \nWest Ham 3-1 Bolton\nCarlos Tevez shrugs off the controversy surrounding his move to West Ham by firing them to a vital victory over Bolton.\n\n\n\n \nFulham 1-0 Liverpool\nClint Dempsey's first goal for Fulham eases the London's relegation fear.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nMcLardy in lead at Italian Open\nAndrew McLardy leads the Italian Open going into final round on Sunday after the rain-hit tournament was reduced from 72 holes to 54.\n\n\n\n \nItalian Open leaderboard\nLatest updates from the European Tour event in Milan.\n\n\n\n \nWachovia Ch'ship leaderboard\nLeading scores from the first round in North Carolina.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nRossi clinches pole in Shanghai\nFive-time world champion Valentino Rossi claimed pole position for the China Grand Prix in Shanghai.\n\n\n\n \nRally Argentina positions\nLeading positions from the World Rally Championship event.\n\n\n\n \nArgentine weather disrupts rally\nThe first day of the Rally of Argentina is cancelled after bad weather strands drivers in Buenos Aires.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nAlonso backs Spanish GP changes\nWorld champion Fernando Alonso says changes to Spain's Grand Prix track will make overtaking easier.\n\n\n\n \nSecond crash at Spanish GP track\nWilliams' Nico Rosberg is unhurt in the second high-speed crash at the Circuit de Catalunya this week.\n\n\n\n \nF1 races still boring - Briatore\nRenault team boss Flavio Briatore says changes aimed at livening up Formula One have not worked.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nEnnis equals GB high jump record\nJessica Ennis starts the outdoor season in superb style at an international combined events meetings in Italy.\n\n\n\n \nBack injury frustrates Radcliffe\nPaula Radcliffe is unlikely to defend her World Athletics Championships marathon title because of a back problem.\n\n\n\n \nBack injury for Aikines-Aryeetey\nWorld Junior 100m champion Harry Aikines-Aryeetey returns to London after suffering a back injury during training in the United States.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nGB is top cycling nation - King\nBritish Cycling boss Peter King says this country's riders are the best in the world and will be GB's best hopes of Olympic gold.\n\n\n\n \nUnder-fire Basso parts with team\nIvan Basso quits the Discovery Channel team after an investigation into his role in a Spanish doping scandal is reopened.\n\n\n\n \nDi Luca up for Giro after big win\nDanilo Di Luca is looking forward to challenging for glory in May's Giro d'Italia after victory in the Liege-Bastogne-Liege race.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nHolloway column\n\"I'm not a fan of the Kate Moss range - shorts and leggings, what's that about?\"\n\n\n\n \nReview of the week\nChelsea and Man Utd are the butt of the email jokes doing the rounds\n\n\n\n \nFA Cup competition\nWatch our best video entries and vote for your favourite\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}