{"category": "spam", "to_address": "Ktwarwic <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Aaron Contreras <acorn@graphicsexpress.ca>", "subject": "Can't stand sex all day long?", "body": "\n\nDo you want to save your money and get high-quality pills?\nOrder now!\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nClick here\nCompletely conidential and secure purchase.\nWith best regards,\nAaron Contreras\n \n \nNemalo dlia cheloveka, edva peredvigaiushchego nogi. Celikom zapolniv miagkoe kreslo svoej nemaloj tushej i ustremiv Otreshennyj vzgliad v protivopolozhnyj konec dlinnogo zala, on bormotal sebe pod Nos monolog, nachatyj, vidimo, uzhe davno: Narod platit mne za to, chtoby vo vverennom emu makore bylo spokojno, Chtoby dobrosovestno zanimatsia svoimi delami, a ne stradat ot beschinstv Raznyh. Vozmozhno, on ne dozhdalsia vsego kakih-to schitannyh dnej, ne Znaiu telo davno okochenelo, no razlozhenie ego ne kosnulos, chto moglo byt Svojstvami dannogo mesta. Gorod vse-taki Umel oboroniatsia protiv reptilij! Vsego v dvuh shagah ot budki nogi obessileno podlomilis, koleni s Gluhim stukom vrezalis v dorozhnoe pokrytie. \nIa vse eshche nessia vo ves opor na svoem charse, kogda nachalo temnet, a v Okruzhaiushchem lesu snova poiavilis uzhe znakomye mne kostliavye tvari lysuny. Tak v chem zhe Tut zagvozdka? Kogda zrenie i ostalnye sverhchuvstva obmanyvaiut odnovremenno ili Neadekvatno vosprinimaiut i otrazhaiut mir, to ostaetsia eshche sobstvennyj intellekt. chto sluchilos? U nas nepriiatnosti, Niks. Izvineniia priniaty. Ia znal i umel primeniat desiatki otrabotannyh strukturiruiushchih algoritmov Kliuchej, pod dejstviem kotoryh izmeniaiutsia te ili inye psihofizicheskie Harakteristiki tela i mozga. Sheltianin, ne ostanavlivaias, iavno hotel projti mimo menia, i ia ustupil emu Dorogu. Dvizhenie kopyta zadnej nogi zveria navstrechu. Tiazhelo vorochaias na trotuare, ia potianulsia za oruzhiem. \nI tolko posle etogo moj mini-dvojnik Povis na zapiaste Kengsha. Svetoch prineset s soboj magiiu, nejtralizuiushchuiu razrushitelnuiu Silu Kruga Prichastiia. Ia terpelivo zhdal i ispytyval shozhie oshchushcheniia. Ia stoiu zdes, i nikakaia merzost ne staraetsia do menia Dobratsia. ejisuminyon VkRQW0dcU1B0RkFXVlBMH0dEVUFUQF9bWh9RUg==\n \n\n\n"}