{"category": "ham", "to_address": "debian-laptop@lists.debian.org", "from_address": "Celejar <celejar@gmail.com>", "subject": "Re: Wireless network adapter: ndiswrapper loaded, but cannot\n connect to network", "body": "On Fri, 4 May 2007 10:58:26 -0400\n\"Denis Papathanasiou\"  wrote:\n\n> > You can find the chipset by doing 'lspci', and looking for the line\n> > that corresponds to your pcmcia card.\n> \n> Hmmm... I called lspci in verbose mode (I actually did it the first\n> time you asked), but nothing comes back that looks like a chipset\n> definition:\n> \n> # lspci -vvm\n> Device: 02:00.0\n> Class:  Network controller\n> Vendor: Broadcom Corporation\n> Device: BCM4306 802.11b/g Wireless LAN Controller\n> SVendor:        Linksys\n> SDevice:        WPC54G\n> Rev:    02\n> \n\nBroadcom BCM4306 is the chipset; if you use the -n flag, you get the\nactual numeric PCIIDs.\n\n> > What happens when you do 'dhclient eth0'?\n> \n> Well, I am on a network, using an ethernet cable connected to eth0\n> (otherwise, I wouldn't be able to post this ;) but here's that output:\n\n[snip]\n\n> I also tried it for eth1 and got that SIOCSIFFLAGS error again:\n\n[snipped details of SIOCSIFFLAGS errors]\n\n> > You can also check dmesg and syslog for any errors or warnings from\n> > ndiswrapper.\n> \n> Will do, and thanks for the suggestion; it's probably related to\n> whatever SIOCSIFFLAGS means...\n> \n> > BTW, please reply to the list, not to me.\n> \n> Yes, sorry about that, I hit \"reply\" without thinking.\n> \n\nI also see people mentioning firmware in this context. The Broadcom\nchips do need firmware, and if it isn't loaded, the interface will\n(might?) show up but it won't work properly. ndiswrapper should handle\nthe firmware automatically, but it may not be doing so. Look at the\nndiswrapper device list to see if anyone gives precise instructions for\nyour card / chipset.\n\nCelejar\n-- \nssuds.sourceforge.net - a Simple Sudoku Solver and Generator\nmailmin.sourceforge.net - remote access via secure (OpenPGP) email\n\n\n-- \nTo UNSUBSCRIBE, email to debian-laptop-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}