{"category": "ham", "to_address": "ktwarwic@SPEEDY.UWATERLOO.CA", "from_address": "Reliable Sources <reliablesrc@mail.cnn.com>", "subject": "Coming Up on a Special Edition of Reliable Sources", "body": "\n\n\nCNN.com\n\n\n\n\n\n\n\n\n\n\nComing up this Sunday on a Special Edition of Reliable\nSources:\n\nAFTER IMUS: THE MEDIA FALLOUT\n\nNBC and CBS pull the plug on Don Imus... we'll look at the\ncontroversy from every angle with Chicago Tribune Columnist\nClarence Page, who in 2001 led Don Imus in an on-air pledge to\navoid racial and gender stereotypes; Callie Crossley, media\ncommentator for WGBH's Beat the Press; ex-Wonkette Ana Mudle\nCox, a frequent Imus guest who's changed her mind about the\nhost; and ESPN host/Washington Post sportswriter Tony\nKornheiser.  \n\nBehind the Scenes\n\nWhy\ndid NBC News decide to stop the simulcast of \"Imus in the\nMorning?\"  We'll ask Nightly News correspondent Ron Allen.\n\nDouble Standard?\n\nHow do Imus' comments\ncompare to other pollution in pop culture, including rap, TV,\nand movies?  St. Petersburg Times media critic Eric Deggans and\nformer BET Program Director Paul Porter talk about the negative\nimages and messages rampant in other forms of media.\n\nA New Era in PC-ness?\n\nRadio personalities\nStephanie Miller and Roland Martin weigh in on what's okay, and\nnot okay, to say on the air... where's the line?\n\nPlus, Imus wasn't the only racially-charged story in\nthe news this week. The three Duke lacrosse players accused of\nraping an African-American woman a year ago were officially\ndeclared innocent this week by the North Carolina Attorney\nGeneral. We'll take a look at why the press owes them an\napology.\n\nJoin us this Sunday and every Sunday at 10am\nET / 7am PT for our critical look at the media!\n\n\nRead our privacy guidelines at:\nhttp://www.cnn.com/privacy.html\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click  here.\nTo unsubscribe from the Reliable Sources list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=reliablesrc\nThis message was sent to you at ktwarwic@SPEEDY.UWATERLOO.CA\n\n\n\n\n\n\n\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network.\nA Time Warner Company\nAll Rights Reserved.\n\n\n\n\n\n\n\n"}