{"category": "ham", "to_address": "langa3@flax9.uwaterloo.ca", "from_address": "\"Windows Secrets\" <Editor@WindowsSecrets.com>", "subject": "Epson's claims of cheaper ink are empty [Newsletter Comp Version]", "body": "\n\nEpson's claims of cheaper ink are empty\n\n\n\n\n\n\nIf your software garbles this newsletter, read \nthis issue \nat WindowsSecrets.com.\n\n\n\n   \n\n\n\n\n\n\n \n\n\n\n\nYOUR NEWSLETTER PREFERENCES\n Change\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nLocale: United States 90210\nReader number: 83107-13329\n\n\n   \n\n\n\n\n\n   \n\n\n\n\n Home \n Newsletter \n WinFind \n Reviews \n Polls \n Contact \n \n\n\n\n\n This issue \n Past issues \n Upgrade \n Prefs \n Unsubscribe \n \n\n\n\n\n   \n\n\n\n\n\n   \n\n\nWindows Secrets Newsletter • \nIssue 114 • \n2007-07-05 • \nCirculation: over 270,000\n\n   \n\n\n\n\n\n\n   \n\n\n\n \nContents\n\n\nINTRODUCTION: SkipRearm doesn't work, activation still broken\nTOP STORY: Epson's claims of cheaper ink are empty\nKNOWN ISSUES: Microsoft owns up to Vista Ultimate letdown\nWACKY WEB WEEK: Windows Live finds more than you think\nINSIDER TRICKS: You have ways to ferret out running services\nWOODY'S WINDOWS: SyncToy — free file sync for XP and Vista\nPERIMETER SCAN: Experts debate claims of \"undetectable malware\"\nYOUR SUBSCRIPTION: How to change your address or unsubscribe\n\n   \n\n\n\n\n\n\n\n   \n\n\nFor links to every topic in this issue, scroll down to the \nIndex\n\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nRemotely monitor your PC from anywhere\nSnoopStick is a USB device that allows you to securely monitor activity on your PC from any Windows-based computer, anywhere. Monitor IM, browser activity, e-mail, and control access to Internet services. Great for parents and employers.\nwww.snoopstick.com\n\n\n\n\n\n\n\n\n\n \n\nForget Vista, make your XP system faster\nPC Pitstop's Optimize Scan 1.5 is easy-to-use software  that will automatically diagnose problems with your PC and give you a custom report detailing issues that are hurting your PC's performance. Run this free scan now!\nwww.pcpitstop.com\n\n\n\n\n\n\n\n\n\n \n\nDeep Six anti-spam appliance for SMBs\nPatented technology stops spam at the network edge. Designed for SMBs: the DS200 is the lowest cost, most accurate solution available. Easy to install and maintain. Recent firmware release features new Management GUI and enhanced tools. Try it risk-free.\nwww.tyrnstone.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nINTRODUCTION\n\n\nSkipRearm doesn't work, activation still broken\n\n\n\n\n\n\n\n\n\n\nBy\nBrian Livingston\n\nIn a \nMar. 15 \narticle, I reported that a Registry key called SkipRearm seemed \nto allow Windows Vista's activation deadline to be pushed \nback many times.\n\nIt now appears that this effect isn't caused by SkipRearm but \nby a different mechanism — and therein lies a story.\n\n\n\n\n\n\n\nVista activation deadline affected by system clock\n\n\nSince my original article appeared, some readers and blogs reported \nthat they could duplicate the results of changing the SkipRearm value \nin the Registry. Others found no effect on Vista's activation deadline.\n\nMy continued tests have convinced me that SkipRearm cannot be used to \nextend Vista's deadline. Instead, the results indicate that Vista \nhas something I call \"defensive mode.\" In this mode, Vista changes its \nactivation deadline if a PC's system clock is changed.\n\nTry the following steps on a fresh copy of Windows Vista:\nStep 1. Install Vista on a clean hard drive.\nStep 2. When prompted for the correct time by Vista, set the \nclock back at least a few minutes from the original time held by the \nsystem clock. Or set the clock back at any point after you've \ninstalled Vista.\nStep 3. Open a command window with admin privileges. To do this \nin Vista, click the Start button, enter cmd in the Search box, \nand press Ctrl+Shift+Enter. If you're asked for a username and password, \nenter the ones that log you into your domain. At the command prompt, type  \nslmgr -dli and press Enter. This command, which can require as \nlong as one minute to process, displays Vista's license information. \nNote the number of minutes remaining before Vista's activation deadline. \nIt's a maximum of 43,200 minutes (30 days) on a new installation. \nType exit and press Enter to close the command window.\nStep 4. Reboot the PC, then repeat step 3 to determine the new \nnumber of minutes remaining.\n\nOn the PC's we've tested, Vista's activation deadline has been \npushed back a seemingly random amount of time by this procedure. We've seen \nchanges of as much as 303 minutes (more than 5 hours). The process has \nnothing to do with the SkipRearm key in the Registry and doesn't allow \nSkipRearm to push the deadline back indefinitely. This means dishonest PC \nsellers can't use SkipRearm to create PCs that look activated but aren't, \nas I had feared.\n\nIn our extensive tests of Vista, which I worked on with WindowsSecrets.com \nprogram director Brent Scheffler and associate editor Scott Dunn, we \nbelieved that the rollback of the activation deadline we saw was being caused \nby SkipRearm. We repeatedly wiped different PCs clean, installed Vista \n(and reset the clock each time), tweaked the SkipRearm key, and then rebooted. \nIn most cases, after the Registry change and the reboot, the deadline shifted \nall the way back to 43,200 minutes because our latest clean install \nof Vista was only a few minutes old. We now believe that Vista's \n\"defensive mode\" changes the deadline, not SkipRearm's value in the \nRegistry.\n\nVista seems to have built-in defenses against a user setting a PC's \nclock, say, 10 years into the future, installing Vista, and then changing the \nclock back to the present to get more than the official 30-day activation \nperiod. When Vista notices that the clock has changed, it saves information \nabout the original time and the new time upon shutdown. Vista then rewrites \nthe activation deadline to preserve what's left of the 30-day grace \nperiod.\n\nSince Vista cannot know how long a PC will be shut down before it's \nbooted up again, the operating system appears to be programmed to \nadd a random amount of time to the deadline. The additional minutes \nare apparently intended to make sure the user gets the full 30-day \ngrace period, without the reboot time counting against it. That's very \nconsiderate of the developers who coded this feature into Vista.\n\n\n\nNever mind, Vista activation cracks are everywhere\n\n\nAt the time of my original findings, I considered the SkipRearm side-effect \nto be a glitch, a temporary programming error that would eventually be \nreduced to a footnote by some Microsoft corrective patch.\n\nAs it turns out, the SkipRearm value in the Registry truly is benign, but not \nbecause of anything Microsoft has done. Instead, hackers have found that \nVista's activation mechanism is full of holes. A query in any search \nengine on vista activation crack reveals numerous successful breaches \nof Microsoft's defenses. These range from downloadable executables that \neffectively stop Vista's countdown timer to brute-force algorithms \nthat rapidly enter 25-digit license keys at random until a legitimate \none is found. (I'm not linking to these techniques because I don't \nrecommend that anyone use them. But it's indisputable that they're \nout there.)\n\nOnce again, Microsoft has launched a copy-protection system that \nis a breeze for hackers to break, while causing headaches for honest, \npaid-up buyers. To deploy Vista, large companies are exhorted to administer \ncumbersome license systems, such as Microsoft's Key Management \nService (KMS) server. Meanwhile, hackers publish \nspoofed software that easily emulates such servers, as reported \nby Gregg Keizer in an \nInformationWeek article.\n\nWe can't do much about Microsoft's executive decisions now. \nBut we can continue to educate ourselves about \nMicrosoft Windows and its foibles.\n\nFortunately, all of the other tricks we've recently printed about \nWindows Vista still work just fine:\n\n• Vista Upgrade accepts itself as a qualifying version. \nDevelopers within Microsoft decided that the cheaper, \n\"upgrade\" version of Vista would install over itself, eliminating \nthe need for users to buy the more expensive, \"full\" version. \nI reported this in a \nFeb. 1 \nstory.\n\n• Use Vista without activation for 120 days. \nFar from being limited to a 30-day grace period, the Vista team \nbuilt into the new operating system a simple command that anyone \ncan use to push the deadline back to 120 days. I published the \ntechnique in a \nFeb. 15 \narticle.\n\nI'll keep digging up the secrets of Windows for you and publishing \nthem here, with your help and the assistance of my talented co-workers. \nI won't always get the story right the first time out, but I \npromise you that I'll always keep trying.\n\nBrian Livingston is editorial director of WindowsSecrets.com and the \nco-author of \nWindows Vista  Secrets \nand 10 other books.\n\n\nContents\n Index\n\n\n   \n\n\n\n\n   \n\n\nADS\n\n\n\n\n\n\n \n\nNew add-on for parental control software\nNew software is a great addition to any parental control suite. BuyBlock prevents kids from shopping, filling out registration forms, and signing onto social networks. No setup or monitoring required. Get your risk-free trial here!\nwww.buyblock.com\n\n\n\n\n\n\n\n\n\n \n\nBackup your data with ZipBackup\nFinally, a backup program that is easy to use.  ZipBackup's Wizard makes backups a snap for beginners. Filtering,  scheduling, and disk spanning make it a powerful tool for experts. For a limited time, Windows Secrets readers receive 25% off.\nwww.zipbackup.com\n\n\n\n\n\n\n\n\n\n \n\nGet your product seen by 270,000 readers\nDoes your company offer a product or service? Now you can place an ad in the Windows Secrets Newsletter and be seen by more than 270,000 active buyers of PC hardware and software. Bid as much or as little as you like to get the ideal ad placement.\nwww.WindowsSecrets.com\n\n\n\n\n\nSee your ad here\n\n   \n\n\n\n\n   \n\n\n\n\nTOP STORY\n\n\nEpson's claims of cheaper ink are empty\n\n\n\n\n\n\n\n\n\n\nBy\nScott Dunn\n\nUsers of multi-color inkjet printer cartridges end up \nthrowing away half of their ink, according to a study commissioned \nby Epson.\n\nBut a Kodak-sponsored study focuses on the bottom line, saying \nyou'll pay more per page with printers that require a different \ncartridge for each color, such as Epson's.\n\n\n\n\n\n\n\nEpson-commissioned study dwells on ink efficiency\n\n\nIn a press release dated June 2007, Epson announced results of a study it  \ncommissioned from TÜV Rheinland, an independent certification body. \nEpson trumpeted the study, saying single-ink cartridges were more \nefficient than those holding multiple colors of inks. \"On average the \nmulti-ink systems used less than 60% of the ink before the cartridge \nhad to be replaced, this compares to an average of 82% for the \nindividual ink systems tested,\" according to the press release.\n\nThe study printed photos that were selected by focus groups, as well as \nthe kind of business document typically output by home offices. Epson's press \nrelease acknowledged that the documents, such as a presentation using a \ncorporate template, tended to exhaust one color more than others. Running \nout of one color makes a multi-color cartridge unusable, even though the other \ncolors in the cartridge may still have plenty of ink.\n\nThe TÜV study included printers from Hewlett-Packard, Canon, Brother, \nLexmark, Epson, and Kodak. A summary of the report states that Kodak's \nEasyShare model, which uses a multi-color cartridge, consumed less than 40% \nof each cartridge's ink before becoming unusable. Models by Epson and HP, \nwhich have separate cartridges for each color, by contrast, had \"ink \nefficiency\" levels near 80%. Ink capacity was determined by comparing \nthe weight of cartridges when they were full versus when a printer \ndeclared them exhausted.\n\n\"Now, as well as being cost competitive in the market, Epson's individual \nink cartridge system offers customers higher levels of consistency and \nefficiency,\" states Rob Clark, Director of Consumer Inkjet Business for \nEpson Europe in the press release.\n\nOddly, despite repeated requests, I was unable to obtain from Epson a copy of \nthe study. Finally, a summary of the study was posted on July 2 at the \nTÜV Web site on a \nEfficient Printers and Printing Consumables \npage. (The 1.87MB PDF summary is available from a link on that page under \nthe heading Further Topics.)\n\nMy own research indicates that \"ink efficiency\" isn't everything. If you \nwant the lowest cost per page, a single cartridge that delivers \nmultiple colors may be the winner.\n\n\n\nKodak-sponsored study touts cost per page\n\n\nJust a month before Epson's announcement, Kodak issued its own \npress release. This statement drew attention to a study the company had commissioned from third-party testing lab QualityLogic.\n\nUnlike the TÜV Rheinland study, the \nQualityLogic study \nreported the number of pages (the \"yield\") ink cartridges could produce when printing industry-standard 8.5\" x 11\" monochrome and color test documents and 4\" x 6\" color photos. A \nPDF \nof the complete study is available on the QualityLogic Web site.\n\nThe QualityLogic study does not include price information. However, Kodak \nran the numbers itself, dividing the cost of the various printers' \ncartridges into the number of pages that were produced. Kodak's conclusions \nare the opposite of Epson's. The results show that the Kodak Easyshare \nink cartridges delivered the lowest cost per page or photo, while Epson \nand Lexmark cartridges resulted in much higher costs.\n\nHere at WindowsSecrets.com, I analyzed the QualityLogic data for our \nreaders. I first searched the Web for real-world prices of ink cartridges. \nI then used my own approach to calculate the cost per page from \nQualityLogic's yield figures. I found that my cost results were nearly \nidentical to the figures claimed by Kodak. (only in a few cases did the \nfigures diverge by more than one cent per page).\n\nThe table below shows Kodak's cost-per-page calculations, which I \ndouble-checked. Based on QualityLogic's yield figures, and the \nstreet price of each printer's cartridges, Kodak's multi-color modules \ndo seem to offer significantly lower cost per page for each \ndocument type:\nCOST PER PAGE OR PHOTO (in U.S. cents, sorted by color photo cost)\n\n\n\n\n\nPrinter\n\nMono Page\n\nColor Page\n\nColor Photo\n\n\n\nKodak EASYSHARE 5300\n\n2.3\n\n6.9\n\n9.6\n\n\nCanon PIXMA MP810\n\n3.9\n\n9.2\n\n15.2\n\n\nCanon PIXMA MP510\n\n3.7\n\n9.1\n\n15.5\n\n\nCanon PIXMA MP600\n3.7\n\n9.0\n\n16.0\n\n\nCanon PIXMA MP160\n6.6\n\n13.7\n\n23.8\n\n\nBrother MFC-5460CN\n\n4.0\n\n9.0\n\n24.1\n\n\nLexmark X3470\n8.7\n\n17.2\n26.0\n\n\nHP Photosmart C5180\n\n5.9\n\n10.3\n\n28.9\n\n\nLexmark X8350\n8.0\n15.2\n32.9\n\n\nHP Photosmart C3180\n\n7.9\n\n16.9\n\n33.7\n\n\nHP Photosmart C4180\n5.2\n14.7\n34.1\n\n\nEpson Stylus CX6000\n12.8\n\n16.6\n\n38.7\n\n\nEpson Stylus Photo RX580\n\n7.4\n\n18.4\n\n50.1\n\n\n\n\nIn my research, the prices of all ink cartridges (except Lexmark) were \nobtained online from  \nOffice Depot. \nTaxes and shipping charges were ignored, as though all cartridges were \npicked up in-store. Lexmark cartridges weren't available at Office Depot, \nand were priced instead at the Staples Web site. I computed the \ntheoretical number of cartridges required to print 10,000 pages or \nphotos, based on QualityLogic's yield numbers, then calculated the \nresulting cost per page to substantiate Kodak's figures.\n\nHP has officially taken issue with the details of the Kodak/QualityLogic \nstudy. San Jose Mercury News writer Dean Takahashi has published HP's \ncritique as well as Kodak's rebuttal in his \ntech blog.\n\n\n\nEpson's research study: damage control?\n\n\nThere are factors other than cost per page, of course, that should be used when evaluating printers. Print quality, paper handling, and product reliability are at least as important as the cost of consumables. But the recent flare-up over cost per page indicates how seriously printer manufacturers take pricing claims.\n\nEpson's press release comes just a year after the company put to bed a class-action lawsuit, which is described in a \nFAQ \nby the case's claims administrator. Plaintiffs in the suit complained that the printer cartridges reported being out of ink, failing to print, even though a substantial amount of ink remained. Epson denied any wrongdoing and chose to settle the case out of court.\n\nThe company may be eager to draw attention away from the Kodak-contracted study and convince customers that the cost of its consumables is a good deal. Although the Epson press release specifically calls attention to the \"ecological advantages\" of single-ink cartridges, the clear message is that Epson's single-ink system will save consumers ink and, as a result, money. \n\nBut Epson's TÜV study didn't look at cost. The Kodak/QualityLogic data indicates that packing multiple colors into a single cartridge can result in a lower cost per printed page than single-color cartridges. Until other studies validate or dispute these findings, Epson's claims must be viewed with skepticism.\n\n\n\n\n\t\t\t\tReader, please rate the above article:\n1: Poor \n\t\t\t\t2: Fair \n\t\t\t\t3: Good \n\t\t\t\t4: Great  5: Superb\n\n\n\nScott Dunn is associate editor of the Windows Secrets Newsletter. He is \nalso a contributing editor of PC World Magazine, where he has written a \nmonthly column since 1992, and co-author of \n 101 Windows Tips & Tricks (Peachpit) with Jesse Berst and Charles Bermant.\n\n\nContents\n Index\n\n\n   \n\n\n\n\n   \n\n\n\n\nKNOWN ISSUES\n\n\nMicrosoft owns up to Vista Ultimate letdown\n\n\n\nBy\nScott Dunn\n\nAs reported last week, Microsoft's Vista Ultimate team has been missing \nin action when it comes to supplying the \"Ultimate Extras\" that \nwere promised back in January for the new OS.\n\nBut, since our \nJune 28 \nstory appeared, the team has finally broken its silence, \nmaking its first statement since Mar. 13.\n\n\n\n\nUltimate team apologizes, breaking long silence\n\n\nMy article on the unkept promise of Vista Ultimate Extras was followed up \nby interviews in \nComputerWorld \nand elsewhere. Soon thereafter, the Vista Ultimate team finally commented \non its  failure to deliver any of the promised Extras. The statement by \nBarry Goffe, director of Vista Ultimate, on the Windows Ultimate Web site \nsays:\n\n\n\"We want to let our Windows Vista Ultimate customers know that we are \nactively working to deliver the remaining Extras that we identified \nin January.  Our goal is to provide the highest-quality, most secure \nand reliable offerings, and as a result we are continuing our work \non these offerings.  We apologize for taking so long to provide a \nstatus update to customers.\n\n\"We intend to ship Windows DreamScene and the remaining 20 Language \nPacks by the end of the summer. We will not ship the last two Extras \nshowcased in January (Windows DreamScene and the remaining 20 Language \nPacks) until they meet the high quality bar required by our enthusiastic \ncustomers — and we believe that we can achieve that bar by the end \nof this summer.\n\n\"We also intend to deliver additional Extras in the future. In addition \nto Windows DreamScene and the remaining Language Packs, we plan to ship \na collection of additional Windows Ultimate Extras over the next couple \nyears that we are confident will delight our passionate Windows Vista \nUltimate customers. We cannot identify dates or provide details at this \ntime — but once we ship Windows DreamScene and the remaining \nLanguage Packs, we will provide more information about the next \nExtras.\"\n\nUnfortunately, the statement — the first comment of any kind to \nappear on the team's \nhome page \nin nearly four months — includes \nno actual specifics of Extras to come and no schedule of dates the \nteam can be held to.\n\n\n\nMicrosoft rescinds WGA requirement for critical patch\n\n\nA number of readers attempted to fix the Svchost.exe problem \ndescribed in our \nJune 21 \nissue by downloading the \nupdate \ndescribed in Microsoft Knowledge Base article \n927891. \nMany of them, including Holly Vincent, discovered that Microsoft was \nrequiring them to first install and run the Windows Genuine Advantage (WGA) utility. An earlier version of this intrusive and error-prone tool \nwas denounced by editorial director Brian Livingston as spyware \none year ago. Holly writes:\n\n\n\"It's rather sneaky on Microsoft's part. If one runs the Microsoft Update that is recommended, isn't Windows Genuine Advantage slipped in as well?  I've never been a fan of WGA, as it presumes my OS's guilt and asks me to prove its innocence.\"\n\nAfter receiving similar complaints, I contacted contributing editor Susan \nBradley, who passed the complaint on to her contacts inside Microsoft. \n\"WGA is normally kept off anything security related,\" Susan told me. \"It \nwasn't on that patch before. This was a screw-up on the part \nof Microsoft.\"\n\nThe Svchost.exe patch can now be downloaded and installed without \nhaving to install WGA. Thanks to all the readers whose complaints made \nMicrosoft correct the situation.\n\n\n\nHow to check Windows Update's version number\n\n\nI gave instructions in the \nJune 28 \nissue on checking Windows Update's version number. A few readers wanted \nto know if they needed to check the version number of other files with \nsimilar names. The answer is no — you only need to check the version \nof Wuaueng.dll (not Wuaueng1.dll or any other file).\n\nReader Peter Vanica had a related problem:\n\n\n\"I have 5 copies of Wuaueng.dll on my system in the \nfollowing locations:\n\nC:\\I386\nC:\\windows\\$NtServicePackUninstall$\nC:\\windows\\system32\nC:\\windows\\servicepackfiles\\i386\nC:\\windows\\system32\\DLLCACHE\n\n\"Help!\"\n\nPeter's search not only turned up the file that Windows actively \nuses — the one in the \\Windows\\System32 folder — but \nalso various kinds of backups and copies that Windows keeps for \nits own purposes. If you revert your system to an earlier state \n— using, for example, System Restore — you would \nneed to apply the patch for Windows Update again.\n\n\nContents\n Index\n\n\n   \n\n\n\n\n   \n\n\n\nTELL A FRIEND\n\nHow you can share this information\nWe love it when you send your friends links to our articles. But please don't \nforward your copy of our e-mail newsletter to people, which subjects us to spam \ncomplaints. Instead, simply suggest that your friends visit this issue's permanent \nWeb address, shown below. A complete index at the bottom of the \nWeb page provides you with hyperlinks to any article you'd like to recommend.\n\nThe address of this issue is http://WindowsSecrets.com/comp/070705\n\n   \n\n\n\n\n   \n\n\n\n\n\nEDITOR'S BOOKSHELF\n\n\n\n \n\n\n\nGet the tips you need about Windows Vista\n\n\n\nThe all-new Windows Vista Secrets helps novices \nand experts alike understand Microsoft's latest operating system. \n\"To really appreciate what is in Vista, you almost \nneed to read through the leading book on the product, Windows Vista \nSecrets, by Brian Livingston and Paul Thurrott,\" writes Rob Enderle, \nprincipal analyst of the Enderle Group, in TechNewsWorld. \"It's 595 \npages of things you can do with this product — most of which \nyou probably wouldn't have discovered for some time, let alone right \nat first.\" Check the book out now for tips you can use.\nMore information:\n United States / \n Canada / \n Elsewhere\n\n \n\n\n\nSpam-Proof Your E-Mail Address, 2nd Ed.\n\n\n\nThis 32-page e-book by Brian Livingston gives you step-by-step instructions that \ncan prevent 97% of the spam that would otherwise clog an e-mail\naccount. You could call it \"Livingston's Spam Secrets.\" The PDF e-book\nis the result of months of experiments and tests we conducted. We now\nreceive little or no spam to the addresses we used as guinea pigs. These tests\nshow that you can make your e-mail addresses invisible to spammers,\nnot just battle an ever-growing flood. The methods we describe\nwork with Windows, Apple, and Linux and don't require any filters or block\nlists — but you can use those in addition to the book's techniques,\nif you wish. \n\nMore info\n\n   \n\n\n\n\n\n   \n\n\n\nContents  \nIndex\n\n   \n\n\n\n\n   \n\n\n\nWACKY WEB WEEK\n\nWindows Live finds more than you think\n\n\n\n\n\n\n\n\n\n\nOur Wacky Web Week column \nlast week \nfeatured a spoof of a video ad for one of Microsoft's newest product \nideas. But not every commercial needs a send-up to be funny.\n\nAs this promo for Windows Live reveals, some folks working for Microsoft \nhave a pretty good sense of humor. Not to mention an inflated view of \nthe search capabilities of Windows Live.\n\n\nWatch the video.\n\n\n\n\n\nContents \nIndex\n\n\n   \n\n\n\n\n\n   \n\n\n\n\nINDEX\n\n\n\nThe following topics appear in the free version\n\n\n\n\n\nINTRODUCTION  \nSkipRearm doesn't work, activation still broken\n\n \nVista activation deadline affected by system clock\n\n \nNever mind, Vista activation cracks are everywhere\n\n \n \n\n\nTOP STORY  \nEpson's claims of cheaper ink are empty\n\n \nEpson-commissioned study dwells on ink efficiency\n\n \nKodak-sponsored study touts cost per page\n\n \nEpson's research study: damage control?\n\n \n \n\n\nKNOWN ISSUES  \nMicrosoft owns up to Vista Ultimate letdown\n\n \nUltimate team apologizes, breaking long silence\n\n \nMicrosoft rescinds WGA requirement for critical patch\n\n \nHow to check Windows Update's version number\n\n \n \n\n\nWACKY WEB WEEK  \nWindows Live finds more than you think\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou get all of the following in the paid version\n\n\nINSIDER TRICKS  \nYou have ways to ferret out running services\n\n \nHow to identify services Svchost.exe controls\n\n \nManaging running services within Vista\n\n \nProcess Explorer lets you under the hood\n\n \nWhat's Running gives a more friendly view\n\n \nQuick, temporary fix for Svchost.exe problem\n\n \nWindows Firewall can improve your Wi-Fi security\n\n \nMS07-022 re-released for NEC 98 PCs\n\n \n \n\n\nWOODY'S WINDOWS  \nSyncToy — free file sync for XP and Vista\n\n \nWhy use a PowerToy like SyncToy?\n\n \nHow much sync can a SyncToy sync?\n\n \nHow to get SyncToy working for you\n\n \nHow to schedule repetitive syncs\n\n \nIs SyncToy the right tool for you?\n\n \n \n\n\nPERIMETER SCAN  \nExperts debate claims of \"undetectable malware\"\n\n \nCan malware become totally invisible?\n\n \nSure we can detect it, they say\n\n \nYou can't trust CPUs to be exploit-free\n\n \n \n\n\n\nPaid subscribers can access all old and new paid newsletter content\nMake a contribution to support our research into Windows and you'll immediately\nbe able to read and search through scores of valuable articles. In addition,\npaid subscribers are entitled to download valuable content that we license for\nyou at least once every calendar quarter.\nTo upgrade, simply make a contribution of any amount you choose.\nIf you do this by July 11, 2007, \nyou'll instantly be sent the full, paid version of today's newsletter.\n\nTo upgrade to the paid version of the Windows Secrets Newsletter, please visit our \n upgrade page.\n\nThanks in advance.\n\n\n   \n\n\n\n\n\n   \n\n\n\nContents\n Index\n\n\n   \n\n\n\n\n\n   \n\n\n\nYOUR SUBSCRIPTION\n\nThe Windows Secrets Newsletter is published weekly on \nthe 1st through 4th Thursdays of each month, plus occasional news updates. \nWe skip an issue on any 5th Thursday that occurs, plus Thanksgiving \nWeek and the last two weeks of August and December.\nPublisher: WindowsSecrets.com LLC, Attn.: #120 Editor, 1700 7th Ave., \nSuite 116, Seattle, WA 98101-1323 USA. Vendors, please send no unsolicited \npackages to this address (readers' letters are fine).\nEditorial Director: Brian Livingston. Editor-at-Large: Fred Langa. \nAssociate Editor: Scott Dunn. Contributing Editors: Susan Bradley, Mark Edwards, \nWoody Leonhard, Chris Mosby, Ryan Russell. Research Director: Vickie Stevens. \nProgram Director: Brent Scheffler.\nTrademarks: Microsoft and Windows are registered trademarks of Microsoft \nCorporation. The Windows Secrets series of books is published by\n Wiley Publishing Inc. The Windows Secrets Newsletter,  \nWindowsSecrets.com, LangaList, LangaList Plus, WinFind, Security Baseline, \nPatch Watch, Perimeter Scan, Wacky Web Week, the Logo Design (W, S or road, \nand Star), and the slogan Everything Microsoft Forgot to Mention all are \ntrademarks and service marks of WindowsSecrets.com LLC. All other marks \nare the trademarks or service marks of their respective owners.\n\n\nYOUR SUBSCRIPTION PREFERENCES\n(change \nyour preferences):\nDelivery address: langa3@speedy.uwaterloo.ca\nAlternate address: langa3a@speedy.uwaterloo.ca\nCountry: United States\nZIP or postal code: 90210\nReader number: 83107-13329\nBounce count: 0\n\nYour bounce count is the number of times your server has bounced a \nnewsletter back to us since the last time you visited your preferences page. \nWe cannot send newsletters to you after your bounce count reaches 3, due to ISP \npolicies. If your bounce count is higher than 0 or blank, please visit your\n preferences page. This automatically resets your bounce count to 0.\nTo change your preferences: Please visit your \n preferences page.\nTo access all past issues: Please visit our\n past issues page.\nTo upgrade your free subscription to paid: Please visit our \n upgrade page.\nTo resend a missed newsletter to yourself: \nIf your mail server filtered out a newsletter, you can \nresend the current issue to yourself. To do so, visit your\n preferences page and use the Resend link.\nTo get subscription help by e-mail (fastest method): Visit our \n contact page. Subscription help by facsimile:\n206-282-6312 (fax). Emergency subscription help by phone: \n206-282-2536 (24 hours).\n\nHOW TO SUBSCRIBE: Anyone may subscribe to this newsletter by visiting our \n free signup page.\nWE GUARANTEE YOUR PRIVACY:\n\n1. We will never sell, rent, or give away your address to any outside \nparty, ever.\n2. We will never send you any unrequested e-mail, besides \nnewsletter updates.\n3. All unsubscribe requests are honored immediately, period.  \n Privacy policy\nHOW TO UNSUBSCRIBE: To unsubscribe\nlanga3@speedy.uwaterloo.ca\nfrom the Windows Secrets Newsletter,\n\nUse\nthis 2-click\n Unsubscribe link; or\nSend\na blank e-mail to\nunsub@WindowsSecrets.net with leave langa3@speedy.uwaterloo.ca\nas the Subject line; or\nVisit our \nUnsubscribe page.\n\n\nCopyright © 2007 by WindowsSecrets.com LLC. All rights reserved.\n\n\nContents\n Index\n\n\n\n\n\n\n   \n\n\n\n\n\n"}