{"category": "ham", "to_address": "debian-legal@lists.debian.org, debian-devel@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Wouter Verhelst writes:\n\n> On Sun, Jun 03, 2007 at 11:28:22AM -0400, Michael Poole wrote:\n>> Anthony Towns writes:\n>> \n>> > I don't think that's meaningful; if I sue you in a court in Australia\n>> > for not complying with debootstrap's license, and they find that you've\n>> > infringed the license, it doesn't really matter if I'm doing that out\n>> > of maliciousness or a genuine. And as far as the actual effects go,\n>> > I'm not sure you're going to be any better off without that clause in\n>> > your license: if you set foot in Australia, with an Australian judgement\n>> > against you, there's a good chance of it being enforced; and if you don't,\n>> > there seems to be a practical possibility of your extradition anyway,\n>> > based on [0].\n>> \n>> Extradition is for criminal cases, not civil cases.  I cannot imagine\n>> how a choice of venue clause would significantly either help or hurt a\n>> criminal defendant.\n>\n> That makes it even better.\n>\n> If you get sued and convicted as a private person in a jurisdiction that\n> is not yours, there are two possible outcomes:\n> * You try to defend yourself, and might win or lose depending on the\n>   case. If you go to the jurisdiction where you are being sued, the end\n>   result might be that enforcement is likely.\n> * You do nothing, and nothing happens\n\nCivil cases do not have \"convictions\" (or \"guilt\"), just as they do\nnot have \"extradition\".  Civil cases have judgments and liability.\n(I assume this is a case of linguistic differences rather than legal\nignorance.)\n\nI cannot speak to other systems, but your first case is wrong: Simply\nappearing in one US court to defend oneself against claims would not\npass the \"minimum contacts\" test that is used to determine whether\npersonal jurisdiction exists.\n\nYou also oversimplified the second case to ignore the situation where\na judgment in one jurisdiction is enforced in the defendant's own\njurisdiction.  This applies in particular to US courts due to regional\ndivisions (namely, Federal circuits and state lines).\n\nFinally, you have omitted a third case: the defendant moves (probably\nsuccessfully) to have the suit dismissed for improper venue.  This has\nnotable benefits for the defendant, including the chance to have\nreasonable costs awarded -- and that chance goes up, with respect to\nthe first action, if it is re-filed elsewhere later.\n\n> You see, if a judge in the U.S. decides that I am guilty as charged\n> based upon evidence brought before him, I couldn't care less. Belgium\n> does not extradite its own citizens unless those have been convicted by\n> Belgian judges and found guilty; so as long as I do not do anything\n> which might be illegal by Belgian law, there's nothing to stop me from\n> not following the license. Sure, that probably means I should be wary of\n> going to the U.S. while convicted there, but perhaps I can live with\n> that. And indeed, since extradition isn't for civil cases, they wouldn't\n> even ask for extradition in the first place.\n>\n> On top of that, the licensor couldn't even sue me in Belgium, since then\n> *I* could invoke the choice-of-venue clause to prevent that.\n>\n> Hadn't thought of that before, but I'm starting to like these clauses.\n\nGood for you.  I would not ask you to avoid these clauses for\nyourself.  However, they are considerably less appealing to those who\ndo not have the same legal system or tolerance of avoiding arbitrary\ncountries.  As I understand them, DFSG conformance and freedoms are\nnot a function of particular people's convenience.\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}