{"category": "ham", "to_address": "\"General Copyright Discussions \\(questions, organizing,\n\tetc\\)\" <discuss@list.digital-copyright.ca>", "from_address": "Russell McOrmond <russell@flora.ca>", "subject": "Re: [d@DCC] Bill C-59 currently being \"debated\"", "body": "\nDarwin O'Connor wrote:\n> I watched some of it. They talked a lot about how it helps the film \n> production industry, even though it has no effect on Hollywood films \n> produced in Canada. It would have a small effect on Canadian films, but \n> I wouldn't be surprised if the filmmakers are happy to have anyone watch \n> their films, even if they are illegally copied.\n\n   I sent my own MP (and my MP from before I moved a few years ago, who \nI will be meeting with in person next week) a letter.  I sent a similar \nletter (almost identical wording, but as separate letters) to each of \nthe 10 MPs that spoke during that \"debate\".\n\n\n   I recommend that everyone else also write their members of parliament \n(and the 10 who participated in the debate) as well.  This \"debate\" may \nbe the shape of things to come, with the possibility that the discussion \nof anti-circumvention legislation (the complete abogation of protecting \nthe rights of software authors and hardware owners in order to \ntheoretically protect the outdated business models of a tiny subset of \nthe content industry) being as poor.\n\nMy summary of the debate -- the end contains links to the ridings of the \n10 MPs who spoke, and thus links to contact information.\nhttp://www.digital-copyright.ca/node/4011\n\nMy letter to MPs\nhttp://www.digital-copyright.ca/node/4010#comment-2436\n\n\nDarryl Moore,\n\n   I'm curious if you would be willing to author a short sample letter \nthat people can send to introduce MPs to the DVD that you sent.  I'm \nthinking of something similar to what I wrote for the GOSLING package.\n\nhttp://www.digital-copyright.ca/edid/letter3\n\nHere are all the other sample letters we've created thus far:\nhttp://www.digital-copyright.ca/letters\n\n-- \n  Russell McOrmond, Internet Consultant: \n  Please help us tell the Canadian Parliament to protect our property\n  rights as owners of Information Technology. Sign the petition!\n  http://www.digital-copyright.ca/petition/ict/\n\n  \"The government, lobbied by legacy copyright holders and hardware\n   manufacturers, can pry my camcorder, computer, home theatre, or\n   portable media player from my cold dead hands!\"\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}