{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Morning HTML\" <cbsnews_weekday_morning_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nJune 29, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESCops Defuse Central London Car Bomb\nLondon police have defused a \"potentially viable explosive device\" in a car in the central theater district. Officials say\n                        propane canisters and nuts and bolts were found in car, and the device would have caused significant damage if it had exploded. More...Watch: Expert On British Bomb Scare\n• Debate Showcases Clinton, Obama Rivalry• 5 U.S. Soldiers Killed In Iraq Attack\n                     \t\t\t\t\t| Watch• Eerie Twist In Wrestler's Murder-Suicide\n                     \t\t\t\t\t| WatchU.S.No Relief For Rain-Weary Texas\nFlood-weary residents hoping for a reprieve from the sustained, heavy rains that have soaked parts of Texas may have to wait,\n                        as forecasts called for more of the same. Eleven deaths have been blamed on the storms in north and central Texas. More...Watch: Flash Floods Strike Texas\n• Eerie Twist In Wrestler's Murder-Suicide\n                     \t\t\t\t\t| Watch• Mentally Ill Killer's Execution Blocked• Town Mourns Cheerleaders Killed In Crash• More StoriesWorld5 U.S. Soldiers Killed In Iraq Attack\nFive American soldiers were killed and seven wounded in a coordinated attack in southern Baghdad involving a roadside bomb\n                        and rocket-propelled grenades, the U.S. military announced. The soldiers were on a combat patrol in at the time of the attack. More...Watch: Informants Help Troops In Iraq\n• Castro: God Protected Me From Bush• Cops Defuse Central London Car Bomb\n                     \t\t\t\t\t| Watch• Ireland Elects Its First Black Mayor• More StoriesPoliticsDebate Showcases Clinton, Obama Rivalry\nIn a debate held in an atmosphere friendly to Democrats, the spotlight shined on the intense battle between Hillary Clinton,\n                        who wants the support her husband enjoyed among blacks, and Barack Obama, the most viable black candidate in U.S. history. More...\n• Dems Decry Desegregation Ruling In Debate• Bush Rejects Subpoenas From Congress\n                     \t\t\t\t\t| Watch• Castro: God Protected Me From Bush• More StoriesHealthHow To Cut Midlife Heart Disease\nMiddle age isn't too late to cut heart disease if you adopt a healthy lifestyle, say experts. More...\n• U.S. To Stop Some Chinese Seafood Imports\n                     \t\t\t\t\t| Watch• Lupus Drug May Cause Male Infertility• Bush Believes Americans Need More Exercise\n                     \t\t\t\t\t| Watch• More StoriesSciTechAmazing Gene Swap Creates Microbe Makeover\nFor years, scientists have moved single genes and even large chunks of DNA from one species to another. Now scientists have\n                        transplanted an entire genome, all of an organism's genes, from one bacterium into another in one fell swoop. More...\n• House Nixes Auto Industry Mileage Plan• China Is Tops In Greenhouse Gas Emissions\n                     \t\t\t\t\t| Watch• Evidence Of Farming In Ancient S. America• More StoriesBusinessFed Leaves Key Interest Rate Unchanged \nThe Federal Reserve left a key interest rate unchanged, expressing new optimism on economic growth and lower inflation. Analysts\n                        believe that Fed officials could keep rates as is through the rest of this year and well into 2008. More...\n• Honda Tops In Customer Satisfaction Survey• Newspapers Not Quite Dead Yet• How To Avoid Summer Travel Snafus• More StoriesEntertainmentStreisand Awarded Legion Of Honor Medal\n\"You are the America that we love,\" said French President Nicolas Sarkozy, as he presented Barbra Streisand with the Legion\n                        of Honor medal.  \"Women like you ... do a lot to bring our two peoples together.\" More...\n• Spector Prosecutor Grills Defense Expert• Washington: Racism Caused My Firing\n                     \t\t\t\t\t| Watch• Eve Pleads No Contest To DUI Case• More StoriesOpinionRightward Ho!\nLegal analyst Andrew Cohen says that two things are responsible for the Supreme Court's marked turn to the right: math\n                        and art. More...\n• Life Potatoes• Iraq's Key: Strength From Within\n                     \t\t\t\t\t| Watch• Stick With The Surge\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Recipes: Summer Drinks In Big Batches\nBon Appetit magazine's Andrew Knowlton shared easy recipes for making them a pitcher at a time, without sacrificing taste,\n                        on The Early Show. More...\n• EARLY SHOW: Decorating Doors For Summer• CBS Evening News: Do Bush Defeats Signal End Of Influence?\n                     \t\t\t\t\t| Watch• CBS Evening News: Informants Guide U.S. Troops In Baqouba\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nLone Star Storms & FloodingAs more rain fell over Texas, cresting rivers began to overflow. There renewed fears about more floods, evacuations and rescue\n                                    operations. Hari Sreenivasan reports.\nTOP VIDEOS\nFDA Restricts Chinese Seafood\nDancehall In Jerusalem\nMcCartney On Stage In LA\n'Die Hard' At Smithsonian\nOprah Opening Shop\nWinds Fan Tahoe Flames\nNew Desegregation Ruling\nSenate Kills Immigration Bill\nInformants Help Troops In Iraq\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesA Rwandan genocide survivor recalls her tale of survival. This Sunday, 7 p.m. ET/PT.48 Hours MysteryMemory Of Murder:Cops say a mother implicated her son in a brutal murder; she says they are dead wrong. Tuesday,\n                           10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}