{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: Request for suggestions of DFSG-free documentation licences", "body": "Jordi, please follow the code of conduct for the mailing lists\n.\nSpecifically, don't send a separate copy of list messages to me, as I\nhaven't asked for that.\n\n\"Jordi Gutierrez Hermoso\"  writes:\n\n> I keep hearing about how important it is to have everything licensed\n> the same way because you can't move GGPL code into a GFDL manual or\n> move code from the GFDL manual into a GGPL manual (extra G added on\n> GPL just for fun). I don't understand. The GFDL allows free\n> modification of code (since it's a technical section, can't be\n> invariant), so what's the big deal?\n\nThe GPL also requires that any derivative work that one distributes\nmust be licensed under the GPL terms. This is incompatible with taking\npart of a work under a different license and combining it with the GPL\nwork to distribute.\n\nIf all the software in the package was licensed under the GPL, then\nparts of the documentation could be mixed freely with the programs,\nand vice versa, to create a derived work to distribute; the same\nlicense terms apply to all of the software so the GPL terms are met.\n\n> Moreover, the document that describes how to apply GFDL even\n> suggests itself to license code in the manual under the GPL, if this\n> code is substantial (which it rarely is; I can't think of a GNU\n> manual that has any considerable amount of code that can't already\n> be extracted and used under the terms of the GFDL).\n\nThe document author, by placing only *some* parts of the work under\nthe GPL, is essentially determining for the recipient what parts they\nwill find useful to combine with other parts of the software. Prose\ndescriptive parts could be combined into the data, for instance; if\nthe license does not allow this, an essential freedom is denied.\n\nOn the other hand, if the author acknowledges that *any* part of the\nwork could be useful for some recipient to combine with other parts of\nthe work, *even if the author can't conceive of it initially*, then\nthe logical thing to do is to license all parts of the work under the\nsame terms.\n\nFurther, when parts of a work licensed under GPL are combined into the\nFDL-licensed work, the result is *not redistributable at all*, because\nthe GPL says the resulting work must be entirely licensed under GPL,\nwhich conflicts with the FDL work's license terms.\n\n> I have strong disagreements with Debian's treatment of the GFDL (and\n> it makes us Debianistas look like fundamentalist wackos to the rest\n> of the free software world), but perhaps those are concerns for\n> another time. I just don't see why it's such a problem to have\n> \"software\", as Debian calls documentation, with different licenses\n> for intended different usages.\n\nHopefully you now have a better understanding of some of the\nproblems. There are others, that have been covered elsewhere in this\nthread.\n\n-- \n \\       \"If you do not trust the source do not use this program.\"  -- |\n  `\\                                 Microsoft Vista security dialogue |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}