{"category": "spam", "to_address": "memolink@speedy.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for April 23rd - April 29th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n                     First Quarter Moon, April 24,  2:37 AM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    This week I want you to concentrate on the abundance of blessings you have been given.\n    Changes for the better are here for you now, which is why I want you to be sensitive to the positive energy that is surrounding you. Feel the love, happiness, and joy that are reaching out to you.  Take moments during your daily routine to stop and notice what is going on – see and feel the warm beautiful sunshine, or experience the quiet of a gray, rainy day outside your window.  Let the smile of a small child touch your heart.  Mentally send a blessing of love and abundance to everyone you meet during your day.  This is an especially important step to do because whatever energy you give out to the world will be returned to you.\n    As I pointed out to you last week, you must be an active and willing participant in this dance of Life. You must become involved by reaching out so you can reap the abundance the Universe is offering you now.\n    In order to harvest the fruits of your blessings, be ready to move outside your comfort zone. You can't expect to fulfill your dreams by sitting around watching television.  Here is a mantra for you to use that can help you:\n    I am capable of realizing my dreams.\n    And remember to acknowledge your worth and love yourself -- that's where it all begins. Keep working on the three steps we spoke about last week and expect productive outcomes.  With this mindset, you will face your challenges and move forward with your goals and succeed.\n    You are special, and you owe it to the world to be all you can be.\n    As always, I am here for you.  By the way, be sure to read what Bethea says about this week's stars.\n\n                      Until next week,                          \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n\n                 \n\n\n    The First Quarter Moon in Leo on the 24th is accompanied by a super link between Venus and Mars, and you may be surprised and delighted by your closest companion.  On the 27th you might feel a sudden impulse to re-arrange the furniture or re-decorate your home.  Mercury moves into Taurus on this day as well, which further stimulates your creative impulses, Memo.  Over the weekend, Venus, Mars, Jupiter, and Uranus are all combining to make relationships of all kinds volatile and intriguing.  Expect fireworks followed by the fun of kissing and making up.\n\n\n\n\n\nMemo             April 23 - April 29             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Wednesday is going to be your lucky day for this period.  And your Lucky Numbers are 11, 10, 19, 18, 39, 51.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nApril 23rd for Memo\n\n\n\n\n\n\n\n\n\n    I see that you have a chance to be in the spotlight in the near future, possibly related to something musical.  You could try your hand at writing a song or entering a singing competition.\n\n\n\n\n\n\n\n    Have you been looking to add more fun to your life?  I advise you to listen to your dreams over the next few nights.  They may have a few ideas for you, spoken in their own colorful language.\n\n\n\n\n\n\n\n    Is it sometimes hard for you to turn off your thoughts in order to sleep at night? This could be one of those times. Try meditative techniques and use soothing mental images to keep yourself on track.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 24th for Memo\n \n \n \n \n \n\n \n \n    This would be a good time to get together with a few friends for a sporting event like tennis or bowling or even cards.  You can let \"them\" keep score, but double check their addition.\n\n\n  \n \n \n    Don't let your ego get in the way of common sense and courtesy.  You have the power now, use it wisely and with restraint.  Forgive yourself for past mistakes and allow others the same right.\n\n \n \n \n  \n\n\n\n\n\n\n\n\nApril 25th for Memo\n\n \n \n \n \n \n \n    Chatting with friends could interfere with finishing your chores. Work now and play later -- or even better, invite a friend to assist you with the chores while you're chatting.\n\n\n \n\n\n \n \n    Any emotional difficulties you are now experiencing, will have an affect on your ability to communicate with others.  Don't take things so personally.  Give to others what you ask for yourself.\n\n\n \n\n \n \n    You generally have a calm, positive outlook and now approach most of your affairs the same way.  You enjoy life when things go well and people around you get along.  You can take time to relax now.\n\n \n \n \n \n\n\n\n\n    Whether you're at work today or just thinking about how to make your next great impression on the boss, be sure you write down all those great ideas.  They can be worth big bucks.   \n\n \n\n\n\n    It's important to be realistic about changes you need to make.  If things haven't been going your way recently, a few small adjustments may be all that's necessary to get back on top.\n \n\n\n\n\n\n\n\n\nApril 26th for Memo\n  \n \n\n\n\n \n \n    You could find yourself torn between a new friend and your good old gang.  Remember, true-blue friends are treasures, but where do you feel most comfortable spending your time today?\n\n\n \n\n \n \n    Telephone conversations you have with relatives, neighbors, friends or loved ones will revolve around subjects such as money, investments and earning potentials.  Family security issues are favored.\n\n \n\n \n \n\n\n\n\n    A friend could give you some excellent advice about money.  Small investments are favored.  Don't be surprised if this new plan starts workking almost immediately.  Luck is with you.\n  \n\n \n \n\n\n    This is a great time for balancing your checkbook and putting your bank and other statements in order.  Dealings with banks and accountants are also favored now, dear.\n  \n\n\n\n\n\n\n\n\nApril 27th for Memo\n  \n \n \n\n\n \n \n    Sometimes, you may have so many good ideas that you can't keep track of them all.  If a few that have gotten away from you make a second appearance -- I suggest you write them down.\n\n\n \n\n\n \n \n    Communications are more difficult today, especially when involving relatives, neighbors or close associates.  You tend to speak without careful thought.  Try not to get behind in your daily duties.\n\n \n\n\n \n\n\n\n\n\n    Any writing or communicating you do at this time demands the extra personal touch.  Don't be afraid to show your most sincere, sentimental side.    \n\n \n \n\n\n    Pursuing pleasure when you should be taking care of your domestic or work responsibilities could put you at risk.  Avoid being overly critical in your conversations and communications.  Travel is likely.\n  \n\n \n \n\n\n    I feel it’s just one of those days when annoying frustrations get in the way of your best laid plans. Maybe you chose the wrong clothes for the weather or the occasion. Laugh it off.\n \n\n\n\n\n\n\n\nApril 28th for Memo\n  \n \n \n \n\n \n \n    You might consider getting together with associates that you've been neglecting.  You usually aren't so aggressive, but today's stars point towards you making the first move.\n\n\n\n\n\n\n\n\n\n\nApril 29th for Memo\n \n \n \n \n \n\n \n \n    Do you like to write?  Why not take this opportunity to get involved in a book club or writing group?  It will give you a chance to meet creative individuals and help to broaden your perspectives.\n\n\n\n\n\n\n\n\n\n    There are some pretty intense celestial aspects coming up next week.  This could hold lots of potential – and also some pitfalls.  More later.\n\n                       Best Regards, \n                        \n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}