{"category": "spam", "to_address": "robinsjjman@yahoo.com", "from_address": "Robins.Jakeman@server.nairahost.net", "subject": "Attn Sir/Madam,", "body": "Attn Sir/Madam,\n\nI am Robins Jakeman a solicitor and legal practitioner\nbased in United Kingdom. I am the personal attorney to\nDr. George Brumley who was a consultant with Shell UK\nLTD here in London, who shall be referred to as my\nclient. On the 21st of July 2003, my client Dr. George\nBrumley and his family were involved in a fatal plane\ncrash in Nairobi Kenya, East Africa.\nUnfortunately my client Mr. George and his family lost\ntheir lives.\n\nHere is the website of the incident that struck on\nthat faithful day.\nhttp://www.cnn.com/2003/WORLD/africa/07/20/kenya.crash/index.html\n\nSince then I have made several enquiries to locate any\nof my clients extended relatives and this has proved\nunsuccessful.\nAfter several unsuccessful attempts to locate any\nmember of his family hence I contacted you. I am\ncontacting you to assist in repatriating the money\nleft behind by my client before they get confiscated\nor declared unclaimed by the\nFinancial Institution where this huge deposit were\nlodged. Particularly, the finance company where the\ndeceased had the said fund valued at USD20 million\ndollars has issued me a notice to provide the next of\nkin.\n\nSince I have been unsuccessful in locating the\nrelatives for over 3 years, I seek your consent to\npresent you as the next of kin to the deceased so that\nthe proceeds of this account valued at $20 Million\nDollars can be paid to your account abroad, you will\nhave 30% of the money for your role while I will have\n60% and 10% for expenses that we\nmay incur in the cause of processing the claim.\n\nI have access to all necessary legal documents that\ncan be used to back up any claim we may make. All I\nrequire is your honest co-operation to enable us\nseeing this deal through.\n\nI guarantee that this will be executed under a\nlegitimate arrangement that will protect you from any\nbreach of the law. Please kindly get back to me\nthrough my  Prviate email rob_jakman@yahoo.com.hk address or personal phone number for\nconfidentiality\nand send to me your telephone and fax numbers to\nenable us discuss further\nabout this transaction.\n\nYours sincerely,\n\nRobins Jakeman (Esq.)\nReply here rob_jakman@yahoo.com.hk\n\n\n"}