{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: Logo trademark license vs. copyright license", "body": "Arnoud Engelfriet  writes:\n\n> Francesco Poli wrote:\n> > What I am proposing is just licensing under both laws, but with two\n> > separate grants of permissions: a copyright license (Expat) and a\n> > trademark license (the one we are trying to write).\n>\n> I understand that. It's certainly possible. But what happens if\n> someone stays within the bounds of the copyright license, and\n> strays outside the bounds of the trademark license? Which one wins?\n\nAs a copyright holder *and* trademark holder, you have certain rights\nexclusively reserved in the work. You can sue for breach of those\nrights under either law, since (despite the obfuscatory tactics of the\n\"Intellectual Property\" cabal) the laws are entirely separate and work\nfrom different premises.\n\nIf an act would be forbidden to a recipient under both copyright and\ntrademark law, then the recipient only has license to do it if you\ngrant them copyright *and* trademark license to do it. If you grant a\nreserved right in a copyright license but not a trademark license,\nyou've granted incompatible licenses to the work and the right is\nstill reserved to you.\n\nIf an act would be reserved only under one law, then you need only\ngrant permission to it in the corresponding license, since it's not\nforbidden to the recipient otherwise.\n\nAFAICT, the tricky part is figuring out exactly *what* acts we want to\ngrant permission to do, and how they are affected by copyright law and\ntrademark law, so that we can grant the appropriate permissions in\neach corresponding license. IMHO, we merely need a copyright license\nthat grants the reserved-by-default-under-copyright-law permissions we\nwant to grant, and do the same separately for trademark; the\ncombination fo the two will be to grant all the permissions we want to\ngrant.\n\nHTH, IANAL.\n\n-- \n \\       \"When I get new information, I change my position. What, sir, |\n  `\\          do you do with new information?\"  -- John Maynard Keynes |\n_o__)                                                                  |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}