{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"The00  Egan\" <Warner@gmail.com>", "subject": "The00 Mira todo lo que te llevas por tan poco", "body": "\n\nPremium Design Suite 2007 \n\n\n\n\n\nACLARACION: los graficos de este correo electronico solo se ven ONLINE\n\nNO RESPONDER ESTE CORREO ELECTRONICO.\nPuede realizar su pedido a los correos electronicos que se encuentran al pie de este mensaje.\n\nEnvio contra entrega para Argentina y  España lo paga cuando lo recibe en su domicilio y NO ANTES.\n\n\n\n\n\n\n\n\n\n\nCorel Designer 10.00\r\n      Corel DESIGNER 10 simplifica y mejora el rendimiento de la ilustracion grafica con herramientas especificas de dibujo tecnico y funciones que permiten el intercambio de archivos sin ningun tipo de complicaciones. Diseñada por Corel y toda su experiencia en el mundo del diseño grafico, Corel DESIGNER 10 es un programa de diseño tecnico que fomenta la precision con todo lujo de detalles, un elemento clave en cualquier iniciativa de diseño tecnico.\n\n\n\n \n \n\n\n\n\nCorel Gallery Magic 2006\r\n        Con Corel Magic Gallery podemos crear galerias de fotos, en formato HTML,  como si fuera una pagina web. Ademas, podremos modificar o editar de  manera basica las imagenes para adaptarlas a lo que buscamos: ajuste de  colores, eliminacion de ojos rojos, marcas de agua, etc.\n\r\n        Magic Gallery tambien nos permite crear galerias en formato PDF, y  subirlas directamente a un servidor FTP. Se trata pues de una  aplicacion ideal para usuarios no expertos, que busquen las mayores  facilidades posibles. .\n\n\n\n \n \n\n\n\n\nCorel iGrafx 2006\r\n      Es un abastecedor principal de las soluciones de proceso del analisis  que ayudan a las compañias a alcanzar ventaja competitiva con  excelencia de proceso. Los productos del iGrafx y el equipo de los  servicios profesionales permiten a organizaciones mejorar calidad,  aumentan la satisfaccion de cliente, reducen costes, y aumentan la  utilizacion, la asignacion y el despliegue de recursos con procesos el  entender, el analizar y de la optimizacion. \n\n\n\n \n \n\n\n\n\nCorel Knockout 2.00\r\nEs la herramienta absolutamente  perfecta para cursos de fotografia digital que permite, en trabajos de  fotocomposicion, mantener finos detalles de la imagen transformada, que  antes eran imposibles de conservar con esa exactitud. Es, ademas, un  filtro ideal para usar con Adobe Photoshop o Photoshop Elements 2,  porque acelera sorprendentemente el proceso de diseño y ayuda a captar  elementos complejos de la imagen, tales como liquido, vidrio, hielo,  pelo, humo o fuego, con absoluta precision.\n\n\n\n \n \n\n\n\n\nCorel Paint Shop Pro Photo XI v11.0\r\n      Paint Shop Pro Photo es un completo programa de  imagen, una potentisima herramienta para mejorar, editar, crear e  incluso organizar tus fotografias. \r\n      Este gran producto de Corel incluye las habituales herramientas de  correccion, como la utilidad para corregir 'ojos rojos' o mejora  automatica de una fotografia, y alguna no tan frecuente, como la opcion  de clonar.\r\n      En cuanto a efectos, Paint Shop Pro Photo va muy surtido, tanto en cantidad (abismal, centenares de efectos) como en calidad.\n\r\n      Una herramienta muy potente y versatil, apta tanto para aficionados como para usuarios mas profesionales.\n\n\n\n \n \n\n\n\n\nCorel Painter 9.5\r\n      El software de pintura e ilustracion mas potente del mundo, ofrece  ahora exclusivos pinceles digitales, materiales y texturas que calcan  el efecto y la sensacion de la pintura tradicional en lienzo. El  estudio de arte de Corel Painter X establece la norma en el mundo de la  pintura e ilustracion digital con la introduccion de nuevas  herramientas de composicion, un rendimiento sin paralelo y el nuevo  sistema de pintura RealBristle™, que imita como nunca el comportamiento  de pinceles tradicionales hasta el ultimo detalle de cada cerda  individual del pincel. \r\n      Diseñado para artistas, diseñadores y fotografos y para la nueva generacion de profesionales del arte digital. \n\n\n \n \n \n\n\n\n\nCorel Painter Essentials 3.00\r\n      El software de pintura e ilustracion mas potente del mundo, ofrece  ahora exclusivos pinceles digitales, materiales y texturas que calcan  el efecto y la sensacion de la pintura tradicional en lienzo. El  estudio de arte de Corel Painter X establece la norma en el mundo de la  pintura e ilustracion digital con la introduccion de nuevas  herramientas de composicion, un rendimiento sin paralelo y el nuevo  sistema de pintura RealBristle™, que imita como nunca el comportamiento  de pinceles tradicionales hasta el ultimo detalle de cada cerda  individual del pincel.\r\n      \n\r\n      Diseñado para artistas, diseñadores y fotografos y para la nueva generacion de profesionales del arte digital. \n\n\n \n \n \n\n\n\n\nFaceOnBody Pro 2.4\r\n      FaceOnBody te permite crear simpaticos montajes de foto con los que  gastar una broma a tus amigos, por ejemplo poniendo su cara al lado de  algun personaje famoso.\n\r\n      El proceso se divide en varios pasos para hacerlo mas sencillo: primero  eliges la imagen de fondo (que puede ser una de las que incluya el  programa o una foto tuya); luego, eliges la cara que quieres insertar  en la imagen, y la recortas; y por ultimo, el programa permite ajustar  tamaño, color, brillo, etc. para conseguir un resultado perfecto.\n\r\n      FaceOnBody te permite deshacer todos los movimientos realizados en  cualquier momento, y una vez tienes diseñada tu imagen, puedes  guardarla como fichero o enviarla directamente por correo electronico.  \n\n\n \n \n \n\n\n\n\nAdobe LiveCycle Designer 7.1\r\n      El software Adobe® LiveCycle Designer permite crear formularios en los  que se combina una presentacion de alta fidelidad con la gestion de  datos XML. \n\r\n      Su interfaz grafica de facil utilizacion permite a los  usuarios crear formularios rapidamente, mantener las plantillas de  formularios, definir una logica empresarial para formularios, realizar  cambios y previsualizar los formularios antes de implantarlos como  documentos de Adobe PDF o HTML.\n\n\n \n \n \n\n\n\n\nAutoFX Plugins 2007\r\n      Auto FX          Software es el desarrollador que va a la delantera en el software de          realce visual para Adobe Photoshop Paint Shop Pro y Corel Photo Paint.          Nuestro software trabaja como un plug-in para estos programas graficos y          como una solucion de gestion de imagen independiente para Windows          98/NT/2000/ME/XP y sistemas Power          Macintosh.\n\n\n \n \n \n\n\n\n\nColeccion de Iconos 2007\r\n      Impresionante coleccion de Iconos en medidas grandes de 256 X 256 ,formato PNG (Se abren con Fireworks o cualquier otro editor) en Alta Resolucion\r\n      Se trata de Imagenes no solo para ponerlas de Iconos sino tambien para Logos dados que estan con fondo transparente y en medida grande\n\r\n      La coleccion mas completa que existe en el mundo actual.\n\n\n \n \n \n\n\n\n\nCorel Photo Album Deluxe 6.0 \r\n      Corel® Photo Album™ 6 le muestra la magia de la fotografia digital. \r\n      Esta aplicacion de software inteligente y facil de usar se encarga  automaticamente de tareas habituales en fotografia, como descargar y  organizar fotos, para que pueda pasar mas tiempo disfrutando de sus  fotos y sacando otras nuevas.\n\n\n \n \n \n\n\n\n\nCorel Snapfire Plus v1.0 \r\n      Snapfire Plus continua donde lo deja Snapfire, desde la edicion y  organizacion de fotos y videos, hasta la creacion de divertidas  presentaciones Snapfire y paginas de album de recortes, puedes hacer  todos los proyectos con Corel Snapfire Plus. Podras compartir fotos y  video utilizando plantillas creativas o entretenidas presentaciones  Snapfire. Es la mejor manera de compartir grupos de fotos y archivos de  video. Este programa te permite hacer correcciones en un paso, te  ofrece herramientas de retoque, organiza las fotos sin esfuerzo por tu  parte y te ayuda a crear copias de seguridad automaticas de tu  coleccion de fotos. Corel Snapfire Plus es la manera mas facil de  trabajar con tus fotos digitales.\n\n\n \n \n \n\n\n\n\nCorel WordPerfect Office X3 13.00 \r\n      Corel WordPerfect® Office X3 , es la solucion de  ofimatica \"todo en uno\". Es la solucion ideal para grandes  organizaciones y administraciones publicas, asi como para empresas y  particulares que necesiten un procesador de textos fiable, hojas de  calculo versatiles y software de presentaciones. Una marca de confianza  para millones de usuarios, es significativamente mas barato que  Microsoft® Office, lo cual hace de Corel WordPerfect® Office X3 la  alternativa mas logica y la solucion perfecta. \n\n\n \n \n \n\n\n\n\nCorelDRAW X3 Graphics Suite RETAIL MULTILENGUAJE \r\n      Transforme ideas en resultados profesionales con CorelDRAW Graphics Suite X3\r\n      Sus amplias capacidades y herramientas le permiten crear con  precision y facilidad una gama variada de proyectos, desde logotipos y  graficos para web, hasta folletos publicitarios de varias paginas y  atractivos carteles.\r\n      Con nuevas opciones de vectorizacion en Corel PowerTRACE, nuevas  funciones de edicion de fotografias en PHOTO-PAINT, nuevas herramientas  de aprendizaje en todas las aplicaciones y mejoras en herramientas de  ilustracion y diseño de pagina, este excelente software ofrece  capacidades de diseño y facilidad de uso a un precio mucho mas  asequible que otras soluciones de diseño grafico.\n\n\n \n \n \n\n\n\n\nMacromedia Studio 8 Español \r\n      Macromedi Studio 8 es un paquete imprescindible de aplicaciones de software para diseñar, desarrollar y mantener experiencias interactivas en linea.\r\n      Ofrece la mas amplia gama de herramientas creativas para desarrollar  atractivos medios interactivos, sitios Web o aplicaciones. Utilice  graficos, texto, animacion, video y herramientas de audio con calidad y  control de la precision. Desde un simple grafico animado a avanzadas  experiencias interactivas, Studio 8 proporciona un juego completo de  herramientas para dar rienda suelta a la creatividad.\n\n\n \n \n \n\n\n\n\nCorel Bryce 5.00 \r\n      Animaciones y Paisajes en 3D. Crea impresionantes paisajes y animaciones en 3D con Bryce® 5, un equilibrio perfecto entre potencia y facilidad de uso que te permite integrar tecnologia 3D en tus creaciones artisticas. Con las nuevas opciones de representacion en red (Network Rendering) ahorraras un tiempo precioso al poder representar imagenes en varios equipos conectados a una red. Podras asimismo controlar con gran precision la direccion de las luces utilizando el nuevo laboratorio de luces (Light Lab) y garantizar una representacion mucho mas exacta de entornos reales gracias al nuevo laboratorio de arboles (Tree Lab). Con una interfaz de usuario que simplifica el proceso de diseño y compatibilidad con Mac® OS X tendras a tu disposicion la tecnologia mas avanzada. Bryce 5: todo un nuevo mundo de creatividad.\n\n\n \n \n \n\n\n\n\nCorel Ventura 10.00 \r\n      Cuando se trata de publicar                                 documentos empresariales, Corel® Ventura® 10 es                                 la solucion que necesita. Es la unica herramienta                                 que necesita para trasformar documentos extensos                                 y complejos, incluidos archivos XML, en publicaciones                                 de formato sofisticado con mucho atractivo visual.                                 Una mejor estabilidad y compatibilidad mantienen                                 el flujo de trabajo bajo control, al tiempo que                                 sus herramientas de formato le garantizan documentos                                 refinados. Actualice varias tablas rapidamente con                                 nuevas etiquetas de tabla. Disfrute de una mayor                                 flexibilidad al importar archivos XML, trabajar                                 con el formato PDF y elegir sus opciones de impresion.                                 Puede ademas trabajar con documentos de practicamente                                 cualquier tipo, desde WordPerfect® y Microsoft®                                 Word hasta archivos de Adobe® Illustrator® y CorelDRAW®.                                 Si lo que necesita es aumentar la productividad                                 y obtener resultados de alta calidad, Corel® Ventura                                 10 es la solucion de edicion profesional.\n\n\n \n \n \n\n\n\n\nLightwave 3D 9.00\r\n      Lightwave 3D es uno de los programas mas sencillos y de  facil manejo del sector, alcanzando una gran calidad en imagenes  estaticas\r\n      Es tambien uno de los mas extendidos por ser el paquete con respecto a sus competidores y por estar disponible en el  mercado para las distintas plataformas.\n\n\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\nAndromeda Lens Doc\r\n      Es un Plug-In para Photoshop que te permite corregir la distorsion de barrilete del objetivo asi como la perspectiva de la fotografia. Es francamente bueno es muy exacto, y eres tu el que le da los puntos y coordenadas, no unos parametros standard va perfecto para las fotos de arquitectura.\n\n\n\n \n \n\n\n\n\nAndromeda Measure\r\n        El filtro de la medida utiliza las trayectorias como reglas para la medida y puede contener varias trayectorias adquiridas de:\n * PHOTOSHOP - las trayectorias se importan automaticamente. \r\n        * SELECCIONES - se importan como trayectorias multiples, editable, cerradas. \r\n        * TRAYECTORIAS NUEVAS - se pueden crear y corregir con un lleno, Ilustrador-como sistema de herramienta dentro del filtro. \n\n\n \n \n \n\n\n\n\nAndromeda Perspective\r\n      El plug-in del Andromeda Perspective perspectiva proporciona la capacidad para el usuario  para cambiar la vista o la “perspectiva actual” de una imagen a  cualquier punto en espacio tridimensional con la utilizacion de un  interfaz de uso facil. \r\n      La perspectiva es unica  utiliza un  paradigma de la camara fotografica para introducir profundidad o  perspectiva.\n\n\n \n \n \n\n\n\n\nAndromeda Red Eye Pro\r\n      El Plug-In de RedEyePro es un plug-in compatible de Photoshop que  proporciona la capacidad para el usuario corregir el  ojo-rojo causado en fotografias. el Ojo-Rojo es causado por la luz  reflejada de la retina de los temas cuando un cuadro de destello se  toma en luz corta. Mientras que algunas camaras fotograficas ofrecen la  reduccion del ojo-rojo como caracteristica, puede reducir solamente el  problema, para no eliminarlo.\n\n\n \n \n \n\n\n\n\nAndromeda Scatterlight\r\n      Las lentes de ScatterLight producen un amplio alcance de los efectos  modelado y de la difusion realistas del lente. Estos efectos de la  lente se extienden de los efectos suaves sutiles del foco considerados  lo mas a menudo posible en portraiture y paisajes profesionales, a  efectos mas dramaticos que la dispersion y el foco enciendan sobre las  areas mas brillantes de una imagen.\n\n\n \n \n \n\n\n\n\nAndromeda Shadow\r\n      El Plug-In de Andromeda Shadow es el plug-in  mas  avanzado disponible. Consiste al usar geometria  tridimensional para echar sombras realistas. Una sombra de tu imagen de  la entrada se impone ante un plano del bastidor detras de la cual puede entonces ser manipulado en espacio tridimensional o delante de la  imagen de la entrada. Las camaras fotograficas individuales, una fuente  de luz, y los modos novico del experto permiten el control creativo  completo sobre cualquier sombra de la imagen.\n\n\n \n \n \n\n\n\n\nAndromeda Techtures\r\n      Este plug-in fue creado especialmente para los artistas Web, y de las multimedias que necesitan belleza, textura  sutil y productividad cuando la textura creativa es necesaria.\r\n      Sobre  500 texturas puede ser modificado usando los “motores” dentro del  plug-in.\r\n      Algunos de efectos especiales instantaneos incluyen: Humo,  estrellas, explosiones, gotitas del agua, aligeramiento, el realzar, y  la textura dimensional y ambiental.\n\n\n \n \n \n\n\n\n\nAndromeda Varifocus\r\n      El plug-in de VariFocus continua la tradicion de Andromeda de proporcionar efectos opticos del lente de alta calidad. VariFocus es esencialmente una profundidad del efecto de campo que no te prohibe contraste y desenfoque en un area de la imagen con control de encargo. \r\n      Enfoque directo en donde ha necesitado reforzar una seccion de la imagen \n\n\n \n \n \n\n\n\n\nAndromeda Velociraptor\r\n      Velociraptor es el unico plug-in que permite que el usuario cree los  rastros estilizados del movimiento que pueden formar arcos, despedir,  conectar en cascada, converger, curvar, declinar, sacudir, colocar, torcer en espiral, soltar, rayarse, arrastrarse, o  agitar.\n\n\n \n \n \n\n\n\n\nAndromeda Screens\r\n      El Plug-In  convierte imagenes grises en una amplia variedad  de diversa linea pantallas a partir del 15 a 400 LPI. Con las caracteristicas  de los mezzotints, de los mezzograms agudos del contraste, de los mezzoblends, de las elipses, de las lineas, de los circulos, de los rayos, de las ondas o de cualquier combinacion mezclada. Las screens son 5 estrella, ganador de la clase del mundo\n\n\n \n \n \n\n\n\n\nAndromeda CutLine\r\n    El Plug-In de Cutline esta pensado para el uso en imagenes de escala grises  de tono continuo. Los mejores resultados se consideran con las  fotos o las ilustraciones con grandesmezclas. Las pantallas de  Cutline son una combinacion de las pantallas de la linea/de punto. El resultado es un efecto que emula las tecnicas  clasicas del grabado en madera de la antiguedad. \n\n\n\n\n\n\n\n\n\n\n\n\nAuto Eye\r\n       Fue creado para mejorar automaticamente imagenes digitales y reconstruir detalle en el color, agudeza y  vivacidad de imagen.\r\nAutoEye usa un software totalmente diferente de metodos de ajuste que Photoshop u otra aplicacion de edicion de imagen. No usa las curvas e histogramas estandar para ajustar las imagenes en bases globales dentro del espacio de color RGB o CMYK. Los metodos exclusivos de AutoEye dan como resultado mejoras de imagen que son faciles de obtener y producen un resultado de alta calidad.\n\n\n\n \n \n\n\n\n\nAuto FX Dreamsuite\r\n          DreamSuite es una              aplicacion avanzada con todas las prestaciones para efectos              visuales de realismo fotografico que ofrece control preciso sobre              el proceso creativo.\nEs una idea fresca              soportada por una vision poderosa y una tecnologia              visual innovadora. DreamSuite le permite lograr resultados visuales              que son dificiles o imposibles de obtener usando cualquier otro              software o metodo - incluyendo Photoshop.\n\n\n \n \n \n\n\n\n\nMystical Lighting\r\n          Le permite a cualquier persona aplicar efectos                                                  de iluminacion y sombreado con                                                  realismo fotografico a                                                  imagenes digitales. Con este                                                  software usted puede realzar la                                                  ambientacion de sus imagenes y                                                  mejorar su belleza. Mystical                                                  Lighting incluye 16 efectos                                                  visuales, mas de 400                                                  prestablecidos para resultados                                                  instantaneos y una variedad                                                  infinita de apariencias.\n\n\n\n\n \n \n \n\n\n\n\nMystical TTC \r\n    Es  una coleccion de 38 efectos de edicion de color y tonos construidos  para realzar creativamente las imagenes. Las precisas herramientas de  pincel le permiten mejorar su imagen al dibujar con pincel solo sobre  las areas que usted desea cambiar. Dibuje con el pincel nitidez,  correcciones y efectos tonales y de color con facilidad.\n\n\n \n \n \n\n\n\n\nMystical TTC \r\n          Es                      un conjunto de 14 efectos fotograficos que posibilitan a                      cualquiera, sin importar su experiencia, a darle a las                      imagenes una apariencia artistica unica. Dandole a sus                      imagenes forma y dimension usted puede añadir interes y                      atraccion a su trabajo.\n\r\n          Esta nueva                      version de Photo/Graphic Edges incluye docenas de                      caracteristicas y efectos nuevos. PGE 6 incluye SmartLayers (tm),                      Prestablecidos de Capas Visuales, Efectos de Pincel,                      Des-hacer ilimitado y mucho contenido creativo nuevo.\n\n\n\n\n\n\n\n\n\n\n\n\nAlien Skins Image Doctor\r\n Es todo un nuevo sistema de los filtros de gran alcance de la imagen-correccion para Photoshop®, Fireworks®, la tienda de pintura Pro®, y otros redactores de la imagen. \r\nEl Image Doctor quita magico defectos y repara rapidamente JPEGs over-compressed, y seamlessly substituye los detalles y los objetos indeseados. Los fotografos profesionales y aficionados, los creadores de la foto, los archivistas, los diseñadores graficos y los diseñadores de paginas Web pueden arreglar rapidamente sus imagenes con el doctor de la imagen. \n\n\n\n \n \n\n\n\n\nAlien Skins Splat\r\n    Es un filtro de gran alcance, nuevo el Adobe Photoshop y  otros programas de los graficos. Facil utilizar y versatil, Splat  marcos, texturas, bordes, fronteras, mosaicos y mas de las cosechadoras  con el interfaz premiado del caramelo 4000 del ojo en un plug-in  completamente nuevo. Los fotografos Digitales, los  diseñadores graficos, Diseñadores Web y los artistas digitales pueden  fijar sus imagenes separadas con los efectos imponentes de Splat\n\n\n \n \n \n\n\n\n\nEye Candy 4000\r\n    Una coleccion de diez filtros de Photoshop que cualquier diseñador  apreciara. El impacto ofrece el cromo maravillosamente rendido, metal  cepillado, cristal, cartabones, sombras, reflexiones.\n\n\n \n \n \n\n\n\n\nXenofex 2\r\n    Xenofex 2 entrega 14 efectos mas fenomenales para los diseñadores   Web, los artistas graficos, los fotografos digitales, y los entusiastas  especiales de los efectos. Con Xenofex 2, puedes simular los fenomenos  naturales espectaculares tales como relampago y nubes. Crear las  imagenes y el texto llamativos usando distorsiones sofisticadas tales  como bandera, television, y el rasgon brandnew abierto. Transformar tus  fotos en rompecabezas de rompecabezas, constelaciones, y mosaicos  intrincados con un solo tecleo. Mas, centenares puestos precolocaciones  de efectos rapidos y faciles en tus yemas del dedo.\n\n\n \n \n \n\n\n\n\nQuarkXPress Passport v7.02 Español\r\n      QuarkXPress es el software lider en la industria para diseño y maquetacion.\r\n      Es el software de gran alcance para diseño  de pagina  con un interfaz intuitivo, versatil que te deje combinar tipografia  superior con color y cuadros para producir la salida final dinamica  para la impresion y la entrega del Web. QuarkXPress es ampliamente  utilizado por los compartimientos, los periodicos, las agencias de  publicidad y las firmas del diseño, los vendedores, las impresoras, los  editores corporativos, las casas del catalogo, y los editores del libro.      .\n\n\n \n \n \n\n\n\n\nAdobe Creative Suite CS2 Premium Español\r\n          El software Adobe® Creative Suite 2 Premium es un entorno de diseño  unificado que combina nuevas versiones completas de Adobe Photoshop®  CS2, Illustrator® CS2, InDesign® CS2, GoLive® CS2 y Acrobat® 7.0  Professional con los nuevos Version Cue® CS2, Adobe Bridge y Adobe  Stock Photos. \r\nGracias a la integracion mas innovadora en software creativo, Adobe  Creative Suite 2 le permite materializar sus ideas en cualquier lugar:  en medios impresos, en la Web y en dispositivos moviles.\n\n\n\n\n\r\n        LOS PROGRAMAS NO TIENEN LIMITACION ALGUNA. 100% FUNCIONALES TODO ESTO Y MAS EN 4 DVD'S LLENOS DE TODO LO MEJOR.\r\n        -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\r\n        Costo del Premium Design Suite 2007 en Argentina 90 PESOS ARGENTINOS  Envio contra entrega (lo paga cuando lo recibe y no antes) incluye gastos de envio. \n\nCosto del Premium Design Suite 2007 en España 90 EUROS  Envio contra entrega (lo paga cuando lo recibe y no antes) incluye gastos de envio. \n\r\n        -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\r\n        Para el resto del mundo el precio es de 115 Dolares Estadounidenses PREVIO GIRO  (los gastos que ocasiona el giro estan incluidos en el precio del producto) envio incluido  para todo el mundo.\n\nPara ello debera solicitar los datos a los que debe realizar el giro Western Union a los correos electronicos de pedido. \n\r\n        -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n Para pedir el Premium Design Suite 2007debes detallar:\r\n        Nombre y Apellido:\r\n        Calle y Numero:\r\n        Localidad:\r\n        Codigo Postal:\r\n        Provincia:\r\n        Pais:\r\n        E-Mail:\r\n        Telefono:\n\r\n        En asunto del Mensaje colocar Premium Design Suite 2007\n\nA los siguientes correos electronicos: \n\r\n        ComprarProducto@gmail.com con copia a ComprarProducto@hotpop.com\n\r\n        -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\r\n        Si desea  ser nuestro representante \r\n        en su Pais, no dude en comunicarse con nosotros al mismo mail de pedido. \r\n        En el asunto colocar Licencias Exterior.\n\nSI EN EL TERMINO DE 48 HS NO RECIBE UNA RESPUESTA POR FAVOR ESCRIBANOS NUEVAMENTE. MUCHAS GRACIAS.\n\nAhora podra realizar sus consultas, acceder al servicio Post Venta,\r\n        realizar su pedido y conocer las ultimas promociones mediante\r\n        nuestro MSN (Messenger).-\n\r\n        Si usted no desea que le enviemos mas publicidad por favor envie un email a   ComprarProducto@gmail.com conteniendo en el asunto \"No quiero mas\" (sin las comillas). Para cualquier   consulta o sugerencia puede mandar un mail a ComprarProducto@gmail.com con su   inquietud o sugerencia.\n\n\n\n\n"}