{"category": "ham", "to_address": "\"General Copyright Discussions (questions, organizing,\n\tetc)\" <discuss@list.digital-copyright.ca>", "from_address": "Darryl Moore <darryl@mfe.ca>", "subject": "Re: [d@DCC] Death by Copyright", "body": "Russell McOrmond wrote:\n> Darryl Moore wrote:\n>  > I am doing the final prep of the DVD-ROM which I plan to be sending to\n>  > MPs by the end of next week.\n> \n>   Could you author a sample letter that people could be encouraged to\n> send to their own MPs to encourage them to look at the DVD?   You want\n> to somehow encourage MPs to look at this stuff.\n> \n\nHere is the letter that I am enclosing with the DVDs. A variation of \nthis could be sent separately to encourage the MPs to look for the DVD \nin their inbox\n---\nDear Honourable Member of Parliament,\n\nThe enclosed DVD-ROM is a collection of various kinds of art. The common \nthread that ties them all together is that they, their owners, and/or \nthe artists who created them, have all suffered as a result of the \nunintended consequences of overly broad and inflexible copyright laws.\n\nMost of the material on this DVD cannot be acquired through legitimate \nchannels. Sadly, it is illegal. This DVD includes books, films, music, \nillustrations and much more, and it has been painstakingly acquired over \nthe last couple of years in an attempt to catalogue some of the social \ncost of copyright laws. This is art and free expression which has been \nsuppressed, despite the fact that no measurable damage could be claimed \nfrom its dissemination.  A great many of these examples are Canadian.\n\nI am not calling for anything as radical as revoking copyright. I \nrespect copyright, when copyright respects me. I am trying to \ndemonstrate that there are real consequences for society and for artists \nwhen copyright laws focus too greatly on rights holders and not enough \non creators and users.\n\nUntil recently, the creators' interests were closely aligned with the \ncorporate interests (rights holders) that promoted them. With our new \ncomputer technologies, creativity and distribution is becoming much \neasier for all individuals. As a result, creators' interests are now \nmuch more in line with the end users. Our copyright laws need to reflect \nthis.\n\nAs Parliament is about to, once again, consider changes to the Copyright \nAct, I urge you to review this DVD and consider the consequences.\nAt a time when we should be empowering individuals to use the new \ncreative powers technology is giving them, the agenda of the big media \ncompanies is driving governments around the world in the opposite direction.\n\nThank you for your time.\n\n---\n\n>   As you'll note, I wrote a letter for the FLOSS MP package that the\n> GOSLING group sent.\n> \n> http://www.digital-copyright.ca/edid/letter3\n> \n> \n>   I am wondering if you have contacted the folks at Appropriation Art to\n> see what their thoughts are, given that much of this so-called \"illegal\n> art\" is appropriation without permission (stuff that should be\n> considered Fair Use, but might not be currently).\n> \n\nNot yet, but they are on my list of about 30 people outside Parliament \nto receive copies.\n\n_______________________________________________\nDiscuss mailing list\nDiscuss@list.digital-copyright.ca\nhttp://list.digital-copyright.ca/mailman/listinfo/discuss\n\n"}