{"category": "ham", "to_address": "e-drug@healthnet.org, <aidsdrugs@lists.riseup.net>,\n   HGAPALLIES@LISTSERV.CRITPATH.ORG, ip-health@lists.essential.org,\n   thaiFTA@lists.riseup.net", "from_address": "B.Baker@neu.edu", "subject": "[Ip-health] NGOs respond to Abbott $1000 Price for Aluvia", "body": "\nNGO Response to Abbott\\u2019s announced $1000 price for Aluvia\nin Low- and Lower-Middle Income Countries\nApril 10, 2007\n\nHealth GAP, Student Global AIDS Campaign, American Medical Student\nAssociation, and Essential Action applaud that Thailand\\u2019s compulsory\nlicense, generic competition, WHO intervention, and activist pressure have\nforced Abbott to offer a further 55% reduction in its tiered price for low-\nand lower-middle income countries.  However, as clarified further below,\nthe price discounts still do not go deep enough or wide enough, and Abbott\nhas still withdraw Aluvia and six other medicines from the Thai\nregistration process in retaliation for Thailand\\u2019s lawful exercise of its\nright to issue compulsory licenses for priority medicines for government,\nnon-commercial use.\n\n      Abbott\\u2019s new price announcement confirms the importance of generic\n      competition and the necessity of using compulsory licenses to curb\n      abuses of monopoly power by pharmaceutical companies. Abbott\\u2019s\n      price-discount announcement is mostly due to: (1) Cipla\\u2019s recent\n      announcement (April 1, 2007) to undercut Abbott\\u2019s price and offer\n      Aluvia at $1560/pppy, (2) Thailand\\u2019s decision to issue a compulsory\n      license in response to the unaffordable price charged by Abbott in\n      Thailand other low- and lower-middle-income countries of $2200/pppy,\n      and (3) increased civil society and political pressure exerted upon\n      the company in the last four weeks following its decision to\n      de-register seven medicines from the Thai market.\n      Abbott has not yet agreed to reverse its illegal and unethical\n      withdrawal of seven registration applications from the Thai drug\n      regulatory process, including the application for Aluvia, the\n      heat-stable form of Kaletra that is most appropriate for use in a\n      tropical country like Thailand.  Abbott may have violated Thailand\\u2019s\n      competition law by withdrawing these products; it has certainly\n      violated patients\\u2019 human right of access to essential life-saving\n      medicines.\n      Although this price is lower than what has been currently offered by\n      generic manufacturers, it is still twice the access price of the\n      medicine(s) in least-developed and African countries ($500/pppy), and\n      will exert a heavy financial burden upon low-income and lower-middle\n      income countries seeking to achieve universal access and treatment.\n      Abbott should provide Kaletra/Aluvia at one, no-profit price to all\n      developing countries.\n      Although Abbott\\u2019s price is temporarily lower than the price offered\n      by generic manufacturers, it is highly likely that generic prices\n      will drop below $1000/pppy as an increasing number of patients\n      require 2nd line anti-retrovirals, as generic producers reach\n      economies-of-scale, and as generic versions of Aluvia are WHO\n      pre-qualified and are thus purchasable with Global Fund money.\n      Abbott\\u2019s price discount to Thailand, like its prior discount to\n      Brazil, is primarily designed to reduce market demand that might\n      incentivize efficient generic production.\n      Abbott must not be permitted to blackmail Thailand into withdrawing\n      any compulsory licenses in exchange for a promise to renew its\n      registration application for Aluvia.  Thailand\\u2019s decision to issue\n      compulsory licenses was fully consistent with World Trade\n      Organization intellectual property rules and obligations and with\n      Thai law.  Likewise, the Ministry of Health should not be forced to\n      withdraw its compulsory licenses for efavirenz or Plavix.\n      Even if Abbott is offering a lower price for Kaletra/Aluvia, it does\n      not necessarily mean that Thailand should withdraw, or not execute,\n      its government use license.  There are strong reasons that Thailand\n      may wish to keep its compulsory license to ensure alternative sources\n      of supply, to develop and support domestic and/or regional\n      pharmaceutical capacity, to incentivize generic competition, and to\n      subsequently procure lower-priced generic versions that are\n      WHO-prequalified and registered in Thailand.\n      Thailand should only purchase Kaletra/Aluvia from Abbott to ensure\n      no-stock outs and reliable access across the country, and should not\n      enter into any long-term, binding contract that would make Abbott the\n      country\\u2019s sole supplier for multiple years and preclude future\n      use/access of generic versions.  A prior decision by the Brazilian\n      government to enter into a long-term contract with Abbott for\n      Kaletra/Aluvia has exerted a severe financial burden upon the\n      National AIDS treatment program, and the Brazilian government now\n      pays a price of $1596/pppy that is 60% higher than Abbott\\u2019s new $1000\n      price.\n      The World Health Organization should be staunchly defending and\n      supporting Thailand\\u2019s decision to issue a compulsory license, and\n      should be providing technical support and assistance to the Thai and\n      other governments to enforce and implement compulsory licenses.\n      Any price negotiations conducted by the WHO should be done alongside\n      and through national governments, and not done secretly with\n      pharmaceutical companies.  Any price negotiations or transactions\n      with the pharmaceutical industry should be open, transparent and\n      inclusive to avoid any appearance of impropriety or undue influence\n      of the pharmaceutical industry upon the UN body.\n\n\nSponsors of this statement are seeking additional sign-ons.  Contact Brook\nBaker:  b.baker@neu.edu 617-373-3217\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}