{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nNatural Gas Intelligence  June 12, 2007\n\n\n\nNatural Gas Intelligence  June 12, 2007\n\n\nJun 12, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 12, 2007    \n\n\n\nFirst Enercast Featured Articles for June 12, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories  \n\n\nJun 12, 2007 PowerMarketers Industry Publications\n\n\n\nEnergy Trading and Risk Management 2.0 (UtiliPoint.com - Jun. 11, 2007)\n\n\n\nUtiliPoint.com - Jun. 11, 2007 - Energy trading on a futures exchange began in New York with the NYMEX heating oil contract in 1978.\n\n\nJun 12, 2007 PowerMarketers Industry Publications\n\n\n\nPerfecting Retail Markets (EnergyBiz Insider - Jun. 11, 2007)\n\n\n\nPerfecting Retail Markets (EnergyBiz Insider - Jun. 11, 2007) \n\n\nJun 12, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nAvista to test system for harnessing solar rays: CarouSol units use mirrors to focus sunlight onto small cells\n\n\n\nJun. 12--Avista Utilities and a startup San Francisco company plan to test a new solar power system in North Idaho that could provide an electricity boost to help relieve peak summertime energy use.  GreenVolts Inc. will try out its utility-scale, sun-tracking solar array, billed as more cost-effective than traditional models, near an Avista substation in Rathdrum.\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nPower plant takes another step forward: State energy officials visit Victorville to get a feel for the project\n\n\n\nJun. 12--VICTORVILLE -- When it comes to a new power plant north of the city, California Energy Commission officials are most concerned with air and water quality.  About a dozen CEC officials launched their decision-making process on Friday to license the plant by coming to Victorville for a site tour and the first of many meetings and hearings. \"Air quality is always a big issue,\" said Gary ...\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy aid could be coming to poor families statewide\n\n\n\nJun. 11--The Michigan Public Service Commission has issued two requests for a proposal to provide energy assistance to low-income families across the state. The state utility regulator said up to $50 million could be made available for energy assistance grants and as much as $20 million for energy efficiency grants. The energy efficiency fund was created in 2000 to provide shut-off and other ...\n\n\nJun 11, 2007 Knight Ridder Tribune Business News\n\n\n\nProposal could cut utility tax bite nearly in half: Legislative committee backs rate amendment\n\n\n\nJun. 12--The double-barreled tax bite facing We Energies customers as a result of the $1 billion sale of Point Beach nuclear power plant would be cut nearly in half under a proposal before the state Legislature.  A provision of the plant sale calls for We Energies customers to pay a gross receipts tax that's twice as big as the tax now being charged on the sale of electricity generated by the ...\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nTVA names head of fossil operations\n\n\n\nJun. 12--For the second time in the past decade, the Tennessee Valley Authority has tapped one of its top nuclear power executives to direct the utility's 11 coal-fired power plants.  Preston Swafford, a former Exelon Corp. executive who temporarily served as TVA's chief nuclear officer this spring, will succeed Joseph Bynum as executive vice president of TVA's fossil power group. Mr.\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nClovis joins utility authority: Competition may spur PG&E to cut electricity rates, mayor says.\n\n\n\nJun. 12--Clovis has become the largest community to join a program that could lead to a local power authority to generate electricity for several Valley communities.  Clovis City Council members approved the plan Monday night despite concerns from Pacific Gas & Electric Co., the existing electricity generation provider, that the promised rates could not be met.\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nPower still out for 900 Auburn residents\n\n\n\nJun. 12--Approximately 900 Auburn residents are still without power after last nights thunderstorm swept through east Alabama.  Jan Ellis with Alabama Power said the electricity for those customers should be back on between 1 and 2 p.m. Many residents lost their power between 10:30 and 11 p.m., but around 2 a.m. the substation at Barron's Crossroads was lost, which initially affected about 5,000 ...\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nGovernor's call for clean coal funding backed by his Western peers\n\n\n\nJun. 11--DEADWOOD, S.D. -- Leaders of Western states banded together Sunday to call on the federal government for help in funding new technologies for clean coal energy.  Meeting in this historic 19th century gold mining town, the Western Governors' Association unanimously supported a resolution by Utah Gov. Jon Huntsman Jr. urging the federal government for money and flexibility to move ahead on ...\n\n\nJun 11, 2007 Knight Ridder Tribune Business News\n\n\n\nGroup files petition for state to intervene in proposed power-line construction\n\n\n\nJun. 11--The West Virginia Energy Users Group has filed a petition with the state's Public Service Commission to intervene as an interested party in Allegheny Energy's proposal to construct a power line through six counties in the north-central part of the state.  The group includes Mylan Pharmaceuticals, DuPont, Mittal Steel, Novelis Corp., SKF Pulp Recycling US Inc., UCAR Carbon Inc., U.S. ...\n\n\nJun 11, 2007 Knight Ridder Tribune Business News\n\n\n\nArea power departments trying to form cooperative\n\n\n\nJun. 12--ATHENS -- To protect the Tennessee Valley Authority and its distributors from the federal government, area electric departments are trying to form a cooperative.  Athens Electric Department Manager Gary Scroggins told city leaders Monday that TVA owns all transmission and generation assets. \"If the federal government decided to sell off TVA, the assets would go in the treasury and our ...\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nTalk to regulators about PPL's proposed rate hike\n\n\n\nJun. 12--Lehigh Valley residents will have a chance to weigh in on PPL Corp.'s proposed rate increase, which would boost the average residential customer's bill by 6.2 percent, during two public hearings this month.  The hearings, held by the Pennsylvania Public Utility Commission, will be at 2 p.m. June 22, at Town Hall, 10 E. Church St., Bethlehem; and 7 p.m.\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nNiles electric bills to rise $4.20/month\n\n\n\nCity Council agrees to pay I&amp;M actual cost of service. LOU MUMFORD Tribune Staff Writer NILES -- It's called a 'true-up,'' and it will cost customers of the Niles Utilities Department an extra 9 percent on their electric bills. The hike, approved Monday night by the Niles City Council, will amount to an additional $4.20 a month for the average residential user.\n\n\nJun 12, 2007 South Bend Tribune\n\n\n\n'Voluntary' changes for power companies\n\n\n\nThe Government has backed away from regulating electricity retailers in the wake of the Muliaga case, but is threatening stronger action if beefed up requirements are not met. Prime Minister Helen Clark yesterday said retailers would be subject to new guidelines in dealing with consumers who were struggling to pay their bills or faced disconnection. The guidelines would be voluntary in the ...\n\n\nJun 11, 2007 Dominion Post\n\n\n\n\n\nThe Future of Natural Gas Storage is Here, as Dominion Announces Storage Factory Project\n\n\n\n-- Combines new salt-cavern storage with depleted reservoir storage -- Adds up to 50 Bcf to Dominion's storage capacity -- Will eventually result in 75-100 new jobs RICHMOND, Va., June 12 /PRNewswire-FirstCall/ -- Dominion (NYSE: D) Tuesday announced the Storage Factory Project, which would expand its natural gas storage capacity by up to 50 billion cubic feet (Bcf).\n\n\nJun 12, 2007 PR Newswire\n\n\n\nHigh-Tech, Venture Capital Firms Endorse Governor Rendell's Energy Independence Strategy\n\n\n\nA coalition of high- tech energy companies and venture capital firms from across the state joined Governor Edward G. Rendell in Harrisburg today to voice their support for his Energy Independence Strategy. If the state is to continue to grow its competitive edge in clean energy and dramatically move us closer to energy freedom, the legislature must pass the Energy Independence Strategy, ...\n\n\nJun 12, 2007 PR Newswire\n\n\n\nFitch Places Westar Energy & Kansas Gas & Electric on Rating Watch Positive\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch has placed the long term ratings of Westar Energy, Inc. (WR) and subsidiary Kansas Gas &amp; Electric (KG&amp;E) on Rating Watch Positive. Approximately $2 billion of long-term debt (including off balance sheet obligations) is affected by the rating action. WR and KG&amp;E's long-term ratings are summarized below. WR and KG&amp;E's short-term 'F3' ratings are ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nMomentum Energy Invests Over $250 Million in New Natural Gas Processing Facilities\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Momentum Energy Group LLC (Houston, Texas) is presently spending approximately $255 million to construct multiple natural gas processing facilities in northeastern Texas and Colorado.  For details, view the entire article by subscribing to Industrial Info's Premium Industry News at ...\n\n\nJun 12, 2007 Internet Wire\n\n\n\nPowerFile Joins The Green Grid Consortium\n\n\n\nSANTA CLARA, Calif.--(BUSINESS WIRE)--PowerFile Inc., an innovator in archive appliances for permanent storage of digital content and assets, today announced its membership in The Green Grid, a global consortium of companies dedicated to advancing energy efficiency in data centers and computing ecosystems. Membership in The Green Grid is reserved for end users and technology suppliers that seek ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nEnergy Transfer Partners and Energy Transfer Equity Jointly Announce Retirement of Ray Davis\n\n\n\nDALLAS--(BUSINESS WIRE)--Energy Transfer Partners, L.P. (NYSE:ETP) and Energy Transfer Equity, L.P. (NYSE:ETE) announced that Ray C. Davis, Co-Chief Executive Officer and Co-Chairman of Energy Transfer Partners, L.P. (ETP) and Co-Chairman of Energy Transfer Equity, L.P. (ETE), will retire from these positions following a transition period to transfer his duties to other members of the management ...\n\n\nJun 11, 2007 Business Wire\n\n\n\nFitch Rates Atmos Energy's $250MM Senior Notes 'BBB+'; Outlook Stable\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings has assigned a 'BBB+' rating to Atmos Energy Corp.'s (Atmos) proposed offering of $250 million senior notes due 2017 (the Notes). Proceeds from the Notes financing will be applied to the redemption of $300 million principal amount of unsecured floating rate notes due Oct. 15, 2007. The Rating Outlook is Stable. Fitch most recently affirmed Atmos' 'BBB' ...\n\n\nJun 11, 2007 Business Wire\n\n\n\nAtmos Energy Prices $250 Million of 6.35% Senior Notes Due 2017\n\n\n\nDALLAS--(BUSINESS WIRE)--Atmos Energy Corporation (NYSE: ATO) announced today that it has priced a public offering of $250 million aggregate principal amount of its 6.35% senior notes due 2017, with a yield to maturity of 6.387%. The notes are rated Baa3 by Moodys, BBB by Standard & Poors and BBB+ by Fitch. Merrill Lynch & Co., SunTrust Robinson Humphrey and Wachovia Securities are serving as the ...\n\n\nJun 11, 2007 Business Wire\n\n\n\nE.ON U.S. Selects Accenture and SAP to Power Customer Care System\n\n\n\nLOUISVILLE, Ky.--(BUSINESS WIRE)--E.ON U.S. has selected Accenture (NYSE: ACN) and SAP (NYSE: SAP) for the utilitys largest-ever information technology (IT) transformation project. The goal of the E.ON U.S. Customer Care System (CCS) project is to implement a single system that replaces the different legacy customer systems at its subsidiaries, Louisville Gas and Electric Company and Kentucky ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nTsakos Energy Navigation Announces Time Charter of Liquefied Natural Gas (LNG) Carrier Neo Energy\n\n\n\nFirst phase of LNG investment now complete ATHENS, Greece, June 12 /PRNewswire-FirstCall/ -- Tsakos Energy Navigation Ltd. ('TEN' or the 'Company') (NYSE: TNP) today announced the time charter of the 2007-built 150,000 m3 LNG carrier Neo Energy to a major international energy concern. This charter comes on the heels of the vessel's previous profitable employment secured by the Company.\n\n\nJun 12, 2007 PR Newswire\n\n\n\nSolaicx Announces Major New Solar Facility in Portland\n\n\n\nSolaicx, a leading manufacturer of mono-crystalline silicon ingots and wafers optimized for photovoltaic applications, today announced it has selected a new facility for silicon manufacturing in the City of Portland, Ore. The signing of a lease for the 136,000-square-foot facility, located in the Portland Rivergate Industrial District, represents a major milestone for the company and follows a ...\n\n\nJun 12, 2007 PR Newswire\n\n\n\nUnitedHealth Group Announces New Environmentally Friendly, LEED-Certified ''Green'' Building\n\n\n\nMINNETONKA, Minn.--(BUSINESS WIRE)--UnitedHealth Group (NYSE:UNH) has begun construction on a new environmentally responsible 10-story building adjacent to its headquarters in Minnetonka. The new facility, planned for completion in 2008, reflects UnitedHealth Groups commitment to responsible environmental stewardship and is slated to be among the first LEED-certified buildings in the ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nVentureNet Capital Group Seeks Joint Venture/Acquisition in the Wind Energy Field\n\n\n\nTEMECULA, Calif.--(BUSINESS WIRE)--VentureNet Capital Group, Inc. (Pink Sheets:VNTN) is seeking a joint venture or acquisition in the ever-growing wind energy sector. According to the American Wind Energy Association, the U.S. wind energy industry is putting up equipment in record numbers. 'Wind is now one of the largest sources of new power generation in the country, second only to natural gas ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nWGL Holdings, Inc. Ranked Among Top Corporations in the Nation for Cultural Diversity by Black Enterprise Magazine\n\n\n\nWASHINGTON, June 12 /PRNewswire-FirstCall/ -- WGL Holdings, Inc. (NYSE: WGL), the parent company of Washington Gas and other energy-related subsidiaries, has been named among the 40 Best Companies for Diversity, according to Black Enterprise magazine. The magazine surveyed 1,000 corporations in various industries across the nation to determine the effectiveness of their diversity practices.\n\n\nJun 12, 2007 PR Newswire\n\n\n\n\n\nUS FERC tells PJM Interconnection to tighten grid-expansion test\n\n\n\nThe US Federal Energy Regulatory Commission told the PJM Interconnection Monday to get more specific about its method to determine the economic benefits of a proposed transmission project. If PJM's metrics 'remain vague,' FERC said in an order, anyone opposing a project or its cost allocations could contest the grid operator's assumptions and analysis, which would result in 'greater uncertainty ...\n\n\nJun 11, 2007 Platts\n\n\n\nLNG imports likely to raise US natural gas prices: risk manager\n\n\n\nBoston (Platts)--12Jun2007  New liquefied natural gas terminals and rising US imports of LNG are likely to boost domestic natural gas prices as terminal owners bid against each other to attract cargoes, a risk management official told a natural gas utility audience Tuesday.      'We're going to end up starting a bidding war against ourselves,' Paul Corby, senior vice president of Planalytics, ...\n\n\nJun 12, 2007 Platts\n\n\n\nBL&P preparing for natural gas pipeline g\n\n\n\nBy Janelle Riley The Barbados Light and Power Company Limited (BL&P) will be advertising for a tender for the provision and installation of a gas turbine suited for burning liquid fuel or gas. According to managing director of BL&P Peter Williams, that tender will go out towards the third quarter of this year, with the intention to have that unit installed and ready to operate by 2009.\n\n\nJun 11, 2007 Barbados Advocate\n\n\n\nAtmos Energy Prices $250 Million of 6.35% Senior Notes Due 2017\n\n\n\n(BUSINESS WIRE) -- Atmos Energy Corporation (ATO) announced today that it has priced a public offering of $250 million aggregate principal amount of its 6.35% senior notes due 2017, with a yield to maturity of 6.387%. The notes are rated Baa3 by Moody's, BBB by Standard & Poor's and BBB+ by Fitch. Merrill Lynch & Co., SunTrust Robinson Humphrey and Wachovia Securities are serving as the joint ...\n\n\nJun 11, 2007 Investors Business Daily\n\n\n\nLandmark Texan brewery turns into solar lab\n\n\n\nLOS ANGELES Solar panels will be able to generate about a quarter of the power needed to serve the 67,000 square foot warehouse being renovated by Silver Ventures into a mix of offices, shops and residences. The $1.35 million project will allow city-owned utility CPS Energy 'to test the viability of a solar energy application in a large, real-world commercial application,' according to a ...\n\n\nJun 12, 2007 Orange County Register\n\n\n\nNational 'RPS' energy rules key to fixing flaws arising from a jumble of state policies\n\n\n\n] Contact: Alex Raksin alexraksin@sbcglobal.net 323-301-8205 Study brings clarity and empirical evidence to Congress' attempt to craft America's first-ever 'Renewable Portolio Standard' or RPS Washington, D.C., Embargoed Until June 12th, 2007 -- 'Will the proposed National Renewable Portfolio raise or lower average electricity prices?' 'Will a national standard prevent price gouging and 'gaming' ...\n\n\nJun 12, 2007 EurekAlert!\n\n\n\nAPPA, ELCON hit out at ex-FERC members over restructuring letter\n\n\n\nResponding to nine former US Federal Energy Regulatory Commission members who urged policymakers to support competitive power markets, the American Public Power Association and the Electricity Consumers Resource Council Tuesday said regional transmission organizations and restructured retail markets 'are not working all that well.' APPA and ELCON have been vocal critics of restructuring at the ...\n\n\nJun 12, 2007 Platts\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nAnalysis: Algeria, U.S. reach nuclear pact\n\n\n\nFront Page&gt; UPI Page advertisement UPI Energy Correspondent WASHINGTON, June 11 (UPI) --  While Algeria inked a nuclear cooperation agreement with the United States Saturday, it remains unclear whether the two countries will do business based on the accord, or whether Algeria will embrace nuclear power at all. A U.S. delegation traveled to Algeria last week to tour nuclear energy facilities ...\n\n\nJun 11, 2007 Washington Times\n\n\n\nOil, Gas Prices Fall on Profit-Taking\n\n\n\nThis is the most recent version of this article. View article history. Oil, Gas Prices Fall on Profit-Taking 1 hr 6 ago  Oil, Gas Prices Fall on Profit-Taking 4 hrs ago Oil, Gas Prices Off on Profit-Taking6 hrs ago Nymex Oil Prices Fall on Profit Taking9 hrs ago Nymex Crude Oil Rises on Supply Worries10 hrs ago Oil Prices Below $66 a Barrel in Asia14 hrs ago Oil Prices Slip in Asian Trading1 day ...\n\n\nJun 12, 2007 San Francisco Examiner\n\n\n\nGE Energy, CH2M to build coal seam in Australia\n\n\n\n-- Origin Energy Power Ltd. of Sydney, Australia, has selected GE Energy and its consortium partner, CH2M HILL of Denver, Colo., to supply a turnkey power package for a coal seam gas-fired power plant in a remote region of Queensland, Australia. Located near Braemar, Queensland, the Darling Downs Power Station will be based on a GE 309E combined-cycle system and is scheduled to enter commercial ...\n\n\nJun 12, 2007 Power Engineering\n\n\n\nOil slips below $66\n\n\n\nLONDON (Reuters) -- Oil slid Tuesday as concerns about inflation and higher borrowing costs dominated financial markets and energy investors focused on increasing shipments of North Sea crude and improving U.S. gasoline stocks. Prices had earlier rebounded when the International Energy Agency raised its 2007 oil demand forecast and said in its monthly report OPEC had tightened the taps too far. ...\n\n\nJun 12, 2007 Fortune\n\n\n\nOil climbs after watchdog ups demand forecast\n\n\n\nLONDON (Reuters) -- Oil recouped early losses to trade around $66 a barrel Tuesday after the International Energy Agency raised its 2007 demand forecast and said OPEC had tightened the taps too far. The agency that represents 26 industrialized nations voiced concern that consumer nations' oil stocks were headed towards the low levels of 2004 when oil prices surged. U.S.\n\n\nJun 12, 2007 Fortune\n\n\n\nOMX: The Nordic Exchange Welcomes Svenska Capital Oil to First North\n\n\n\nSTOCKHOLM, Sweden--(BUSINESS WIRE)--Trading in Svenska Capital Oil shares will commence today on First North in Sweden. Including Svenska Capital Oil, First North now comprises 100 companies. Svenska Capital Oil AB is a Swedish oil exploration and production company which develops oil fields mainly in western Ukraine, in the region of the Carpathian mountains.\n\n\nJun 12, 2007 Business Wire\n\n\n\nFitch Affirms Rede's, Celpa's and Cemat's Ratings\n\n\n\nRIO DE JANEIRO, Brazil &amp; SAO PAULO, Brazil--(BUSINESS WIRE)--Fitch Ratings has today affirmed the ratings of Brazil's Rede Empresas de Energia Eletrica S.A. (Rede), and its subsidiaries, Centrais Eletricas Matogrossenses S.A. (Cemat) and Centrais Eletricas do Para S.A. (Celpa. All companies' Issuer Default Ratings (IDRs) and long-term National Ratings have a Stable Rating Outlook.\n\n\nJun 11, 2007 Business Wire\n\n\n\nGain Insight into the Global Energy Industry\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59296) has announced the addition of Looking at the Global Energy Industry to their offering. The global energy industry has explored many options to meet the growing energy needs of industrialized economies wherein production demands are to be met with supply of power from varied energy resources ...\n\n\nJun 11, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}