{"category": "spam", "to_address": "the00@plg.uwaterloo.ca", "from_address": "\"Edwardo Robertson\" <maccccroseburgdoc@cccroseburg.org>", "subject": "Women will love your new figure", "body": "\nControl your weight and appetite\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting product for corpulent people is made available now – As shown on CNN.\n\n\nCan you remember all the cases when you appeal to yourself to do anything to get rid of this fastly growing pounds of fat? Luckily, now no big price is to be paid. With Anatrim, the earth-shaking kilos-melting medley, you can get naturally health life style and become really thinner. Have a look at what our customers write!\n\n\n\n\"I hate to acknowledge it but I was a junk food addict. \n\n\nI ate all this rubbish \n\n\nand was unable to stop. \n\n\n\n\nThis torment left off when I started taking Anatrim! \n\n\nHoly God,\n\n\n\n\n my craving for food decreased, \n\n\nspirits increased and I turned to the happiest person 27 pounds in 2.1 months. \n\n\n\n\nI can tell you now I’m the happiest person!\"\n\n\n\n\n\nLusia R., San Diego\n\n\n\n\n\n\"I had problems with over-weight since I was a boy. \n\n\nYou can't fancy how I hated being mocked at school. \n\n\n\n\nI abhorred my plumpness and I abhorred myself. \n\n\nAfter trying this and that I heard about Anatrim. \n\n\n\n\nIt literally dragged me out of this horrible nightmare! A plenty of thanks to you, fellows.\"\n\n\n\n\n\nMike Brown, Bellevue WA\n\n\n\n\n\n\"You know what? Thanks to Anatrim my marriage was saved! I got into the circle, depression – more eating – more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne of my friends pointed at your web site and I asked for pack of Anatrim at once. \n\n\nThe results I achieved were great, my appetite became normal, I was in a good mood oftener, and, of course, I became able to tighten my belt on some holes. And the sex became fantastic, too!\"\n\n\n\n\n\nSteve\n\n\n\n\n There are lots of gratitudes left by happy people trying Anatrim. Why don't you add yourself to the tens of thousands of slim women and men and take this all-natural appetite-reducing energy lifting product now!\n\n\nDon’t decline your opportunity!\n\n\n\n\n"}