{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Ben Finney <bignose+hates-spam@benfinney.id.au>", "subject": "Re: sphpblog License-Question (modified/expanded GPL)", "body": "Cord Beermann  writes:\n\n> I want to add a package to Debian with the following\n> License-Statement:\n\nDoes this mean you are the sole copyright holder? Or is this a work\nderived from someone else's work? What is the license of that existing\nwork?\n\n> ------------------------------------------------------------\n> The Simple PHP Blog is released under the GNU Public License.\n\nThere's no such license. You probably mean the \"GNU General Public\nLicense, version 2 or, at your option, any later version\".\n\n> You are free to use and modify the Simple PHP Blog. All changes must\n> be uploaded to SourceForge.net under Simple PHP Blog.\n\nThis is an unreasonable requirement; the recipient may have no means\nof satisfying this, but your license terms demand they do so anyway.\n\nIt also contradicts the GNU GPL: you're placing an extra restriction\non the recipient which isn't already in the GPL. This makes the work\nunredistributable, because no redistributor can satisfy both the GPL\nand your extra restriction.\n\n> Credit must be give to the original author\n\nFine; this is already part of the GNU GPL version 2.\n\n> and the Simple PHP Blog logo graphic must appear on the site and\n> link to the project on SourceForge.net\n\nThis is an extra restriction, and has exactly the same problem as\ndiscussed above.\n\n> ------------------------------------------------------------\n> Does this make the package incompatible to DFSG?\n\nIt currently is self-contradictory, which means no recipient can\ndistribute it at all.\n\n> PS: Please keep the Cc on the wnpp-bug #421513\n\n-- \n \\       \"Probably the toughest time in anyone's life is when you have |\n  `\\         to murder a loved one because they're the devil.\"  -- Emo |\n_o__)                                                          Philips |\nBen Finney\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}