{"category": "spam", "to_address": "<gnitpick@speedy.uwaterloo.ca>", "from_address": "\"djmconsulting\" <djmconsulting@candoconsutling.info>", "subject": "Experienced and Affordable Laser Vision Correction.", "body": "\n\n\n\nLasikPlus : 18 Months Financing : LasikPlus Vision Centers : 866-336-4995\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nULTIMATE AFFORDABILITY!\nBecause You Want Excellent Results at an Affordable Price.\n NOT A CENT UPFRONT!\nNo down payment keeps more money in your pocket,\nmore flexibility in your budget.\nNOT A PENNY OF INTEREST!\nIt?s almost like paying cash, except now you have\n18 months to s-t-r-e-t-c-h your payments.\n BITE-SIZED PAYMENTS!\nYour interest-free payments could be as little as\n$41.94 per month. And it?s a cinch to qualify.\n\n\n\n\n\n\n\nLASIK Counselors Available\nMon-Fri: 7 am - 12 am EST\nSaturday: 8 am - 12 am EST\nSunday: 9 am - 8 pm EST\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProven Experience LASIK is all we do, with over 700,000 procedures since 1991.\n\nFREE LASIK Vision Exam Get a complete LASIK vision exam at no charge or obligation.\n\nMultiple LASIK Technologies Ensures optimized results by matching your eyes to the\nprecise LASIK technology ? including Custom Wavefront.\n\nClimate-Controlled Treatment Center Promotes a better outcome by controlling humidity and temperature.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n?2007 LCA-Vision Inc. Offer is subject to credit approval. No finance \ncharges will be assessed if the amount in full is paid by the due date. A minimum monthly payment of 3% of the balance is \nrequired. Other financing options are available. Call for details.\n\nFL Residents only:  The patient and any other person responsible for payment has a right to refuse pay, cancel payment, or be \nreimbursed for payment for any other service, examination, or treatment that is performed as a result of and within 72 hours \nof responding to the advertisement for the free, discounted fee, or reduced fee service, examination, or treatment.\n\nTo unsubscribe from \n      future correspondence from LCA, please click here for us to remove you.\nLCA-Vision, Inc / LasikPlus is located at 7840 Montgomery Road, Cincinnati, OH 45236.\n\n\n\n\n\n\nUse this link to be automatically removed from any future offers\n\n\nIf you do not wish to receive any more offers from via e-mail, please write us with your removal request.  Customer Service 560- A F ST #438 Grants Pass, OR 97528.Please note: It may take up to 3 days for your name to be removed from our list. \n>\n\n\n\n\n\n\n\n"}