{"category": "spam", "to_address": "producttestpanel@flax9.uwaterloo.ca", "from_address": "Weight Loss Report <Montague@jwleuxivsu.homehealthcapital.net>", "subject": "Hoodia - Breakthrough in Weight Management", "body": "You registered to receive this and similar offers from  on .\n\nYOUVE HEARD ABOUT IT \nYOUVE READ ABOUT IT \nYOUVE SEEN IT ON TV \nAND NOW ITS FINALLY HERE! \n\nTHE MOST EFFECTIVE WEIGHT-LOSS INGREDIENT EVER TO HIT THE \nMARKET IS NOW AVAILABLE FROM NUTHRATHIN!!!!\n\nTry a FREE SAMPLE today and see what everyones talking about firsthand\n\nhttp://jwleuxivsu.homehealthcapital.net/t/l?g4-pih-1-k2r-8jdp\n\n\n\n\nThis advertisement was presented to you by NutraCORE. New legislation,\ncommonly referred to as the \"CAN-SPAM Act of 2003\", now makes it\npossible for you to indicate that you would rather not be contacted by\nthis \nadvertiser again. You can do this in one of two ways. First, you may\nwrite to them at this address: \n\nNutraCore INC. \n277 Lakeshore rd. East suit 305, \nOakville Ontario, L6J 1H9 Canada\nCanada L6H 5V1 \n\nIf you choose to do that, please print out a copy of this advertisement \nand include it with your request. \n\nOr, you can go to the following link. At the bottom of the webpage, go\nto the \"Unsubscribe\" link at the bottom of the page. \n\nEnter your email address. Your email address will then be removed \nwithin 24 hours. \n\nhttp://jwleuxivsu.homehealthcapital.net/t/l?g4-pih-2-k2p-8jdp\n\nSincerely, \nStacey Sicard, \nOperations Director, NutraCORE, Inc.  8jdp\n\nIf you no longer wish to receive these commercial emails, you may remove yourself from our mailing list by clicking here http://jwleuxivsu.homehealthcapital.net/remove?r.Montague.2a-90fc812-199d.speedy.uwaterloo.ca.-producttestpanel?r click here or by calling our unsubscribe hotline at 864-752-1051. Please note this phone number is used solely for unsubscribe requests. Please allow up to five business days for your request to be processed.\n\nYou may also contact us by writing to us at our postal address: Montague| 9600 Great Hills Trail, Suite 150 W| Austin, TX 28759\n\n\n\n\n"}