{"category": "ham", "to_address": "\"'Speakup is a screen review system for Linux.'\" <speakup@braille.uwo.ca>", "from_address": "\"Georgina Joyce\" <gena-j@bulldoghome.com>", "subject": "RE: Definitely unslung", "body": "Hi\n\nNo, why, isn't an ARM processor good enough?  As I said with a 2 Gb stick in one of the two USB ports, it's quite responsive in loading apps but I haven't installed any speech on it.  I should that but as I said it's been found permanent tasks, so won't be messed about with.\n\nThanks, for the louder Linux info.  I didn't know about that one.\n\nRegards\n\nGena\n\nAmateur Call: M 0 E B P\n\nVOIP / IM: gena1959uk\n\n\n\n-----Original Message-----\nFrom: speakup-bounces@braille.uwo.ca [mailto:speakup-bounces@braille.uwo.ca] On Behalf Of C.M. Brannon\nSent: Tuesday, June 05, 2007 1:55 AM\nTo: speakup@braille.uwo.ca\nSubject: Re: Definitely unslung\n\n\n\"Georgina Joyce\"  writes:\n\n> no more mods on this one.  But I'm still looking for a way of\n> building my own Linux portable PC that I can use as a mp3 player if\n> I choose, a note taker, or diary manager.  While the slug has 2 USB\n> ports and a Ethernet connection I really need to be able to add\n> further boards such as Bluetooth and wireless B/G.  So if anyone\n> else is meddling in such areas please let me know.\n\nHi,\nI've been hoping for an affordable portable Linux system for some\ntime, especially if it has wireless networking and ethernet.  I hate\nlugging a laptop; the dead weight of a screen is especially irksome.\nPDAs with speech are overpriced.  Most seem to run Windows, with one\nexception (the Pappenmeier device).\n\nThere's a group of people who are trying to turn a Linksys router into\na talking portable.  See www.louderlinux.net.  I wish them luck.\n\nDoes your \"slug\" device use an x86 processor?  That would make it\nespecially attractive.\n\n-- Chris\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n__________ NOD32 2308 (20070604) Information __________\n\nThis message was checked by NOD32 antivirus system.\nhttp://www.eset.com\n\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}