{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "\"CNN Political Ticker\" <politicalticker@cnn.com>", "subject": "CNN Political Ticker AM, Friday, May 25, 2007", "body": "For the latest, breaking political news, check for updates throughout the day on the CNN Political Ticker\nhttp://www.cnn.com/ticker. All politics, all the time.\n\nCompiled by Stephen Bach (stephen.bach@cnn.com)\nCNN Washington Bureau\n\nMaking news today...\n\n* Congress sent a $120 billion war spending bill to the White House late Thursday, abandoning a call for most U.S.\ntroops to leave Iraq after an earlier veto by President Bush.\n\nFull story on CNN.com: http://www.cnn.com/2007/POLITICS/05/24/iraq.funding/index.html\n\n\"War opponents dismissed the bill as a capitulation to Bush,\" but backers said the bill's provisions \"represented an\nassertion of congressional authority over the war that was unthinkable a few months ago.\" (Washington Post)\n\n\"[I]t postpones only until fall the next open battle between the Democratic-controlled Congress and Republican White\nHouse - a time when Bush's hand may be even weaker.\" (Chicago Tribune)\n\n* \"Courting the anti-war constituency, Democratic presidential rivals Hillary Rodham Clinton and Barack Obama both\nvoted against legislation.\" (AP)\n\nClinton told CNN after the vote that \"Nobody believes\" claims that she and other Democrats do not support U.S. troops.\n\n\n\"I've been trying to get the administration to change course and engage in what I believe would be more effective\nactions in Iraq, and they haven't done it,\" she said. \"You know, at some point, you don't want to keep going on with\nit.\" (CNN.com)\n\n* The latest New York Times/CBS News poll finds:\n\n\"[T]here is broad support among Americans - Democrats, Republicans and independents alike - for the major provisions\"\nin the immigration bill before Congress.\n\n\"Americans now view the war in Iraq more negatively than at any time since the invasion more than four years ago.\"\n\n\"President Bush's approval ratings remain near the lowest of his more than six years in office. Thirty percent approve\nof the job he is doing over all, while 63 percent disapprove.\"\n\nFull poll results (pdf): http://graphics8.nytimes.com/packages/pdf/national/20070525poll.pdf\n\n* Will Al Gore run? \"[T]he remaining Arctic and Antarctic ice could shrink to fill a cocktail shaker before even the\nmost skilled forensic psychologist (or screenwriter) figures out exactly how Gore is leaning on this matter.\" (Los\nAngeles Times)\n\n* And as we head into the Memorial Day weekend, which presidential candidates would Americans prefer to picnic with?\nFind out the results of a new poll in Hot Topics below!\n\nPresident's Schedule:\n\n* The president travels to the National Naval Medical Center in Bethesda, where at 10:50 am ET he'll visit with wounded\nmilitary personnel.\n\n>From there, Bush will fly directly to Camp David for the weekend.\n\nAlso on the Political Radar:\n\n* House Speaker Nancy Pelosi, Majority Leader Steny Hoyer, Whip James Clyburn and DCCC Chair Chris Van Hollen hold a 10\nam ET presser on \"Dem Accomplishments.\"\n\n* Bill Clinton gives the commencement address at Rochester Institute of Technology at 10 am ET.\n\n* Defense Secretary Robert Gates gives the commencement address at the U.S. Naval Academy in Annapolis at 10:15 am ET.\n\n\n* Sen. Barack Obama (D-IL) addresses the Coalition of Black Trade Unionists' International Convention at 1 pm ET in\nChicago.\n\n* Sen. Sam Brownback (R-KS) holds a 1 pm ET Grand Opening for his Iowa campaign HQ in West Des Moines, IA.\n\n* First Lady Laura Bush participates in the Sandra Day O'Connor Awards Luncheon at the Arizona Biltmore Resort and Spa\nin Phoenix, AZ, at 2:45 pm ET.\n\n* Sen. Hillary Clinton (D-NY) travels to Iowa for a 2 pm ET \"Conversation with Veterans and Iowans\" at North Iowa Area\nCommunity College in Mason City, a 5 pm ET meeting \"over pie and coffee\" at Lincoln Elementary School in Charles City,\nand an 8:15 pm ET meet and greet at Premier Pizza in Algona.\n\n* John Edwards also spends a busy Friday in the Hawkeye State with community meetings in Fort Madison (9:15 am ET),\nKeosauqua (11:30 am ET), Fairfield (1:15 pm ET), Mount Pleasant (3 pm ET), and Washington, IA (6:45 pm ET).\n\n* The Senate Radio-Television Correspondents' Gallery Daybook: http://www.senate.gov/galleries/radiotv/list.htm\n\n* The House Radio-Television Correspondents' Gallery Daybook: http://radiotv.house.gov/news-events.aspx\n\n=================================================================\nPolitical Hot Topics\n(Today's top political stories from news organizations across the country)\n\nCLINTON, OBAMA VOTE \"NO\": Courting the anti-war constituency, Democratic presidential rivals Hillary Rodham Clinton and\nBarack Obama both voted against legislation that pays for the Iraq war but lacks a timeline for troop withdrawal. \"I\nfully support our troops\" but the measure \"fails to compel the president to give our troops a new strategy in Iraq,\"\nsaid Clinton, a New York senator. \"Enough is enough,\" Obama, an Illinois senator, declared, adding that President Bush\nshould not get \"a blank check to continue down this same, disastrous path.\" Their votes Thursday night continued a\nshift in position for the two presidential hopefuls, both of whom began the year shunning a deadline for a troop\nwithdrawal. AP via Yahoo! News: Clinton, Obama vote 'no' on Iraq bill\nhttp://news.yahoo.com/s/ap/20070525/ap_on_el_pr/candidates_iraq\n\nREMARKS \"CLEAREST YET\" ON BUSH VISION FOR U.S. ROLE IN IRAQ: President Bush said Thursday that once his troop buildup\nimproved security in the Iraqi capital, he intended to follow the withdrawal plan proposed by a bipartisan study group,\nembracing recommendations previously spurned by the administration. Speaking at a White House news conference, Bush for\nthe first time adopted the blueprint outlined in December by the Iraq Study Group, saying he envisioned U.S. troops\ngradually moving out of their combat role and into support and training functions. \"You know, I would like to see us in\na different configuration at some point in time in Iraq,\" Bush said, referring to the study group by the names of its\nco-chairmen, former Secretary of State James A. Baker III and former Rep. Lee H. Hamilton (D-Ind). \"The recommendations\nof Baker-Hamilton appealed to me.\" Bush's remarks were the clearest yet on his vision for the long-term U.S. role in\nIraq. Los Angeles Times: Bush opens the door to a troop withdrawal\nhttp://www.latimes.com/news/politics/la-na-bush25may25,1,5206160.story\n\nNYT POLL FINDS BROAD SUPPORT FOR IMMIGRATION BILL: As opponents from the right and left challenge an immigration bill\nbefore Congress, there is broad support among Americans - Democrats, Republicans and independents alike - for the major\nprovisions in the legislation, according to the latest New York Times/CBS News poll. Taking a pragmatic view on a\ndivisive issue, a large majority of Americans want to change the immigration laws to allow illegal immigrants to gain\nlegal status and to create a new guest worker program to meet future labor demands, the poll found. At the same time,\nAmericans have mixed feelings about whether the recent wave of immigration has been beneficial to the country, the\nsurvey found, and they are sharply divided over how open the United States should be to future immigrants. New York\nTimes: Immigration Bill Provisions Gain Wide Support in Poll http://www.nytimes.com/2007/05/25/us/25poll.html\n\nBUSH WILL SIGN MINIMUM WAGE HIKE: Congress handed a major victory to low-income workers on Thursday night by approving\nthe first increase in the federal minimum wage rate in a decade. By a vote of 348 to 73, the House approved the measure\nas part of a deal on Iraq spending. Less than two hours later, the wage increase was approved in the Senate, where it\nwas combined with a bill providing more money for the Iraq war. That vote was 80 to 14. The measure would raise the\nminimum wage to $7.25 an hour from $5.15 in three stages over two years. The bill includes $4.84 billion in tax breaks\nfor small businesses. They have made a case, supported by Republicans and the White House, that the wage increase would\nbe a burden for them. President Bush said he would sign the measure as part of the bigger spending package that had\nbeen negotiated between Democratic lawmakers and the administration. New York Times: Congress Backs Rise in the Minimum\nWage http://www.nytimes.com/2007/05/25/washington/25wage.html\n\nHOUSE PASSES \"BUNDLING\" BILL: Under pressure to keep campaign promises to clean up Washington, House Democratic leaders\npushed through major reform legislation that will require greater disclosure of the links between lawmakers and\nlobbyists. Chief among the reforms is a measure that requires lobbyists to disclose how much money they solicit from\nfriends and business associates on behalf of a candidate. The so-called \"bundling\" bill was steeply resisted by\npro-business Democrats and minority members who worried it would discourage lobbyists from helping to raise campaign\ncash. In the end, the bundling measure passed 382-37, as House Democratic leaders managed to hold their own ranks and\ndraw plenty of support from Republicans anxious to burnish their own good-government credentials after a spate of\nscandals helped oust the GOP from power last year. The Politico: Lobbying reform measures pass House\nhttp://www.politico.com/news/stories/0507/4176.html\n\nAG \"NO CONFIDENCE\" VOTE WILL GO FORWARD IN JUNE: The Senate will hold a vote of no-confidence on Attorney General\nAlberto Gonzales in June, the sponsors of the measure announced Thursday. \"Make no mistake about it: We are moving\nforward,\" said Sen. Charles Schumer (D-N.Y.), who is leading the effort. \"When a situation becomes so serious that\nthere's a crisis in leadership of this magnitude, a Congress not only has the right to weigh in, we have a\nresponsibility to take action. And we will.\" Schumer added that he and Sens. Dianne Feinstein (D-Calif.) and Sheldon\nWhitehouse (D-R.I.) secured a promise from Senate Majority Leader Harry Reid (D-Nev.) that they would get a vote on\ntheir measure following Senate action on the immigration bill. The Hill: Senate to hold Gonzales no-confidence vote in\nJune http://thehill.com/leading-the-news/senate-to-hold-gonzales-no-confidence-vote-in-june-2007-05-24.html\n\nBUSH'S \"TWILIGHT\" \"CHARM OFFENSIVE\": The meal was fit for a queen: caviar, Dover sole almondine and spring lamb. The\nsetting was no less impressive: the upstairs residence of the White House, with its unrivaled vista of the National\nMall. \"It's not Crawford,\" President George W. Bush told his guests, referring to the dusty central Texas town where he\nowns a ranch. \"But if you can't be in Texas, what a view!\" As Representative Chet Edwards, a Texas Democrat, admired\nthe scenery, he said later, he was struck by his presence at the April 17 dinner -- his first such invitation from\nBush. Only 20 months before the end of his term, Bush has begun a cross-party charm offensive that many had expected at\nthe dawn rather than the twilight of his presidency. His aim is to make bipartisan progress on a few big issues -- such\nas an overhaul of immigration laws -- before he leaves office. Bloomberg: Bush Launches Charm Offensive in Bid to Woo\nSkeptical Democrats http://www.bloomberg.com/apps/news?pid=washingtonstory&sid=akg7GXICOpys\n\nHE WON'T RUN PHILLY, BUT HE STILL BECOMES \"MAYOR\": As expected, Rep. Robert Brady (D-Pa.) was officially tapped by\nSpeaker Nancy Pelosi (D-Calif.) to head the House Administration Committee today. Brady's appointment to the post\nfollows the April 22 death of the panel's former chairwoman, Rep. Juanita Millender-McDonald (D-Calif.). In taking over\nthe committee, Brady - who earlier this month came in third in Philadelphia's mayoral primary - now becomes the\nunofficial \"mayor of Capitol Hill.\" His nomination by Pelosi to the post was approved by the Democratic Caucus at a\nmeeting Thursday morning. \"Congressman Brady's experience as a leading member of the House Administration Committee and\nhis in-depth knowledge of the internal functions of the House will make him a powerful voice as Chairman,\" Pelosi said\nin a release. \"I know Congressman Brady will expand upon the efforts of Chairwoman Millender-McDonald to promote\nequality and diversity on Capitol Hill.\" Roll Call: Brady Named Mayor - of Capitol Hill\nhttp://www.rollcall.com/issues/1_1/latest_news/18672-1.html\n\nMOST WOULD PREFER TO PICNIC WITH GIULIANI AND OBAMA: Rudy Giuliani and Barack Obama have won the picnic poll. Asked\nwhom they would most like to chat with at a Memorial Day picnic, Giuliani, the former New York City mayor, was picked\nby 37 percent of all those polled when pitted against three other Republicans. Sen. John McCain, R-Ariz., got 27\npercent. Obama, the Democratic senator from Illinois, was chosen by 33 percent when grouped with three other Democrats.\nSen. Hillary Rodham Clinton, D-N.Y., was second with 24 percent. Munching hot dogs with smaller groups of people would\nbe former Sen. John Edwards, D-N.C.; former Vice President Al Gore; former Sen. Fred Thompson, R-Tenn., and former GOP\nMassachusetts Gov. Mitt Romney. AP via Yahoo! News: Most would chat with Giuliani, Obama\nhttp://news.yahoo.com/s/ap/20070525/ap_on_el_pr/on_the2008_trail\n\nCAMPAIGN HAS \"NERVOUSLY AWAITED\" TWO NEW CLINTON TOMES: Two new books on Sen. Hillary Rodham Clinton of New York offer\nfresh and often critical portraits of the Democratic presidential candidate that depict a tortured relationship with\nher husband and her past and challenge the image she has presented on the campaign trail. The Hillary Clinton who\nemerges from the pages of the books comes across as a complicated, sometimes compromised figure who tolerated Bill\nClinton's brazen infidelity, pursued her policy and political goals with methodical drive, and occasionally skirted\nalong the edge of the truth along the way. The books portray her as alternately brilliant and controlling, ambitious\nand victimized. The Clinton campaign has nervously awaited publication of the books for fear they would include a\nbombshell revelation or, at the very least, revive memories of less-savory moments in the couple's rise to power.\nWashington Post: Books Paint Critical Portraits of Clinton\nhttp://www.washingtonpost.com/wp-dyn/content/article/2007/05/24/AR2007052402479.html\n\nTHE NEW BOOKS:\n\n\"A Woman in Charge: The Life of Hillary Rodham Clinton\" by Carl Bernstein.\nhttp://www.amazon.com/Woman-Charge-Hillary-Rodham-Clinton/dp/0375407669\n\n\"Her Way: The Hopes and Ambitions of Hillary Rodham Clinton\" by by Jeff Gerth and Don Van Natta Jr.\nhttp://www.amazon.com/Her-Way-Ambitions-Hillary-Clinton/dp/0316017426\n\nMEMO MET WITH A SHRUG IN HAWKEYE STATE: News that a top campaign adviser to Democrat Hillary Clinton had suggested the\nparty's presidential frontrunner bypass campaigning in Iowa will likely echo as the New York senator returns to Iowa\ntoday. But few party activists in Iowa or top national Clinton supporters sense any insurrection in the New York\nsenator's campaign. Nor do they expect her to reverse course in Iowa. \"It causes some ripples for a while,\" said Sarah\nSwisher, an Iowa City labor activist and vice chairwoman of the state Democratic Party. \"Democratic activists would not\nbe pleased to hear Senator Clinton were really reducing her campaign in Iowa or eliminating it,\" Swisher said. \"But I\ndon't think that's going to happen.\" Des Moines Register: Democrats shrug off Clinton adviser's memo\nhttp://desmoinesregister.com/apps/pbcs.dll/article?AID=/20070525/NEWS09/705250475/1056\n\nGORE'S NOT TRYING TO BE \"COY OR GLIB.\" SERIOUSLY: Like an actor polished by constant interviews on a marathon movie\njunket, vice president turned Hollywood darling Al Gore has mastered the art of (not) answering the most obvious\nquestion: Is he running for president in 2008? \"I'm not trying to be coy or glib in any way,\" he says coyly during an\ninterview this week in Beverly Hills. \"I have no plans or intentions or expectations of running.\" Really? Are you sure?\nYou mean you'll never run again? Laurie David will become your adopted child if you do. He laughs and goes with the\nthought. \"Well, when you put it that way, I haven't completely ruled out the possibility of thinking about it sometime\nin the future, but I don't expect to,\" he says, obviously spoofing all the answers he's given on the subject in recent\nweeks. Los Angeles Times: Politics not his game, Gore says\nhttp://www.latimes.com/news/politics/la-et-cause25may25,1,2559463.story\n\nROMNEY SAYS HE HAS RESPECT AND TOLERANCE FOR GAYS: Republican presidential candidate Mitt Romney said Thursday that his\nopposition to same-sex marriage should not be interpreted as intolerance of gays, who served in his administration when\nhe was Massachusetts governor. In a brief interview with The Associated Press, Romney elaborated on comments made\nduring a campaign event dubbed \"Ask Mitt Anything\" in which an audience member was concerned that the government could\nprevent pastors from preaching that homosexuality is a sin. Romney said the government shouldn't tell pastors what they\ncan say. Afterward, Romney would not say whether he thought homosexuality was immoral. \"I don't think that a person\nwho's running for a secular position as I am should talk about or engage in discussions of what they in their personal\nfaith or their personal beliefs is immoral or not immoral,\" the former governor said in the AP interview. AP via Yahoo!\nNews: Romney: I'm not intolerant of gays http://news.yahoo.com/s/ap/20070525/ap_on_el_pr/romney_gays\n\nPAUL TRYS TO ASSIGN RUDY SOME HOMEWORK: The fringe Republican presidential candidate who tried to blame the United\nStates for 9/11 during last week's GOP debate in South Carolina assigned Rudy Giuliani a reading list yesterday to\n\"prove\" his case. Anti-war candidate Ron Paul claimed during the forum that U.S. foreign policy contributed to the\nattacks. Giuliani snapped back that the comments were \"extraordinary\" and \"absurd\" - and urged the Texas congressman to\nwithdraw his statement. Paul yesterday suggested Giuliani read \"Dying to Win,\" a book about suicide bombers;\n\"Blowback,\" which criticizes the unintended consequences of American foreign policy; and \"Imperial Hubris,\" by Michael\nScheuer, formerly of the CIA. New York Post: POL THROWS '9/11' BOOK AT GIULIANI\nhttp://www.nypost.com/seven/05252007/news/nationalnews/pol_throws_9_11_book_at_giuliani_nationalnews_carl_campanile.htm\n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings go to\nhttp://audience.cnn.com/services/cnn/memberservices/member_auth.jsp?url=http%3A%2F%2Faudience.cnn.com%2Fservices%2Fcnn%2Fmemberservices%2Fregwall%2Fmember_profile.jsp%3Fsource%3Dcnn\n\nTo unsubscribe from the CNN Political Ticker list, go to\nhttp://cgi.cnn.com/m/clik?e=ktwarwic@SPEEDY.UWATERLOO.CA&l=morninggrind\n\nCable News Network. One CNN Center, Atlanta, Georgia 30303\n(c)2007 Cable News Network.\nA Time Warner Company.\nAll Rights Reserved.\n\n"}