{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "Genesearch <enews@genesearch.com.au>", "subject": "A Major Advance in Bioinformatics Power", "body": "\nYou're receiving this email because you are an existing customer of Genesearch or have downloaded our software or otherwise registered your interest. Please confirm your continued interest in receiving email from us or customise the types of products you'd like to hear about. You may unsubscribe if you no longer wish to receive our emails.\n\n\n\n\n\n\n\nBioinformatics eNewsAnnouncing a major advance in bioinformatics power\t\n\t\tGenesearch -- April 2007\n\n\n\n\n\n\n\n\n\nIn This Issue\n\n\nHigh Performance at a Fraction of the Cost\n\nAn Integrated Solution\n\nFlexible and Effective\n\nClustalW Alignments\n\n\n\n\n\n\n\n\n\nQuick Links\n\n\n\nMore on The Cell\nCLC bio\nGenesearch\n\n\n\n\n\n\n\n\n\nDear zombie gyogi,\n\n\n\n\nDid you know that BLAST is fast but misses up to 50% of matches?Would you like to perform fast and precise database searches, using Smith-Waterman at the speed of BLAST?With a CLC Bioinformatics Cell you're able to utilize the hidden computational powers in your computer or server. With the Cell you can speed up a Smith-Waterman search, previously taking two hours, to around one minute!The popular ClustalW algorithm is also included and others are on the way.\n\n\n \n\nHIgh Performance - At a Fraction of the Cost\n\n\nThe Cell includes the fastest Smith-Waterman implementation ever made on standard hardware - nucleotide searches are accelerated up to 110 times and protein searches are accelerated up to 50 times on new computers. The Cell thus removes the argument for using BLAST in situations where you search through data where you not only need some of the answers but all of the answers.With speeds approaching that of a Cluster but a fraction of the cost, The Cell gives you the best price/performance ratio available, bar none.\n\n\n\n\n\n\n\n\n\n\n \n\nAn Integrated Solution\n\n\nThe Cell is fully integrated with the most comprehensive bioinformatics desktop software applications in the market: CLC Gene Workbench, CLC Protein Workbench, and CLC Combined Workbench. The Cell thus benefits from all the features of CLC bio's workbenches such as the graphical user interface, the option of running multiple analyses in batch runs, the data storage opportunities, the graphical and tabular overview of the results, etc. Using high performance computing has never been easier or more effective.Command-line execution is also an option. This means you have the option of integrating high-performance calculations in your existing bioinformatics workflow of scripts and in-house programs.\n\n\n \n\nFlexible and Effective\n\n\nThis innovative approach to hardware-accelerated bioinformatics provides flexibility in a variety of ways: Physical\nlocation: No need for a cooled server room or new expensive hardware to\nperform high performance computing. All you need is your computer. Operating system: As long as your computer has a newer Intel or AMD processor, the Cell works on Windows, Linux & Mac OSX. Software use: The Cell can be used as an integrated part of all CLC bio's workbenches, or through a command line interface. Customisation: With CLC Developer Kit, you can create your own workflows including the functionalities of the Cell.\n\n\n\n \n\nWhat Do I Need?\n\n\nThe Cell runs on any new Windows, Mac or Linux computer with a SIMD-capable Intel or compatible chip. And if your processor has multiple cores - the more cores you have, the faster it runs.You will need a local database on your institution's network, as the Cell speeds up analyses done by your computer and so cannot affect searches done by a remote server over the internet.\n\n\n \n\nSmith-Waterman Searches\n\n\nFinding homologous DNA, RNA, or protein sequences in a database can be done in many ways. Smith-Waterman based searches are the only method that identifies all true hits, but the algorithm is very slow when working on large datasets. Most scientists therefore use the much faster BLAST search algorithm.But the speed of BLAST comes at the expense of the quality. The sensitivity of BLAST is in fact so low, that there is significant risk of missing important sequences of interest. Compared with Smith Waterman based searches, up to 50% of the search hits are thus not found using BLAST.But now with the CLC Bioinformatics Cell speeding up Smith-Waternan searches from hours to minutes, you can have the best of both worlds.\n\n\n \n\nClustalW Alignments\n\n\nClustalW is one of the most used methods for doing multiple sequence alignments. When aligning many sequences and when aligning long sequences, the speed of the algorithm is however not impressive. As ClustalW is so widely used as it is, CLC bio have implemented a SIMD-version of it in the Cell, resulting in an acceleration of 4-5 times on most computers.\n\n\n\n\n\n\n\n\n\n\n\nSo give your research a boost - contact us to discuss your needs and how we can meet them at a surprisingly low price!\nSincerely, \n\n\n\n\n\nLisa Saxby\n\t\tGenesearch\n\t\t\n\n\n\n\n\n\n\n\n\n\nForward email\n\n\n\n\nThis email was sent to ktwarwic@speedy.uwaterloo.ca, by enews@genesearch.com.au\nUpdate Profile/Email Address | Instant removal with SafeUnsubscribe™ | Privacy Policy.\n\n\nEmail Marketing by\n\n\n\nGenesearch | 14 Technology Dr | Arundel | 4214 | Australia\n\n\n\n\n"}