{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Evening HTML\" <cbsnews_weekday_evening_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nApril 19, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESA Time To Mourn\nVirginia Tech has turned away from gruesome video images of mass killer Cho Seung-Hui to mourn the victims of his shooting\n                        rampage.\n                         More...Watch: Picture Worth A Thousand Words\n• Gonzales Defends Prosecutor Firings\n                     \t\t\t\t\t| Watch• Gates In Iraq: Patience Running Out\n                     \t\t\t\t\t| Watch• Va. Tech Killer Picked On, Classmates Say\n                     \t\t\t\t\t| WatchU.S.Va. Tech Killer Picked On, Classmates Say\nFormer classmates say that long before he snapped, Virginia Tech gunman Cho Seung-Hui was picked on, pushed around and laughed\n                        at over his shyness and the strange way he talked when he was a schoolboy in the Washington suburbs. More...Watch: Package Of 'Marginal Value'\n• New Hampshire Set To OK Civil Unions• A Time To Mourn\n                     \t\t\t\t\t| Watch• Oklahoma City Marks Bombing Anniversary\n                     \t\t\t\t\t| Watch• More StoriesWorldAnti-Castro Militant Leaves U.S. Jail\nAnti-Castro Cuban militant Luis Posada Carriles has been released from federal custody and is en route to his wife's house\n                        in Miami, his lawyer said. More...\n• Palestinian Leader: BBC Reporter Is Alive• Gates In Iraq: Patience Running Out\n                     \t\t\t\t\t| Watch• Report: Children In Darfur Tortured, Raped• More StoriesPoliticsGonzales Defends Prosecutor Firings\nFighting for his job, Attorney General Alberto Gonzales told a skeptical Senate panel he played only a limited role in the\n                        firing of eight federal prosecutors. Gonzales insisted the dismissals were \"justified.\"   More...Watch: Sen. Leahy: Tell The Truth\n• Ex-N.J. Gov. McGreevey Now Teaches Ethics• N.J. Gov. Corzine Still Needs Ventilator• Wolfowitz To Offer Changes At World Bank• More StoriesHealth132M Flu Vaccine Doses Expected For Fall\nFlu vaccine manufacturers expect to have a record 132 million doses ready for the 2007-2008 flu season. Officials say even\n                        more could be available if a fifth company joins the manufacturers' ranks. More...\n• New Pet Food Worry: Contaminated Rice\n                     \t\t\t\t\t| Watch• Hormone Use Linked To Higher Cancer Risk\n                     \t\t\t\t\t| Watch• Vaccine May Help Fight Breast Cancer\n                     \t\t\t\t\t| Watch• More StoriesSciTechDead Whale Retrieved From Brooklyn Bay \nIt took two attempts, but a baby whale that died in a small Brooklyn bay after swimming aimlessly in its waters for two days\n                        was pulled out with the help of two police divers. More...\n• Could Global Warming Cause War?\n                     \t\t\t\t\t| Watch• MySpace Enters Online News Business• Report: Cars Still Beat SUVs In Safety\n                     \t\t\t\t\t| Watch• More StoriesBusinessReport: Cars Still Beat SUVs In Safety\nWhen comparing the death rates in passenger vehicles with similar weight, cars are still safer than SUVs and pickup trucks.\n                        But the insurance industry finds that SUVs and pickups are catching up with cars, due to electronic stability control.  More...Watch: Report: Cars Safer Than SUVs\n• Keeping Your Safe-Deposit Box Safe• MySpace Enters Online News Business• BlackBerry Outage Leaves Thumbs Idle• More StoriesEntertainment\"American Idol\" Says So Long, Sanjaya!\nThe reality show's unlikely star was finally voted off the show this week. More...Watch: Simon Cowell Gets Judged\n• Rock Asks Court To Weigh Paternity Claim• Lindsay Lohan: I'm Not An Addict• Trump Slings Panties At Walters• More StoriesOpinionGuns And Abortions\nCBSNews.com's Dick Meyer says those two newly-reignited arguments won't be resolved anytime soon. \"We aren't polarized,\n                        we are pluralized,\" Meyer says. More...\n• The World Turned Upside Down\n                     \t\t\t\t\t| Watch• A Hard-Won Victory For Life\n                     \t\t\t\t\t| Watch• Chipping Away At Roe v. Wade\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSThe Early Show: Classmates: Cho Saved His Words For Videos\nVirginia Tech students that knew Cho Seung-Hui say that he was quiet and odd. They knew he had troubles, but never expected\n                        to hear the terrible words that he spewed in videos sent to NBC News. More...Watch: Students Describe Shooter\n• EARLY SHOW: Story Behind Famous Virginia Tech Photo\n                     \t\t\t\t\t| Watch• EARLY SHOW: Wounded Student: I Forgive Gunman\n                     \t\t\t\t\t| Watch• EARLY SHOW: Columbine Father, Student Discuss Va. Tech\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nProfessor: 'I Knew It Was Him'In a visit to Bradley University, poet Nikki Giovanni, Cho Seung-Hui's former professor, became emotional when talking about\n                                    the tragedy on the Virginia Tech campus. WBBM's Suzanne Le Mignot reports.\nTOP VIDEOS\nRare Tiger Cubs Make Debut\nLogan's Reporter's Notebook\nCooper's Reporter's Notebook\nRapper Cam'ron On Snitching\nTracing Illegal Guns\nEye To Eye: Lucinda Roy\nCho's Manifesto Airing Debated\nFleeing The Feds\nGonzales Defends Firings\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesThe exonerated Duke lacrosse students give their first interview to Lesley Stahl, just days after all remaining charges\n                           against them were dropped. Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryThe Puppet Master:A couple is gunned down, the triggerman is known. But who was pulling the strings behind the\n                           scenes? Troy Roberts reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}