{"category": "ham", "to_address": "cc-community@lists.ibiblio.org", "from_address": "Andrew Rens <andrewrens@yahoo.com>", "subject": "Re: [cc-community] Creative-Commons Copyright for Thesis", "body": "Hi MuthiahWhat is the the agreement with your institution? Do you cede the copyright to them, or do you simply archive with them, and then they license it out.If you do not explicitly cede copyright to them then it does not matter what license they use because you can self archive elsewhere as Andres suggested IN ADDITION to archiving with them and then choose whatever license you like for this second archiving.In other words it does not matter what license they use as long as you retain the right to the work in which case you can re-license the work in as many different ways as you desire.I wouldn't recommend asking the archive whether you cede to them, but simply reading the agreement to see if it specifically says that you\n cede all rights to them, or simply what license they use.RegardsAndrew----- Original Message ----From: Andres Guadamuz <a.guadamuz@ed.ac.uk>To: cc-community@lists.ibiblio.orgSent: Friday, June 8, 2007 7:52:00 AMSubject: Re: [cc-community] Creative-Commons Copyright for ThesisIn my experience, archiving offices tend to be rather inflexible when itcomes to licensing.I have two questions:1. Do you have to archive with your institution? If this is arequirement for your graduation, then do whatever you need to do andforget about it, but choose the less restrictive option, and thenself-archive somewhere online (SSRN or with other self-archiving method).2. If you don't need to archive with them, then self-archive under a CClicence.Regards,AndresMuthiah Annamalai\n wrote:> Hello there,>> I'm a grad student at this school and I am writing my thesis.> I'm a big fan of open-[access,source,wiki] concepts, and contribute> from  time to time.>> The thesis document process at my school is generally archived at UMI.> They have 2 options either a restrictive copyright agreement, or something> like the GFDL. I wouldn't want either. I want to use a copyright agreement> that would allow non-commercial use, with attribution and free> distribution> of the document.>> The problem is, I want this copy of the document to be archived in the> UMI> repository, and I will be paying them to do it. Moreover, they get> subscription money> from libraries to access the archive. So that is how it works, now. I> pay them money> for them to make more money, and not helping me with a proper> copyright\n agreement> of my own choice (from Creative Commons ofcourse).>> I had written to the UMI but Im being  jerked around from one place to> another. My> school doesnt really care; I want the UMI to host the document in> open-access, but> under a copyright agreement of my choice.>> Any and all help is appreciated.> Thanks,> Muthu>> ------------------------------------------------------------------------>> _______________________________________________> cc-community mailing list> cc-community@lists.ibiblio.org> http://lists.ibiblio.org/mailman/listinfo/cc-community>   -- Andres GuadamuzAHRC Research Centre for Studies inIntellectual Property and Technology Law Old College, South BridgeEdinburgh, EH8 9YLTel:\n 44 (0)131 6509699Fax: 44 (0)131 6506317a.guadamuz@ed.ac.ukhttp://www.law.ed.ac.uk/ahrb/IP/IT/Medical Law LLM by Distance Learninghttp://www.law.ed.ac.uk/distancelearning/ _______________________________________________cc-community mailing listcc-community@lists.ibiblio.orghttp://lists.ibiblio.org/mailman/listinfo/cc-community\nReady for the edge of your seat? \nCheck out tonight's top picks on Yahoo! TV. \n\n"}