{"category": "spam", "to_address": "gnitpick@speedy.uwaterloo.ca", "from_address": "\"Wilda Curtis\" <pytconcurincbaq@concurinc.com>", "subject": "Obesity is dangerous, stop it", "body": "\nGet your ideal weight with this natural method\n\n\n\n\n\nAnatrim – The newest and most attracting product for weighty people is now readily available – As told on CNN\n\n\n\nDo you realize excessive body kilograms kill a plenty of people for every new year? We believe you hate the unattractive look of people like those and the low status they obviously have in modern society. \n\nMoreover, you can’t resist an assault of terrible eating habits of yours. If this sounds familiar, then we got something for your consideration!\n\n\n\n\n\nWe are proudly introduce you Anatrim, the ultimate product for the elimination of your body’s extra weight. The astonishing thing about Anatrim is it improves the quality of your life by making you eat less and giving you better mood. Here’re what people write to us about this product:\n\n\n\n\n\n\"This is outstanding! \n\n\nInstead of stuffing myself with food and watching TV constantly \n\n\nI became more interested in exercise.\n\n\n\n\n\n\n Anatrim set me on the right track.\n\n\n I feel fit as a fiddle now and there are lots of men around me!\"\n\n\n\n\n\n\nLusia R., Chicago\n\n\n\n\n\n\n\"Passive weight burning was of no help to me. I could not restrain my ravenous hunger. \n\n\nOne day I was told on Anatrim my very best friend by and I was really effected by the information.\n\n\n I had tried to take it, and my wife told me that I look very good now, 5 months later. \n\n\n27 pounds off and I keep still losing them! \n\n\nAnd you know, the bedroom thing is cool, too.\"\n\n\n\n\n\n\nSteve Burbon, Colorado\n\n\n\n\n\nAnatrim helps you to realize you got no such great need for that much food. It raises your mood up, provides you with energy, and attacks useless kilos. Great thanks to its mighty comprehensive formula!!\n\n\n\nFind out latest news on this great product now!\n\n\n\n"}