{"category": "spam", "to_address": "<faisalabad@speedy.uwaterloo.ca>", "from_address": "\"Andrew Snider\" <wdwex@absolutepoker.com>", "subject": "attire", "body": "\n\n\n\n\n\n\n\nSee Release Notes for the complete \nlist.\n4 Firewall Builder v2.\n2 has been released Firewall Builder on Windows and \nMacintosh Firewall Builder v2. Object dependencies are tracked not only when objects \nare directly used in rules, but also when they apepar there indirectly, as members \nof groups Added bulk compile and install operations. fw) but installer incorrectly \nuses name with suffix . 10 broken installer in 2.\nThis service object is only supported by compilers \nfor iptables and PF. 1\" lists new features and additions made in this \nrelease.\nRun-time AddressTable objects are only supported by \ncompilers for iptables and PF.\nCompiler is more tolerant while processing Address \nTable object with empty address file or with a file with empty lines. New function \nto compare two data files and find conflicting objects has been added. The bug has \nbeen fixed in v2. Compiler for PF creates a table and also lists all IP addresses it \nreads from the file; it uses the name of the AddressTable object for the name of the \ntable it creates. Ability to emulate terminating behavior for rules with actions \nClassify and Tag and improved shadowing detection for these rules have been added in \ncompiler for iptables.\n5-beta What is new in Firewall Builder \n2.\nPlease as usual file bugs using bug tracking tool \non SourceForge, post comments and suggestions on public forums and in our mailing \nlist What is new in Firewall Builder v2.\nThe user can create policy branches within other \nbranches.\nCompiler for PF creates a table and also lists all \nIP addresses it reads from the file; it uses the name of the AddressTable object for \nthe name of the table it creates.\nThis is especially convenient as it allows one to \ninspect the rules after failed compilation while still having compiler error on \nscreen.\n0; all registry entries are also located in \ndifferent subtrees.\n0; all registry entries are also located in \ndifferent subtrees.\nSee Release Notes for the complete list. Object \ndependencies are tracked not only when objects are directly used in rules, but also \nwhen they apepar there indirectly, as members of groups Added bulk compile and \ninstall operations. Please use latest nightly build of 2.\nBy popular request, built-in installer can now save \na copy of . 5-beta What is new in Firewall Builder 2. Confirmation dialog that is \nshown when user tries to delete an object also shows all groups and rules that use \nit. Tested using a data file with over 3000 objects) \"Where used\" menu item has been \nadded to quickly find and show all groups and firewall rules that reference given \nobject.\n"}