{"category": "spam", "to_address": "<simpsons@flax24.uwaterloo.ca>", "from_address": "\"Panos Danilakis\" <working-groups@wseas.org>", "subject": "To Prof.Dr.Tudhope from P. Danilakis   (the WSEAS Working Group on Computer Science)", "body": "(write WSEAS in the Subject, when you reply -- Open the attached file: \nwww.wseas.org/cscc.doc)\n\nDear Prof.Dr.Tudhope,\n\nTen Days until the deadline for papers' submission.\nAs you know, we had sent you an email last week\ncalling you to participate in the 11th anniversary of the WSEAS during\nthe multiconference CSCC (Circuits - Systems - Communications -\nComputers) in Crete island of Greece. Last year the event attracted\nthe interest of 1302 researchers, many of them from top, leading\nuniversities.\nSee directly:    http://wseas.org/conferences/2007/greece\n\nLast year, we received 1302 papers and from them only 600 papers were \naccepted. See the entire list of the reviewers (more than 2000) on the\nweb site of the WSEAS.  We had  also totally 60 special sessions, 15\nPlenary Lectures, 2 Banquets, 1 Welcome Cocktail, 1 Excursion, 12\nCoffee-Breaks. See please: http://worldses.org/reports/10th/\n\nUpload your paper, now, until April 30 (no other extension will be\ngiven). You can see my attached file at: www.wseas.org/cscc.doc\nSee below the Invited Plenary Speakers or on the web with many details\nfor their lectures.\n\nNew Important features of the CSCC (11th WSEAS Anniversary):\n-------------------------------------------------------\n1) A very strong and important feature is that the WSEAS is going to\ngive you a new username and password WITHOUT EXPIRY DATE for on-line\naccess in the WSEAS Conference proceedings FOR EVER.\n\n2) WSEAS has also arranged collaboration with Hindawi Publishing Corp\nhttp://www.hindawi.com and Springer Verlag, so, several papers will\nappear in Volumes of Hindawi Publishing and Springer Verlag. The\nauthors can select between WSEAS Journals, Springer Verlag Volumes and\nHindawi Publishing Company, however, this requires presentation of\nyour paper in the conference, submission of extended version after the\nconference and additional review and revision.\n\n3) Publication of the Proceedings in 3 media: hard-copy, CD, E-Library\n-------------------------------------------------------------------\n(3.1) Hard-Copy Proceedings (Book) with ISBN and ISSN indexed by the\nmajor Citation Indexes: www.worldses.org/indexes\n(3.2) CD-ROM Proceedings with pages' numbers with ISBN and ISSN\n    indexed  by the major Citation Indexes: www.worldses.org/indexes\n(3.3) E-Library:  http://www.wseas.org/online\n\nand possible:\n  (3.4) JOURNAL PUBLICATION: Authors of high - quality papers of\narchival value will be invited to send extended versions of their\npapers to the international WSEAS Journals after the conference.\nNecessary Condition is the presentation of the paper in the congress\n\n\n4) Plenary Speakers\n-------------------\nPlenary Speaker 1\nA New Look at Convexity, Duality, and Optimization\nProf. Dimitri Bertsekas, MIT (Massachusetts Institute of Technology\nLab. for Information and Decision Systems Cambridge, MA 02139, USA)\n\nPlenary Speaker 2\n Key Technologies in Next Generation Optical Networks\nby Prof. Leonid Kazovsky, Stanford University, USA\n\n\nPlenary Speaker 3\nIsland hopping with Optical Wireless: deployment and security\nby Prof. Stamatios Kartalopoulos, IEEE Fellow, University of Oklahoma,\nUSA. \n\nPlenary Speaker 4\nNovel Transform Domain Principal Component Analysis(PCA) Techniques\nand Some Applications : Facial and Automatic Target Recognition\nby Prof. Wasfy B Mikhael, IEEE Fellow, School of Electrical\nEngineering and Computer Science, University of Central Florida,\nOrlando, Florida, USA\n\n\nPlenary Speaker 5\nNon-Linear Symbolic Program Analysis for Increased Parallelization\n by Prof. Kleanthis Psarris, Department of Computer Science,\nUniversity of Texas at San Antonio, U.S.A.\n\n\nPlenary Speaker 6\nInformation Aggregation as one of the Pillars of Intelligent Systems\nby Prof. Imre J. Rudas, Institute of Intelligent Engineering Systems,\nJohn von Neumann Faculty of Informatics, Hungary.\n\n\nPlenary Speaker 7\nNumerical and Parametrical Optimisation for the Simulation of a\nTurbulent Combustion Phenomenon in a Well-Stirred Reactor in Steady\nState Conditions by Professor Vincenzo Niola, Department of Mechanical\nEngineering for Energetic, University of Naples \"Federico II\", ITALY.\n\n\nPlenary Speaker 8\nA Concurrent Modular Neural System for Pattern Recognition and its \nApplications in Biometrics and Satellite Imagery, by Prof. Victor-Emil \nNeagoe, Polytechnic University of Bucharest, Romania.\n\n\nPlenary Speaker 9\nSystem Identification with Quantized Observations\nby Prof. Le Yi Wang, Wayne State University, Detroit, USA\n\nPlenary Speaker 10\nStudy of controllability of two-order singular systems under an\nalgebraic point of view, by Prof. M. Isabel Garcia-Planas, Universitat\nPolitecnica de \nCatalunya, Spain\n\n\nPlenary Speaker 11\nPanos M. Pardalos, Center for Applied Optimization, Department of\nIndustrial and Systems Engineering, University of Florida, USA.\n\n\nPlenary Speaker 12\nProf. Jose Carlos Quadrado, Instituto Superior de Engenharia de\nLisboa, \nPortugal \n\n\nLetter from Prof. Charles A. Long,\n(Professor Emeritus,\nPresident WSEAS) for the tragedy in Virginia:\n\nhttp://www.worldses.org/letter-of-sympathy.pdf\n\nSincerely,\n\nPanos Danilakis\nWSEAS Secretariat\nwww.wseas.org\n\n\n\n\nATTENTION\n-------------------------------------------------------------------\nIf you do not want to receive messages from the \"WSEAS Working Group\non Computer Science\" any longer, send an email to:\nomikron@worldses.org  where the Subject Line must contain the command: \n\n      STOP COMPUTERS simpsons@wheat.uwaterloo.ca WSEAS\n \n (Do not include this command in the main part of your email, only in\nthe subject please)\n\n"}