{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"INA Trades\"<breanna.ayon@thecustomerfinder.com>", "subject": "(PAPT.PK) Target price of $0.85", "body": "\n\n\n(PAPT.PK) Target price of $0.85\n\n\n\n\n\n(PAPT.PK) Target price of $0.85\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nPalisades  Petroleum Corp. (Ticker: PAPT) has been rated “Speculative Buy” \n\n                              with a target  price of $0.85 by Beacon Equity Research.\n\n\n\n \n\n\n\n \nIn the report, the analyst writes, “Palisades Petroleum  Corporation (PAPT.PK) is a junior oil and gas exploring and production  company developing promising oil and gas properties in Montana, North Dakota  and South Dakota, Wyoming and Colorado. Its business plan entails financing  early-stage and advanced stage projects, then working with joint venture  partners to finance and operate the appropriate drill programs.  \n \n\n\n\n\n \nTo date, the Company has assembled several promising  early-stage oil and gas properties in Montana,  including the North Buffalo prospect in Chouteau County.  The Company has already drilled one well on this prospect, which is producing  at a rate of 283,000 cubic feet of natural gas per day, and shipping natural  gas production. Palisades believes this prospect could support up to six gas  wells, each producing up to 300,000 cubic feet of natural gas per day, and  plans further drilling activity in 2007. Its long-term plan is to explore and  develop oil and gas projects in North Dakota, South Dakota, Wyoming  and Colorado.”\n\nInvestment Highlights\n\n                          \n                          - Palisades  is already producing natural gas from its North Buffalo  prospect. The first well drilled on this property is producing 283,000 cubic  feet of natural gas per day and the Company believes additional wells could  increase daily production to 1.8 million cubic feet of natural gas per day. \n\n                          - \n                          The  North Buffalo prospect is estimated to contain  as much as four billion cubic feet of natural gas and benefits from the  presence of a nearby transportation pipeline already in place. The Company has  already hooked up the pipeline and is shipping natural gas from this property. \n\n                          - \n                          Palisades minimizes its risk by acquiring  properties that can be developed using horizontal drilling at relatively  shallow depths and working with joint venture partners. Its joint venture  partner on the North Buffalo prospect is privately-held Cline Production  Company, a local Montana  company.\n- The  Company has acquired an additional development project covering 3,900 acres of  land in Montana  and believes this prospect holds significant undeveloped reserves. .\n\n- Long-term  growth in energy demand and prices will provide Palisades  with a ready market for future production. US oil consumption is expected to  increase 34% to nearly 27.6 million barrels per day by 2025 and natural gas  consumption will rise 40% to 31 trillion cubic feet.\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n\n"}