{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "630p 6/19 Update: Undocking video thrills flight control; mystery debris assessed", "body": "\n\n\n\n\n630p 6/19 Update: Undocking video thrills flight control; mystery debris assessed\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 78\nPosted: 6:24 PM, 6/19/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-75 (06/18/07): Shuttle crew bids station colleagues farewell; computers check out, but investigation continues\n   SR-76 (06/19/07): Shuttle undocking on tap\n   SR-77 (06/19/07): Atlantis undocks from space station\n   SR-78 (06/19/07): Heat shield scan; analysts study debriw\n\n=================================\n\n6:24 PM, 6/19/07, Update: Atlantis undocks from space station (UPDATED at 6:24 p.m. with news conference; quotes and details)\n\nWith pilot Lee Archambault at the controls, the shuttle Atlantis undocked from the international space station today at 10:42 a.m. as the two spacecraft sailed high above New Guinea.\n\n\"Houston and ISS, from Atlantis, physical separation,\" radioed commander Rick Sturckow as the shuttle pulled away at a sedate tenth of a mile per hour.\n\n\"Thank you very much,\" called station commander Fyodor Yurchikhin, who followed naval tradition by ringing the ship's bell in the Destiny laboratory module. \"Atlantis departure.\"\n\n\"Thank you ISS,\" Sturckow radioed. \"Have a great remainder of your expedition 15. We'll see you back on planet Earth.\"\n\nSpectacular video from the shuttle showed the space station, now sporting two huge solar wings on each end of its main solar power truss, sailing against the black of deep space and then the myriad hues of South America, the Atlantic Ocean and Europe as the shuttle looped over and around the lab complex.\n\nLater, as Atlantis dropped behind the station and slowly pulled away, a dramatic shot from a camera looking back past the tail of the shuttle showed the space station small in the distance, its face-on solar arrays looking like the wings of a \"Star Wars\" TIE fighter.\n\nFlight controllers were thrilled.\n\n\"Today was just another great day in the space business,\" said lead Flight Director Cathy Koerner. \"I cannot be more pleased, again, with the flight control teams, all the ground teams and the crew, the performance today was outstanding. We had a picture-perfect undocking and fly-around.\n\n\"We did a complete fly-around of the international space station in its new configuration,\" Koerner said, narrating a short video. \"Here you see the space station just there, trailing behind the shuttle well after undocking and the separation burns. We refer to this as our TIE Fighter video, for those of you who are 'Star Wars' fans. Upon seeing this video, one of the managers remarked that we'd rather have a TIE Fighter than an imperial cruiser back there.\"\n\nSaid Mike Suffredini, manager of the space station program at the Johnson Space Center in Houston: \"As Cathy said, it was picture-perfect for departure and the space station finally looks symmetrical, it hasn't looked that way in a while. And we were happy to see that.\"\n\nEarlier, a camera in the shuttle's cargo bay spotted numerous sparkling objects slowly drifting across the field of view - presumably harmless pieces of ice - along with one much larger, more distinct piece of debris of some sort. It was not immediately clear whether the object was from the space station or the shuttle.\n\nIt's not unusual to see small bits of ice or debris leaving the shuttle after jarring rocket firings and Suffredini said this one was probably more of the same. But image analysts were studying the video to make sure.\n\n\"During separation, you may have noticed what looked like a white object leaving the international space station, the orbiter was quite a bit away,\" Suffredini said. \"We're off looking at that object to see if it was actually a station or a shuttle object. When we complete that review, we'll share that information with you.\"\n\nAround 5:30 p.m., Sturckow reported yet another piece of debris leaving the area of the shuttle. It was not immediately clear whether any of the sightings were related.\n\n\"Hey Kevin, we just spotted an object floating up out of the payload bay,\" he told Kevin Ford in mission control. \"And we've identified it. All over the payload bay there are little phenolic-looking, kind of tan-looking washers with four slots in them and then they've got some string that hold them on to tie down the MLI (multi-layer insulation) blankets. And one of them has come loose and departed the payload bay.\"\n\n\"OK, C.J., we copy that. Thanks for the words on that,\" Ford replied.\n\nJoining Archambault and Sturckow aboard Atlantis were flight engineer Steve Swanson, Patrick Forrester, Danny Olivas, Jim Reilly and Sunita Williams, who is returning to Earth after a record six months in space, the longest single flight by a female astronaut.\n\nShe was replaced by Clay Anderson, who hitched a ride to the station aboard Atlantis to join Yurchikhin and flight engineer Oleg Kotov.\n\n\"Godspeed, C.J.,\" Anderson radioed Sturckow as Atlantis pulled away. \"Thanks for everything.\"\n\nWorking from the aft flight deck, Archambault guided Atlantis straight away from the space station to a point directly in front of the lab complex before beginning a slow 360-degree fly-around to permit his crewmates to photograph the station and its new solar arrays.\n\n\"One of the big reasons we do this is so we can get good documentation, photo imagery of the space station as we leave it,\" Archambault said. \"At a minimum, we'll be backing out to approximately 400 feet. ... We'll do a 360-(degree trip) round the space station to get good photo imagery from all angles.\"\n\nAfter the fly-around was complete, the shuttle astronauts took a break for lunch and then used the ship's robot arm to pick up the orbiter boom sensor system, or OBSS, for a final set of nose cap and wing leading edge inspections.\n\n\"On flight day two, the scans are primarily looking for damage caused by the launch environment,\" Koerner said in a pre-flight briefing. \"Here, what we're looking for are any micrometeoroid impacts that may have occurred while we were on orbit. And again, we're trying to ensure the integrity of the thermal protection system before entry day.\"\n\nThere were no immediate signs of any problems.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}