{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "320p 4/9 Update: Soyuz docks with station", "body": "\n\n\n\n\n320p 4/9 Update: Soyuz docks with station\n\n\n\n=================================\n\nCBS NEWS Coverage of Breaking Space News\nLast Updated: 03:20 p.m., 04/09/07 (all times Eastern)\n\nBy William Harwood\nCBS News Space Consultant\n\nChanges and additions:\n\n   04/07/07 (01:00 a.m.): Next station crew, space tourist set for launch\n   04/07/07 (09:20 a.m.): Soyuz countdown/ascent timeline; Jeff Williams' account of Soyuz launch\n   04/07/07 (02:00 p.m.): Soyuz launched\n   04/09/07 (03:20 p.m.): Soyuz TMA-10 docks with space station\n\n=================================\n\n03:20 p.m., 04/09/07, Update: Soyuz docks with space station\n\nA Russian Soyuz spacecraft carrying two fresh crew members and a wealthy American space tourist docked with the international space station today to close out a two-day orbital chase. The linkup at the downward facing port of the Russian Zarya module occurred at 3:10 p.m. as the two spacecraft sailed high above Eastern Europe.\n\nOn board the Soyuz TMA-10 were spacecraft commander Oleg Kotov, Expedition 15 commander Fyodor Yurchikhin and U.S. software developer Charles Simonyi, who paid the Russians more than $20 million to become the fifth private citizen to visit the space station.\n\n\"Contact and capture, docking confirmed, at 11:10 p.m. Moscow time (3:10 p.m. EDT),\" said NASA commentator Rob Navias from the Russian mission control center. \"Docking confirmed, a perfect arrival. Soyuz TMA-10 has arrived at the international space station.\"\n\nMartha Stewart, a close friend of Simonyi who attended launch at the Baikonur Cosmodrome in Kazakhstan, was on hand at the Russian control center in Korolev for today's docking.\n\nYurchikhin and Kotov will replace Expedition 14 commander Mike Lopez-Alegria and cosmonaut Mikhail Tyurin, who were launched to the station last Sept. 18 aboard the Soyuz TMA-9 spacecraft currently docked to the aft port of the Zvezda command module.\n\nLopez-Alegria, Tyurin and Simonyi will return to Earth aboard the TMA-9 spacecraft April 20 after a 12-day handover period to familiarize the incoming cosmonauts with space station operations. Astronaut Sunita Williams, who joined the Expedition 14 crew in December after launch aboard the shuttle Discovery, will remain aboard the station with Yurchikhin and Kotov, returning to Earth aboard the shuttle Endeavour later this summer.\n\nLopez-Alegria eclipsed the American single-mission record of 196 days April 2. With landing April 20, the new record for longest time aloft on a single mission by a U.S. astronaut will stand at 214 days. Williams will beat that mark and set a new U.S. single-flight endurance record when she ultimately lands aboard Endeavour.\n\n=================================\n\nQuick-Launch Web Links:\n\nNASA ISS-14 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition14/index.html\n\nNASA ISS-15 Crew Page:\nhttp://www.nasa.gov/mission_pages/station/expeditions/expedition15/index.html\n\nCharles Simonyi:\nhttp://www.charlesinspace.com\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}