{"category": "ham", "to_address": "Debian Legal <debian-legal@lists.debian.org>", "from_address": "Iain Nicol <iain@thenicols.net>", "subject": "Re: Final text of GPL v3", "body": "(First: apologies. This message probably won't thread properly. This is\nbecause I reading this list via Usenet, but because the Usenet gateway\nis, I presume, one-way gateway, I have to reply via the list email\naddress. The trouble is my email client has no message to reply to,\nbecause it's not my NNTP client.)\n\nConcerning section 5d of the final text of the GPL 3:\n>   5. Conveying Modified Source Versions.\n[...]\n>     d) If the work has interactive user interfaces, each must display\n>     Appropriate Legal Notices; however, if the Program has interactive\n>     interfaces that do not display Appropriate Legal Notices, your\n>     work need not make them do so.\n\nFrancesco Poli worries:\n> It mandates a feature that I *must* implement in *any* interactive\n> interface of my modified work. [...] it seems that when a\n> non-interactive work is modified so that it becomes an interactive\n> work, the modifier is *compelled* to implement these features in *any*\n> newly created interactive interface.\nCould this requirement be interpreted more liberally? I'm concentrating\non the bit from \"however\". Suppose: I receive a program under the GPL 3.\nI create a new interface for the program, without the legal notices.\n\nThe license says that, when distributing my modified version, I \"need\nnot make\" interfaces of \"the Program\" that don't display a legal notice\ndisplay a legal notice. I think, then, to be exempt from the requirement\nto make user interfaces display legal notices, my modified version of\nthe Program would have to count as just \"the Program\".\n\nConsider that \"The Program\" is defined as:\n>  \"The Program\" refers to any copyrightable work licensed under this\n> License. \nWhen I convey a modified source version, 5c) requires the entire\nmodified work be licensed under the GPL. This then means that when you\nconvey a modified \"the Program\", the new bits are licensed, and so the\nwhole modified program becomes just \"the Program\". I do not need to add\nlegal notices to interfaces of \"the Program\" that lack then.\n\nI'm curious how far fetched people think this is.\n\nIf this interpretation were true, then the only burden of this section\nwould be to keep the legal notices in the user interfaces that you keep,\nbut you would *not* be required to add any notices to any user\ninterface, regardless of whether you wrote the interface or not.\n\n\n-- \nIain Nicol\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}