{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Gregory Nowak <greg@romuald.net.eu.org>", "subject": "Re: [ot] Windows programming", "body": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA1\n\nAnother option for a development environment is microsoft's windows\nservices for unix:\n\nhttp://www.microsoft.com/downloads/details.aspx?FamilyID=896C9688-601B-44F1-81A4-02878FF11778&displaylang=en\n\nIf you want to use an ide, which uses mingw as the compiler, check out\ndev-c++:\n\nhttp://www.bloodshed.net/dev/devcpp.html\n\nIt's fairly accessible with wineyes, a bit more so after I created a set\nfile and key label dictionary for it.\n\nAs for a win32 tutorial, I found:\n\nhttp://winprog.org/tutorial/\n\nto be useful. \n\nSince we're discussing this on here, does anyone know of anything for\nc/c++ that would abstract the win32 api a bit more, so it wouldn't be\nsuch a chore to program for it, making it a bit easier to write win32\napplications? Thanks.\n\nGreg\n\n\n\nOn Thu, Jun 21, 2007 at 09:49:37PM -0500, Spie Sutherland wrote:\n> The simplest windows programming environment for a linux programmer \n> is of course GNU C, which you have already mentioned. Cygwin is more \n> full functioned than MinGW but more complex and has a few quirks that \n> I really do not like, for example it's installation process is bizarre and \n> annoying, the way it maps windows directories to unix naming is weird,\n> the options for file types can be confusing, and I found that sometimes \n> its impossible to remove all of cygwin. It creates some files that just \n> cannot be deleted, I hate software that does that. On the other hand \n> it's an impressive environment, you can almost have it look exactly \n> like a linux machine.I have used Cygwin and MinGW and I have to \n> say that MinGW was simple in the way I like it. I do not like complex \n> development environments. I don't want to spend a week just to \n> figure out how to do hello world. MinGW is faster to get actually \n> programming with, and although limited in comparison, was just \n> right for my needs. It has the win32 API:\n> \n> http://www.mingw.org/docs.shtml#win32api\n> \n> I did some win32 with this and I loved it because it's GNU and very \n> straightforward. The Win32 API however is extremely complex and \n> very annoying. Surprised?  Your battle will be more one of \n> understanding the win32 API that one of tools. It can take quite a \n> while to do the simplest of things with win32. I would recommend \n> looking for some small tutorials, that's what I did and found a few \n> that got me started. Find a getting started tutorial for MinGW and \n> look for really simple win32 examples. I didn't do any win32 serial \n> code but you can most likely find some examples on the net. \n> I don't know anything about SAPI.\n> \n>   -- Spie\n> \n> _______________________________________________\n> Speakup mailing list\n> Speakup@braille.uwo.ca\n> http://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n- -- \nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n- --\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n-----BEGIN PGP SIGNATURE-----\nVersion: GnuPG v1.4.6 (GNU/Linux)\n\niD8DBQFGe0QF7s9z/XlyUyARAr9VAJ9Q4DhtxWl6bd6Qgxosh67tY8ztSACgxUEf\n2I8gFT7o1+4dP96aW6Ro3Rw=\n=xtxk\n-----END PGP SIGNATURE-----\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}