{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n  Power Delivery \n  Planning I: Getting The Basics Right\nAtlanta, GA\n  April 17-18, 2007\n  Outsourcing \n  For Utilities\nChicago, IL\n  April 17-18, 2007\n  Marketing \n  Green Power\nChicago, IL\n  April 19-20, 2007\n  Fundamentals \n  of Distribution Engineering\nAtlanta, GA\n  April 19-20, 2007\n  Sox-101 for \n  Electric, Gas and Water Utilities ... An Introduction to \n  Sarbanes-Oxley\nChicago, IL\n    April 19-20, 2007\n  3rd Annual \n  Renewable Portfolio Standards\nWestminster, CO\n    April 23-24, 2007\n  Improving \n  Utility Performance and Compliance Through Business Process \n  Management and Optimization (BPM/BPO)\nSacramento, CA\n    April 23-24, 2007\n  Maximizing Value \n  of Genco Assets in CAISO MRTU Market\nSacramento, CA\n    April 23-24, 2007\n  A Water \n  Constrained Future - How Producers Can Minimize Impacts in the West\nSan Diego, CA\n    May 1-2, 2007\n  Recognizing and \n  Recovering Energy Theft\nNashville, TN\n    May 3-4, 2007\n  Cost-Effective \n  Transmission Technology\nNashville, TN\n    May 3-4, 2007\n  Western \n  Renewable Power Development Summit\nSan Francisco, CA\n    May 7-9, 2007\n   Solar Power Project Finance & Investment Summit\nSan Diego, CA\n  May 9-11, 2007\n  Gas Mart \n  2007\nChicago, IL\n  May 9-11, 2007\n  In-Depth \n  introduction to the Natural Gas Industry\nDallas, TX\n    May 15-16, 2007\n  Natural Gas \n  Transactions, Trading and Origination for Non-Traders\nDallas, TX\n    May 16-17, 2007\n  Developing and \n  Launching New Products and Services for Utilities\nDallas, TX\n    May 17-18, 2007\n  Performance \n  Benchmarking For Energy Utilities\nSeattle, WA\n    May 23-24, 2007\n  Pandemic \n  Preparedness For Utilities\nSeattle, WA\n    May 23-24, 2007\n \n\n\n\n\n\n\n\n\n\n\nCarbon Finance & Investment Summit\n    May 22-23, 2007\n    New York, New York\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for April 25, 2007  \n\n\n\nFirst Enercast Featured Articles for April 25, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nApr 25, 2007 PowerMarketers Industry Publications\n\n\n\nBGE&#8212;Moving from AMR to MDM/AMI (UtiliPoint.com - Apr. 25, 2007) \n\n\n\nUtiliPoint.com - Apr. 25, 2007 - Baltimore Gas and Electric&#8217;s (BGE) service territory covers 2,500 square miles including the city of Baltimore and part, if not all, of ten surrounding counties.\n\n\nApr 25, 2007 PowerMarketers Industry Publications\n\n\n\nUtilities Challenge Rail System (EnergyBiz Insider - Apr. 25, 2007) \n\n\n\nEnergyBiz Insider - Apr. 25, 2007 - Legislation to curb the power of railways is clanking along.\n\n\nApr 25, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Apr. 25, 2007)\n\n\n\nNatural Gas Intelligence summudles for Apr. 25, 2007\n\n\nApr 25, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nRethink coal plant, critics urge: Environmentalists take a step toward a legal challenge of Duke Energy's plans\n\n\n\nApr. 24--Five environmental groups have asked state regulators to reconsider a decision allowing Duke Energy to build a coal-fired electric plant west of Charlotte.  The N.C. Utilities Commission in February gave Duke a partial victory in its two-year fight to expand its capacity to generate electricity. Regulators said that Duke could build an 800-megawatt coal plant at the Cliffside site near ...\n\n\nApr 24, 2007 Knight Ridder Tribune Business News\n\n\n\nTXU facing power fight\n\n\n\nApr. 25--FPL Energy, the nation's largest producer of wind-generated electricity, has told the Public Utility Commission of Texas that TXU Corp. intentionally flooded West Texas transmission lines with its own higher-cost power to prevent FPL's wind power from reaching customers across the state.  In a letter recently sent to the PUC's director of electric-industry oversight, FPL attorney David ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nBSU shows support for wind power: University will buy renewable energy credits from wind farm near Boise to cover cost of power for new dorm\n\n\n\nApr. 24--Boise State University is showing support for renewable energy by purchasing green energy credits from a local wind farm, a small step toward easing the university's dependence on power imported from outside Idaho.  The university is spending $1,500 to buy the renewable energy credits from Lewandowski Farms, which operates three wind turbines off Interstate 84 about 20 miles southeast of ...\n\n\nApr 24, 2007 Knight Ridder Tribune Business News\n\n\n\nWindmill fight goes on: Bellone sees costs, 'inaccuracies'; Kessel says plan may not be pretty, but grip on fossil fuels must loosen\n\n\n\nApr. 25--A stiff wind kicked up at Gilgo Beach in Babylon yesterday as Town Supervisor Steve Bellone took to a podium planted in the sand to launch an assault on LIPA's proposed windmill project.  Flanked by giant, tipsy photo simulations of the Long Island Power Authority's project and Babylon's own more stark depictions of the 40 turbines, Bellone declared it was time for LIPA to come clean on ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nState approves FPL plan for burying power lines, with customers paying the tab\n\n\n\nApr. 25--A proposal approved by state regulators Tuesday will allow local governments and Florida Power & Light Co. to push ahead with plans to bury more overhead power lines, with all ratepayers picking up part of the tab.  The Public Service Commission unanimously approved an FPL proposal under which the utility will pay 25 percent of the cost of burying overhead power lines while communities ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nIt will cost us all to bury FPL lines\n\n\n\nApr. 25--A proposal approved by state regulators Tuesday will allow local governments and Florida Power & Light Co. to push ahead with plans to bury more overhead power lines, with all ratepayers picking up part of the tab.  The Public Service Commission unanimously approved an FPL proposal under which the utility will pay 25 percent of the cost of burying overhead power lines while communities ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nEntergy crews to trim around power line\n\n\n\nApr. 25--Entergy Texas customers in Beaumont's West End who are served by a 23-mile long power line that originates in the Amelia substation will see contract crews trimming vegetation away from the line during the next five or six weeks.  The project began earlier this month and will help ensure service continues unimpeded for the estimated 1,200 customers served by that power line.\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\nTerry pushes hydrogen fuel cell tax credit\n\n\n\nApr. 25--WASHINGTON -- The United States should be moving much faster to reduce its dependence on fossil fuels, and one potential solution may lie in the muggy confines of the Lied Jungle at Omaha's Henry Doorly Zoo.  Hydrogen fuel cell technology provides power and heats water at the jungle, Rep. Lee Terry, R-Neb., said Tuesday at a congressional hearing. Terry is pushing a proposal that would ...\n\n\nApr 25, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nTSX Group Q1 profit up 5% to $36.4M as revenue rises 15% to $101.2M\n\n\n\nTORONTO (CP) - TSX Group Inc. (TSX:X) has reported a 15 per cent rise in first-quarter revenue and a five per cent gain in net income as expenses increased 29 per cent. The operator of the Toronto Stock Exchange, the TSX Venture Exchange and the Natural Gas Exchange said Wednesday it earned $36.4 million or 53 cents per share in the January-March period on revenue of $101.2 million.\n\n\nApr 25, 2007 Canadian Business Magazine\n\n\n\nCardin, Mikulski propose bill to shift LNG siting power to states\n\n\n\nLocal and state governments would get full veto power over proposed liquefied natural gas import terminals under legislation Maryland Democrats Benjamin Cardin and Barbara Mikulski recently introduced in the US Senate. The bill, S. 1174, would gut a part of the Energy Policy Act of 2005 that solidified the US Federal Energy Regulatory Commission's final permit authority over LNG projects.\n\n\nApr 24, 2007 Platts\n\n\n\nPromenade wind turbines installed\n\n\n\nIt is hoped Blackpool's windy coast will boost energy levelsTwo wind turbines are arriving on Blackpool's promenade on Tuesday to help power the resort's famous illuminations. They will sit on the front, close to the Sandcastle Water Park, and will be joined by a third in May. Although the turbines cost 147,000, councillors hope they will cut 13,250 off the town's annual energy bill.\n\n\nApr 24, 2007 BBC\n\n\n\nPennsylvania Utility Commission Approves Macquarie Acquisition of Duquesne Light Holdings\n\n\n\n- 1:08 p.m. PITTSBURGH (AP) - The Pennsylvania Public Utility Commission Tuesday approved the purchase of Duquesne Light Holdings Inc., the parent company of electric utility Duquesne Light, by a group of private equity firms for $1.59 billion, Duquesne said. Macquarie Infrastructure Partners, a unit of the Macquarie Group, an Australian financial company, is leading the buyout.\n\n\nApr 24, 2007 Canadian Business Magazine\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nReport: China Will Pass U.S. As Polluter\n\n\n\nReport Says China to Pass U.S. As Top Greenhouse Gas Emitter This Year The Associated Press SHANGHAI, China - China will pass the United States as the world's biggest source of greenhouse gasses this year, an official with the International Energy Agency was quoted as saying. China had been forecast to surpass the U.S. in 2010, but its sizzling economic growth has pushed the date forward, the ...\n\n\nApr 24, 2007 ABC News\n\n\n\nThe Market for Distributed & Cogeneration Power Electronics is Expected to be Worth $7.6 Billion in 2011\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c54860) has announced the addition of Worldwide Power Electronics For Distributed & Cogeneration to their offering. Distributed & Cogeneration (DCG) is gaining momentum and becoming an attractive energy option for the new millennium. Demand for power reliability combined with increasing power ...\n\n\nApr 24, 2007 Business Wire UK\n\n\n\nEnel Is Interested in Acquiring Russian Power Generators, Brentan Says\n\n\n\nItaly's Enel Interested in Russia Power Generators OGK-4, OGK-5 By Yuriy Humber and Nina de Roy April 24 (Bloomberg) -- Enel SpA, Italy's largest utility, said it will examine Russian generators OAO OGK-4 and OAO OGK-5 as potential acquisitions a month after losing out in an auction for Siberian electricity producer OAO OGK-3. ''Russia is one market that is fundamental to us based on its size and ...\n\n\nApr 24, 2007 Bloomberg\n\n\n\nChina's sun king offers energy alternatives\n\n\n\nSHANGHAI, China - Physicist Shi Zhengrong spent the 1990s in an Australian lab studying solar power, a field he picked by chance. He expected to devote his life to science.  Still, Shi saw signs of a blossoming industry as Germany, Japan and other countries invested in cleaner power. Excited by a trip home that showed him China's rapid development, he startled friends by abruptly moving his wife ...\n\n\nApr 24, 2007 Honolulu Advertiser\n\n\n\nCompanies invest billions in PNG gas industry\n\n\n\nThe Papua New Guinea gas industry has found a new player willing to invest $7 billion into commercialising the country's natural gas reserves. Liquid Niugini Gas Limited, a partnership between three international companies, submitted the multi-billion dollar proposal to the Government. PNG Prime Minister Sir Michael Somare described the project as an important step in the country's bid to become ...\n\n\nApr 24, 2007 ABC Online\n\n\n\nU.S. Criticizes Iran-European Gas Deal\n\n\n\nIrritated by the prospect of a huge European gas development deal with Iran, the Bush administration said Monday it will argue that such transactions undercut international bargaining power over Irans nuclear program. Also Monday, the State Department said it has again asked Iran for information about a missing former FBI agent. The United States says it has no information to substantiate reports ...\n\n\nApr 24, 2007 MyMotherLode.com\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}