{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "950a 6/12 Update: Solar array deploy on tap", "body": "\n\n\n\n\n950a 6/12 Update: Solar array deploy on tap\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 43\nPosted: 9:52 AM, 6/12/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-39 (06/11/07): S3/S4 bolted to station power truss\n   SR-40 (06/11/07): Spacewalk begins\n   SR-41 (06/11/07): Shuttle mission extended two days; fourth spacewalk added; blanket repair ordered\n   SR-42 (06/11/07): Spacewalk ends\n   SR-43 (06/12/07): Crew awake; solar array deploy on tap\n\n=================================\n\n9:52 AM, 6/12/07, Update: Crew awake; solar array deploy on tap\n\nThe Atlantis astronauts were awakened at 9:08 a.m. by a recording of Louis Armstrong's \"What a Wonderful World\" beamed up from mission control. The crew plans to monitor the deployment of a new set of solar arrays they attached to the international space station Monday before enjoying a few hours of off-duty time later today.\n\nThe primary goal of near-term space station assembly is building out the statoin's main solar power truss to provide the electricity needed to support European and Japanese research modules. When completed, the truss will stretch more than 300 feet from tip to tip. Two huge solar arrays on each end of the truss will track the sun as the station circles the globe, rotating and changing pitch as required to maximize electrical generation.\n\nThe P3/P4 solar array truss segment was attached to the left side of the power truss last September. The other set of left-side arrays - P6 - was installed on top of the station in 2000 to provide power during the early stages of assembly. One of P6's two wings - P6-4B - was retracted during a shuttle mission last December. The other wing - P6-2B - will be retracted this week so the entire segment can be moved later this year to the left end of the main truss.\n\nThe Atlantis astronauts installed the first right-side set of arrays - S3/S4 - on Monday and will oversee the deployment of its two wings today.\n\nGetting a head start, flight controllers sent commands overnight to open the solar array blanket boxes and to extend each solar array wing one mast bay. They will be fully extended later today, one at a time in a stepwise fashion, first to 49 percent and then to 100 percent with a half-hour gap in the middle of the sequence to permit the sun to warm up the blankets. The idea is to avoid a problem seen during the first array extensions in 2000 when blanket slats stuck together and caused problems.\n\n\"What happens is these panels tend to stick together and then as the mast is being deployed, the panels would release and they would do that fairly dynamically and you can see how there's a wave that propagates up and down the array and those panels towards the base moved quickly into the blanket box and that did cause some problems with the tensioning mechanism,\" station Flight Director Kelly Beck said of the first P6-2B extension in 2000. \"The crew had to go outside during a spacewalk and correct it.\n\n\"So the new technique is designed to avoid that dynamic motion. Basically what we do is we deploy the array about halfway out, we let it sit with sun shining on the panels so those panels can warm up and as they warm up, they tend to release. And so we'll sit there for 30 minutes and let the panels release. We'll deploy the 1A array first to the halfway point, wait 30 minutes with sun on it and then complete the deploy of that array. It will be repositioned and we'll do a small attitude maneuver to get sun directly on the 3A array. It will be deployed halfway, same sequence, wait for 30 minutes to warm the panels and then complete the deploy.\"\n\nThe S4-1A mast will be extended to 49 percent starting at 11:43 a.m. and to 100 percent beginning at 12:23 p.m. The S4-3A mast will be extended half way starting at 1:13 p.m. Final extension to 100 percent is planned for 1:53 p.m.\n\nHere is a timeline of today's activity (in EDT and mission elapsed time; includes rev. D of the NASA TV sked):\n\nEDT............DD...HH...MM...EVENT\n\n06/12/07\n09:08 AM...03...13...30...STS/ISS crew wakeup\n10:00 AM...03...14...22...NASA Video File on NTV\n10:38 AM...03...15...00...Station robot arm maneuver\n11:43 AM...03...16...05...1A mast deploy to 49 percent\n12:23 PM...03...16...45...1A mast deploy to 100 percent\n01:00 PM...03...17...22...NASA Update with Mike Griffin on NTV\n01:13 PM...03...17...35...3A mast deploy to 49 percent\n01:23 PM...03...17...45...Spacesuit swap\n01:53 PM...03...18...15...3A mast deploy to 100 percent\n02:33 PM...03...18...55...Crew meal\n03:33 PM...03...19...55...Crew off duty time (2 hours)\n05:33 PM...03...21...55...Shuttle arm moves to P6-2B viewing point\n05:58 PM...03...22...20...EVA-2: Tools configured\n06:00 PM...03...22...22...Mission status briefing on NTV\n06:03 PM...03...22...25...Station arm work site 2 translation\n07:03 PM...03...23...25...Equipment lock preps\n09:13 PM...04...01...35...CBS News crew interview on NTV\n09:33 PM...04...01...55...EVA-2: Procedures review\n10:18 PM...04...02...40...Mobile transporter moves from WS-2 to WS-3\n11:23 PM...04...03...45...EVA-2: Mask prebreathe and tool config\n\n06/13/07\n12:18 AM...04...04...40...EVA-2: Crew lock to 10.2 psi\n12:38 AM...04...05...00...ISS crew sleep begins\n01:08 AM...04...05...30...STS crew sleep begins\n\n\"Every person on the crew will have a role because there are a number of things that we’ll be watching for,\" Reilly said in a NASA interview. \"As the solar arrays unfurl, after we initiate the drive command and as these are unfurling, they basically just, as if you had folded up a piece of paper back and forth, we just basically unfurl the whole solar array in that way. But as it’s unfurling there’s a, occasionally the panels that will tend to stick a little bit because they’ve been boxed up now for quite some time; but as they unfurl they’ll start to unstick and jostle themselves a little bit, which is normal.\n\n\"But what we’ll be watching for are those that might stick a little bit harder than what we expect, and so we have what are called the tension reels, so we’ll have two of our people on the crew that are going to be watching the tension reels the whole time during the deploy. There’ll be two of the other folks that will be then counting the individual bays, because we deploy out about halfway, to about 49 percent of the deploy, and then we stop and let sun basically heat up the components so that we don’t hit a high-tension condition.\n\n\"The problem there is if we hit a high-tension condition then these tension reels could lose their tension on the wires that actually hold everything in position. If that’s the case, then we would have to go out and do an EVA so we’re going to be watching that very carefully. The ground will then leave this at 50 percent for one day-cycle, and then we come back once we hit another day pass, then we will then deploy the solar arrays out the rest of the way to the 100 percent.\n\n\"Things we'll be watching for are the tension reels, as I mentioned, but we’ll also be watching a tension bar that’s at the base of the solar panel itself, and we’ll be watching to make sure that is basically not moving until we get to the very last panels, and when we start pulling them out to final tension, then that bar at the base will actually separate about 22 inches. Those are the things that we’ll be watching for. But, for the most part, it’s really just making sure everything just deploys nominally and just in a nice, orderly sequence, nothing sticking, and nothing’s really trying to jerk too much tension on the mechanisms and the base of the solar array blanket box.\"\n\nDuring the P3/P4 attachment last September, the port-side solar alpha rotary joint was configured for operation before the extension of the two SAWs. That was because the P4 arrays had to be rotated before their cooling radiator could be deployed. That is not necessary for the S3/S4 segments, so the crew is reversing that sequence, deploying the new SAWs and radiator first before completing SARJ activation during their second spacewalk on flight day six.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}