{"category": "ham", "to_address": "Ryan Pavlik <abiryan@ryand.net>", "from_address": "Marco Pesenti Gritti <mpg@redhat.com>", "subject": "Re: [sugar] Issue: Activities do not start", "body": "Ryan Pavlik wrote:\n> Marco Pesenti Gritti wrote:\n>> Ryan Pavlik wrote:\n>>> Hello!  I've run a sugar-jhbuild, and with a work-around hack to get \n>>> around my previous problem, I can now run the sugar desktop.  \n>>> However, when I click to start an activity, it will show up in the \n>>> ring for a little while (a few seconds) then disappear, never \n>>> starting fully.  Here is a complete log of a sugar session in which \n>>> I try to start the Write activity: presumably the interesting stuff \n>>> is at the end.  (I'm on AMD64 if that makes a difference, Ubuntu \n>>> Feisty)\n>>>\n>>> I am wondering if there is anything I can do to fix this issue, or \n>>> if it is a problem in the source.  (and if so, if it's easy enough \n>>> for me to fix).  Thanks for your help!\n>>>   \n>>\n>> Can you open the developer console?\n>> If so please try to run \"sugar-activity write\" inside a terminal in \n>> the developer console and see the output.\n>>\n>> Marco\n>>\n> I tried to copy and paste, but couldn't.  I do see, however, a \n> traceback in sugar-activity, with the same error as when starting \n> sugar (signed int is greater than maximum), apparently in \n> /build/lib/python-2.4/site-packages/sugar/graphics/combobox.py.  \n> Replacing the sys.maxint there with 0x7fffffff lets the activity \n> start, but there are some visual errors - the activity does not fill \n> the entire screen but rather shows around 100-200 pixels (estimate) on \n> the right side of the activity, and about 7/8ths of the entire screen \n> below the activity.  Now when I start Sugar, a small (~100x200) box \n> appears in the upper-left corner covering some of the frame icons: I \n> presume this is the autostarting journal activity.\n\nThat's because matchbox is not starting... And I *think* it's another 64 \nbit specific bug.\n\nIt would be useful if you could try something like:\n\n[marco@localhost sugar-jhbuild]$ ./sugar-jhbuild shell\n[marco@localhost sugar-jhbuild]$ Xephyr :2 -ac &\n[1] 14232\n[marco@localhost sugar-jhbuild]$ DISPLAY=:2 matchbox-window-manager\n\nAnd report the output. Also if you get a segfault, it would be good to \nrun matchbox-window-manager under gdb and get a stack trace.\n\nThanks!\n\nMarco\n_______________________________________________\nSugar mailing list\nSugar@lists.laptop.org\nhttp://lists.laptop.org/listinfo/sugar\n\n"}