{"category": "ham", "to_address": "netflix@speedy.uwaterloo.ca", "from_address": "Netflix <info@netflix.com>", "subject": "We're Still Saving Your FREE Trial!", "body": "\nHi,There's never been a better time to try Netflix - it's FREE for two weeks!\n\t\t\t\t\t\t\t\tWe're constantly adding new titles and making them easier to find. Whether you're\n\t\t\t\t\t\t\t\ta casual watcher or a film fanatic, there's a plan for you from only $4.99 a month.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t- Your friends at Netflix\n\t\t\t\t\t\t\t\t\t\tWhat's Hot at NetflixSee the Top 25 movies in each genre. Click below to view any of these lists.Action & AdventureChildren & FamilyClassicsComedyDocumentaryDramaForeignIndependentRomanceSci-Fi & FantasyTelevisionThrillersNew Releases (Click to see more)\n\n\n\n\n\n\nIf you cannot see the images in this email, or cannot click the links, please cut and paste the links below into your browser window to receive your Free Trial offer.Learn More:http://www.netflix.com/LearnMore?mqso=80009756&Finish Signing Up:http://www.netflix.com/Signup?mqso=80009756&pkey=P1212124386911511343334111562218531&\t\nThis promotional email has been sent to you because you started but did not complete the Netflix sign-up process. If you would like to stop receiving these emails, please \tclick here to unsubscribe. Please do not reply to this email, as we are unable to respond from this address. If you need help or would like to contact us, please visit our Help Center.*Free Trial Offer: Free Trial offer expires 06/30/2007 and cannot be combined with any other offer. Limit one per household. First-time customers only. Internet access and valid payment method required to redeem offer.  Free Trial lasts for two weeks.  Netflix will begin to bill your payment method for the Netflix plan selected at sign-up at the completion of the Free Trial unless you cancel prior to the end of the Free Trial. Subscription Period: Your Netflix subscription is a month-to-month subscription cancelable at anytime. Click the \"Your Account\" button for cancellation instructions. No refunds or credits for partial monthly subscription periods. Subscription and Trial Plans: The number of DVDs out-at-a-time varies by plan. Our most popular plan, 3 DVDs out-at-a-time, is $17.99 plus any applicable tax. Delivery: One business day delivery based on more than 90% of our subscribers being within one-day postal delivery zones.  For More Details: Please visit www.netflix.com/TermsOfUse for complete terms and conditions. Netflix reserves the right to change terms and conditions at any time.\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tThis promotional message was mailed to [netflix@speedy.uwaterloo.ca] by Netflix.   SRC: NF_US_W19_D6C\n\t\t\t\t\t\t\t\t\t\t Use of the Netflix service and Web site constitutes acceptance of our Terms of Use and Privacy Policy.\n\t\t\t\t\t\t\t\t\t\t   (c)1997-2007 Netflix, Inc.  100 Winchester Circle, Los Gatos, CA 95032BK-367756620-1698"}