{"category": "spam", "to_address": "<smiles@speedy.uwaterloo.ca>", "from_address": "=?windows-1251?Q?Brooklyn      KELLY?= <smiles@speedy.uwaterloo.ca>", "subject": "=?windows-1251?Q?Employees Wanted.from 900=24 Per Week.           (from 2700=24 for busin?=\n\t=?windows-1251?Q?ess staff)?=", "body": "\nHi                            \n\nut      \n       PyramidexTrust is a Moldavian company,    well-known in the US and European markets as a provider of various services like advertising and web design, programming and software support, organization of various courses and seminars, selling goods, etc. Our business is developing very rapidly and is spreading all over the world.     Consequently we need new people to work with us to offer convenient and reliable payment methods to our clients.  Currently we are looking for part-time Payment Managers to receive payments from our sellers and buyers and to redirect them according to our instructions.      \n\n     If you make a decision to work with us, you'll have to:      -work no less than 2 hours per day           -check your e-mail box several times a day;    -open one or several bank accounts with one of well-known banks in your country;-be a legal resident in the territory of the Australia, EU or USA;   -be of maturity age(21+).    \n    We need honest and responsible people with good business acumen, who can approach the target group of clients, follow all our instructions and have a wish to earn money. No special expertise or knowledge in any specific areas is needed.    All we are looking for is you commitment to the job and readiness to make the job on time and with good quality.      \n\n     We guarantee you sufficient money to be added to your main salary,      as you will have a commission from every payment operation.      \nWe guarantee you 7%     commission from each sale/resale operation we make!(If you have a business bank account you will get 10% from each operation we make!)          All you have to do is to receive checks/wire transfers/money orders and to transfer them to other people      according to our instructions.   \n    You will enjoy working with us as you'll have a real opportunity to work as an independent contractor and to earn money right from     your virtual home office.      \n If you are interested in this offer , please visit our website: http://www.p-trustinc.com/\nRegistration: http://www.pyramidextrust.com/index-4.php\n     Our managers will contact you ASAP for instructions.Looking forward to cooperation with you,     \nPyramidexTrust Company Administration    \n\n\n\n\n\n\n\n\n\n\n\n                                  Brooklyn KELLY0032183                       \n\n"}