{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "We'll have Jackie Robinson's reflections on race and dignity from his unlikely pen pal...tonight on the CBS Evening News with Katie Couric.", "body": "\n\n\nCBSNews.com\n\n\n \n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\nQUOTE OF THE DAY\"Like so many Americans, she was \n      trying to construct a life that made sense from things she found in gift \n      shops.\" - Kurt Vonnegut \n\nDID YOU KNOW?Maurice Garin was the first Tour de France \n      winner in 1903. \n\nSATURDAY\nON 48 \n      HOURSHere's a note from Troy Roberts on \n      Saturday's 48 Hours Mystery, THE PUPPET MASTER: \"It was an attack so brazen that people in Boca Raton, \n      Florida still talk about it ten years after the fact. In October 1997, \n      31-year-old Heather Grossman and her husband, John, were fired on in their \n      car at an intersection in broad daylight. It was clearly an attempted \n      execution of a wealthy and socially prominent couple. The bullet that \n      struck John only grazed him, but another bullet severed Heather' spinal \n      cord, leaving her a quadriplegic. Today, she is still confined to a \n      wheelchair. And there is no chance of rehabilitation. Of course, the \n      question on everyone's mind was who would want to kill this attractive \n      mother of three and her second husband? Who would orchestrate and then \n      carry out this drive-by shooting... and why? In quick order investigators \n      found the shooter and three other men who confessed about their roles in \n      the scheme. They were drug addicts and petty thieves. Surprisingly, they \n      didn't know Heather Grossman or her husband. And they weren't looking to \n      rob the couple. During interrogation all four men told the same story. \n      They were given orders to kill Heather Grossman. As investigators kept \n      digging, the murder for hire plot began unraveling and all the evidence \n      seemed to lead to one conclusion. It would take nearly a decade for this \n      mystery to be resolved... and for the architect behind this devastating \n      shooting to be brought to justice. You will hear from everyone involved in \n      this explosive case... the victim, the shooter and the person who was \n      convicted for pulling the strings... in the next 48 Hours \n      Mystery.\" - Troy Roberts\n(48 Hours Mystery airs Saturday at 10pmET/9CT)\nIf you would like more information on any of these stories or the \n      broadcast, please click on the following address and e-mail us at: \n      48hours@cbsnews.com \n\nTONIGHT ON THE CBS EVENING NEWSHere is \n      an early preview of what we are planning for tonight's CBS EVENING \n      NEWS... Hi everyone. This is Harry Smith, \n      filling in for Katie. It has been nine days since Don Imus \n      made the inflammatory on-air comments about the Rutgers women's basketball \n      team and now he has been fired by CBS. His career might be in dire \n      straits, but he did get a hint of redemption from the young basketball \n      players, who have accepted his apology. Could all this fury perhaps lead \n      to a more civil tone in American media? Nancy Cordes will have the \n      story. We'll also give you an update on New Jersey Gov. Jon \n      Corzine, who was badly injured in a car crash on the Garden State Parkway \n      while en route to mediating the meeting between Imus and the women's \n      basketball team. Pakistan's president Pervez Musharraf is facing \n      his harshest criticism since 9/11 for not doing more to fight terrorism. \n      Despite that the Taliban threat seems to be growing on both sides of his \n      country's border with Afghanistan, Musharraf defends his efforts. Our \n      Chief Foreign Correspondent Lara Logan sat down with Musharraf and \n      tonight we'll share her interview with you. (And later you'll be able to \n      see the whole interview online at CBSNews.com.) Back in America, \n      Jim Axelrod will report on one of the frontrunners for the GOP \n      presidential nomination: Mitt Romney. The former Massachusetts governor \n      has worked hard to portray himself as a Washington outsider and has had \n      great success fundraising. But will voters warm up to his religion? \n      Sixty years ago this Sunday, Jackie Robinson broke baseball's \n      color barrier. Tonight, Cynthia Bowers will introduce you to a man \n      who, nearly 50 years ago, wrote letters of admiration to Jackie. What's \n      amazing: Jackie wrote back. We will share some of his correspondence with \n      you. Finally, Steve Hartman will have for Assignment \n      America the story of Arnold Blume, a man who may be the country's \n      oldest substitute teacher. I hope you'll join us and have a \n      great weekend. Harry For more information on \n      these stories, please click on the following links: Rutgers \n      Team Accepts Imus' Apology Click Here New Jersey Gov. Still \n      Critical After Crash Click Here And here's an early \n      look at one of the stories we are working on for Monday's broadcast:\nHip hop. Lyrics riddled with ugly words. We'll have an inside look \n      at who's spreading hate and who's profiting most. This story and much \n      more, Monday, on the CBS Evening News. \n      THIS WEEKEND ON THE CBS EVENING NEWS: SATURDAY \n      ON THE CBS EVENING NEWS... Thalia \n      Assuras will anchor the Saturday Edition of the CBS Evening News in New \n      York. We'll have the latest news and these stories: CHENEY \n      EXCLUSIVE: CBS News Senior Washington Correspondent Bob \n      Schieffer reports on his exclusive interview with Vice President Dick \n      Cheney. REPUBLICAN RACE: Fundraising and poll numbers \n      suggest the current field of Republican White House hopefuls are failing \n      to generate excitement among the party faithful. Joie Chen reports. \n      OLYMPIC ANNOUNCEMENT: Los Angeles and Chicago will learn if \n      they will be the United States Olympic Committee's choice to host the \n      summer games. Bill Whitaker reports on the pros and cons of hosting \n      the Olympic Games. ANTHRAX VACCINE: More soldiers are \n      refusing to be inoculated with the anthrax vaccine. Thalia Assuras \n      reports in an exclusive CBS News investigation that there are growing \n      questions about the vaccine's safety and efficacy. SUNDAY ON \n      THE CBS EVENING NEWS... Russ Mitchell \n      will anchor the Sunday Edition of the CBS Evening News in New York. \n      We'll have the latest news and these stories: GONZALES \n      HEARINGS: Attorney General Alberto Gonzales could be facing his most \n      difficult week yet as the nation's top law enforcement officer. Bill \n      Plante has a preview of the hard questions he'll face when he \n      testifies before a Congressional panel next week. SUMMER \n      VISAS: Many businesses in seaside towns and mountain resorts are \n      scrambling to find summer help. Michelle Miller reports a new \n      crackdown on visa for foreign workers may leave your favorite vacation \n      sport short-handed. WORDS: The controversy surrounding \n      CBS's dismissal of Don Imus has generated a broader discussion about the \n      language in the public discourse that can be offensive to many. Poet Maya \n      Angelou joins Russ Mitchell for a conversation on the potential \n      lasting impact of the story that has many Americans talking. If \n      you would like more information on any of these stories or the broadcast, \n      please click on the following address and e-mail us: evening@cbsnews.com \n      \n\nTONIGHT ON DAVID \n      LETTERMANDave chats with comedian Bill \n      Cosby AND actress Angela Kinsey! \n\nTOMORROW ON THE SATURDAY EARLY SHOWTracy \n      Smith and James Brown of CBS Sports' The NFL Today \n      anchor The Saturday Early Show from New \n      York. Ira Joe Fisher will bring us the weather. \n      Along with the top news of the day, we will \n      also have the following stories: WHY DIETS DON'T WORK: A new \n      study finds that for most people, dieting just doesn't work. This comes as \n      no surprise to Samantha Heller, a nutritionist with Health \n      Magazine. She will have tips that can really help you lose weight and \n      keep it off. PARENTING - SPEAK RIGHT UP: When you need to \n      talk with your child's teacher, pediatrician, principal or dean, how can \n      you get your point across confidently and effectively, and get thorough \n      answers to your questions? Clinical psychologist and EARLY \n      SHOW contributor Robin Goodman has some \n      suggestions about communicating with people in authority. \n      JACKIE ROBINSON: Jackie Robinson broke baseball's color \n      barrier when he took the field with the Brooklyn Dodgers on April 15, \n      1947, 60 years ago Sunday. On the eve of Major League Baseball's \n      celebration of that event, we will talk about Robinson and his impact on \n      the game and American life with Jonathan Eig, author of a new book called \n      Opening Day: The Story of Jackie Robinson's First Season. \n      TALKING ABOUT RACE: The Don Imus controversy once again has \n      America thinking and talking about race, language, intention and \n      forgiveness. Saturday morning, we will have a roundtable discussion with a \n      panel of experts about where America stands today in regards to race. \n      FITNESS - OUTDOOR SPORTS: Denise Brody, editor in chief of \n      Fitness Magazine will show us the cutting-edge trends and products \n      for biking, walking and running. CHEF ON A SHOESTRING: \n      Brothers Jamie and Bobby Deen traveled across the country, tasting local \n      specialties made at family-run businesses. They went home to Savannah, \n      Georgia, and compiled their favorites into a new cookbook: The Deen \n      Bros. Cookbook. They will make a three-course meal for four, on our \n      budget of $40. SECOND CUP CAFE: Jack Ingram is a \n      36-year-old Texas native who's been influenced by Tom Petty and Willie \n      Nelson. Ingram has been making music for more than a decade, but now he's \n      really starting to hit his stride. His new album, This Is It, \n      recently debuted at Number 4 on the Country Album Chart. He will join us \n      with a hot performance in our Second Cup Café. To look for \n      our fabulous recipes... Click Here If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: sat@cbsnews.com \n      \n\nHERE'S WHAT WE HAVE PLANNED FOR SUNDAY \n      MORNINGCHARLES OSGOOD ANCHORS \n      FROM NEW YORK SQUEEZED: Once a thriving middle class was \n      central to the American dream. Today, rising costs for health care, \n      retirement and the steep price of putting kids through college have put \n      the ranks of the American middle class in a vise. Sunday \n      Morning's Rita Braver reports. \n      GLASS ACT: Correspondent Martha Teichner visits the \n      New York Historical Society display of the works of Clara Driscoll and \n      other designers behind many of Louis Comfort Tiffany's most opulent glass \n      creations. LIEV SCHREIBER: Tracy Smith interviews Hollywood \n      actor Liev Schreiber -- now appearing on Broadway in the \n      critcally-acclaimed play Talk Radio. GOING... GOING... \n      GONE: Alfred Taubman made his fortune creating shopping malls around \n      the country, and later purchased the famed but floundering Sotheby's \n      Auction House in New York City. At first he was credited with reviving \n      Sotheby's, but ultimately he went to prison in connection with a price \n      fixing scandal. Anthony Mason talks with Taubman about his \n      celebrated and scandalous life. COMING HOME: The National \n      Endowment for the Arts has commissioned a book and documentary called \n      Operation Homecoming including poems, stories and essays written by \n      American soldiers and their wives. Correspondent Erin Moriarty has \n      a preview of the PBS documentary. DOG ARTIST: Bill Geist \n      takes in an art show featuring the astonishing body of work of one very \n      talented dog. If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: sundays@cbsnews.com \n\nSUNDAY ON FACE THE \n      NATION Bob Schieffer moderates...This week, Face the \n      Nation with Bob Schieffer will feature \n      an EXCLUSIVE, one-on-one interview with Vice President Dick Cheney. We'll \n      ask him about the war, politics, President Bush and Attorney General \n      Alberto Gonzales, among other issues. There will be, as always, a final \n      word. That's all on Face the Nation this \n      Sunday. \n      \nSUNDAY ON 60 MINUTESINNOCENT: \n      In their first interviews since all charges against them were dropped, the \n      three former Duke lacrosse players once charged with rape tell \n      Lesley Stahl how they feel about being exonerated. \n      IMUS: Charges of racism against ousted radio host \n      Don Imus go back years as a 60 Minutes profile on \n      him a decade ago plainly shows. Mike Wallace reports. \n      MAXIMUM SECURITY EDUCATION: Bob Simon visits a \n      prison where inmates serving long sentences have found a way to free their \n      minds through college education provided by elite Bard College. \n      \nMONDAY MORNING ON THE \n      EARLY SHOWHarry Smith, Russ \n      Mitchell and Maggie Rodriguez, of our Miami affiliate WFOR, \n      anchor THE EARLY SHOW from New York. \n      Julie Chen anchors from Los Angeles. Dave Price will bring \n      us the weather. Hannah Storm is off. Along with the top \n      news of the day, we will also have the following stories:\nHEALING THE NEW CHILDHOOD EPIDEMICS: More and more, \n      children are being diagnosed with hot-topic conditions. In fact, almost \n      half of all American children today are diagnosed with autism, ADHD, \n      allergies or asthma. What is behind these new childhood epidemics? Dr. \n      Kenneth Bock uses his latest book, Healing the New Childhood \n      Epidemics, to look into the causes of and treatments for, these \n      prevalent conditions. He will join us Monday morning to answer questions \n      every parent has about diagnosing your child. What can you do to heal the \n      ailments? We'll take a look. DUKE CASE: SHOULD THEY SUE: On \n      Sunday, the three former Duke lacrosse players once charged with rape told \n      60 MINUTES' Lesley Stahl how they \n      feel about being exonerated. We'll take a look at what they had to say and \n      speak with noted defense attorney Roy Black about the now dismissed Duke \n      sexual assault case. Should the three men now vindicated sue? PHIL \n      SPECTOR TRIAL PREVIEW: VOIR DIRE BEGINS: Jury selection begins Monday \n      morning in the murder trial of music producer Phil Spector. EARLY \n      SHOW National Correspondent Hattie \n      Kauffman will join us with a preview of the case that will soon be \n      televised gavel to gavel. WEDDING IN A WEEK: RINGS: Our \n      special series, Wedding in a Week, will show you the ultimate \n      wedding come together in just five days. The lucky couple, Lisa Mayo and \n      Stephen Wilfong, will have the help of celebrity event planner, our friend \n      Colin Cowie, to plan every detail of their fabulous wedding. The \n      pair will get married on Friday, so to get things going Monday morning, \n      Lisa and Stephen will choose a beautiful ring from three sparkling \n      options! VIDEO RESUMES: Applying for a job via video? It \n      may not be as crazy as it sounds. Video resumes are a relatively new tool, \n      but recent surveys found that a surprisingly high number of managers would \n      consider viewing them if an applicant did submit one. Video resumes could \n      be of great value in an increasingly competitive working world. CBS News \n      Technology Correspondent Daniel Sieberg will join us with the \n      latest. SHEDDING POUNDS THE SNACK FACTOR DIET WAY: Millions \n      of people may try starvation diets, or three day fasts as a quick way to \n      drop a few pounds. But skipping meals will only make you tired and cranky, \n      and not any lighter. The all-elusive secret to losing weight may, in fact, \n      be eating more. Sound too good to be true? It's not. Keri Glassman, \n      nutritionist and founder of Keribar, a snack nutrition bar company, has \n      written The Snack Factor Diet, an easy to follow tome to snacking \n      in healthy ways. Monday morning, she will join us with advice and tips \n      that you, and your waistline, will love. BOX OFFICE PLUS: MOVIE \n      RATINGS AND ADVICE FOR PARENTS: With so many movies hitting theatres \n      in the coming months, how can you know which ones are appropriate for \n      youngsters? Graphic violence, nudity, and foul language are rampant in \n      movies today and sometimes ratings like PG-13 and R hold little meaning \n      anymore. So what is a parent to do? EARLY SHOW National Correspondent Hattie Kauffman will join us with a \n      look into the letters behind the ratings. WEDDING HAIR AND \n      MAKEUP WITH DAVID EVANGELISTA: With spring just around the corner, \n      wedding season is poised to begin. And you are cordially invited to see \n      some of the hottest bridal hairstyles around! Our stylist to the stars \n      David Evangelista will join us to show our Wedding in a Week \n      bride-to-be three easy-to-do style options any of which are sure to polish \n      off her look! If you would like more information on any of these \n      stories or the broadcast, please click on the following address and e-mail \n      us: earlyshow@cbs.com \n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n    \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. \n      All Rights Reserved. \n\n"}