{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "pantheon: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Thursday, May  3, 2007\npantheon \\PAN-thee-on; -uhn\\, noun:\n1. A temple dedicated to all the gods; especially (capitalized), the building so called at Rome.\n2. The collective gods of a people; as, a goddess of the Greek pantheon.\n3. A public building commemorating and dedicated to the famous dead of a nation.\n4. A group of highly esteemed persons.\nWell into the fourteenth century the Grand Duke of Lithuania, Prince Gediminas, still put his faith in Perkunas, the god of thunder and forests, who ruled over the many other gods and goddesses in the Lithuanian pantheon. -- Yaffa Eliach, There Once Was a World\nWhat [Galileo] discovered . . . would soon do nothing less than revolutionize astronomy, change forever the way the inhabitants of this planet conceived the universe beyond it, and . . . land him in the pantheon of immortal scientists. -- William E. Burrows, This New Ocean\nArgentina had spawned its own pantheon of civic-minded historical heroes, from General Jose de San Martin, the country's liberator in the independence struggle with Spain, to Domingo Sarmiento, the crusading journalist, educator, and president who had finally wrested Argentina into the modern age as a unified republic. -- Jon Lee Anderson, Che Guevara: A Revolutionary Life\nPantheon comes from Greek pantheion, \"temple of all the gods,\" from pan-, \"all\" + theos, \"god.\"\nDictionary.com Entry and Pronunciation for pantheon\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9509403-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}