{"category": "ham", "to_address": "r-help@stat.math.ethz.ch", "from_address": "(Ted Harding) <ted.harding@nessie.mcc.ac.uk>", "subject": "Re: [R] Tools For Preparing Data For Analysis", "body": "On 10-Jun-07 02:16:46, Gabor Grothendieck wrote:\n> That can be elegantly handled in R through R's object\n> oriented programming by defining a class for the fancy input.\n> See this post:\n>   https://stat.ethz.ch/pipermail/r-help/2007-April/130912.html\n> for a simple example of that style.\n> \n> On 6/9/07, Robert Wilkins  wrote:\n>> Here are some examples of the type of data crunching you might\n>> have to do.\n>>\n>> In response to the requests by Christophe Pallier and Martin Stevens.\n>>\n>> Before I started developing Vilno, some six years ago, I had\n>> been working in the pharmaceuticals for eight years ( it's not\n>> easy to show you actual data though, because it's all confidential\n>> of course).\n\nI hadn't heard of Vilno before (except as a variant of \"Vilnius\").\nAnd it seems remarkably hard to find info about it from a Google\nsearch. The best I've come up with, searching on\n\n  vilno  data\n\nis at\n  http://www.xanga.com/datahelper\n\nThis is a blog site, apparently with postings by Robert Wilkins.\n\nAt the end of the Sunday, September 17, 2006 posting \"Tedious\ncoding at the Pharmas\" is a link:\n\n  \"I have created a new data crunching programming language.\"\n   http://www.my.opera.com/datahelper\n\nwhich appears to be totally empty. In another blog article:\n\n  \"go to the www.my.opera.com/datahelper site, go to the August 31\n   blog article, and there you will find a tarball-file to download,\n   called vilnoAUG2006package.tgz\"\n\nso again inaccessible; and a google on \"vilnoAUG2006package.tgz\"\ngives a single hit which is simply the same aricle.\n\nIn the Xanga blog there are a few examples of tasks which are\nno big deal in any programming language (and, relative to their\nsimplicity, appear a bit cumbersome in \"Vilno\"). \n\nI've not seen in the blog any instance of data transformation\nwhich could not be quite easily done in any straigthforward\nlanguage (even awk).\n\n>> Lab data can be especially messy, especially if one clinical\n>> trial allows the physicians to use different labs. So let's\n>> consider lab data.\n>> [...]\n\nThat's a fairly daunting description, though indeed not at all\nextreme for the sort of data that can arise in practice (and\nnot just in pharmaceutical investigations). But the complexity\nis in the situation, and, whatever language you use, the writing\nof the program will involve the writer getting to grips with\nthe complexity, and the complexity will be present in the code\nsimply because of the need to accomodate all the special cases,\nexceptions and faults that have to be anticipated in \"feral\" data.\n\nOnce these have been anticipated and incorporated in the code,\nthe actual transformations are again no big deal.\n\nFrankly, I haven't yet seen anything \"Vilno\" that couldn't be\naccomodated in an 'awk' program. Not that I'm advocating awk for\nuniversal use (I'm not that monolithic about it). But I'm using\nit as my favourite example of a flexible, capable, transparent\nand efficient data filtering language, as far as it goes.\n\n\nSO: where can one find out more about Vilno, to see what it may\nreally be capable of that can not be done so easily in other ways?\n\n\n(As is implicit in many comments in Robert's blog, and indeed also\nfrom many postings to this list over time and undoubtedly well\nknown to many of us in practice, a lot of the problems with data\nfiles arise at the data gathering and entry stages, where people\ncan behave as if stuffing unpaired socks and unattributed underwear\nrandomly into a drawer, and then banging it shut).\n\nBest wishes to all,\nTed.\n\n--------------------------------------------------------------------\nE-Mail: (Ted Harding) \nFax-to-email: +44 (0)870 094 0861\nDate: 10-Jun-07                                       Time: 09:28:10\n------------------------------ XFMail ------------------------------\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}