{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"maillist@michaelmoore.com\" <maillist@michaelmoore.com>", "subject": "A Letter from Michael Moore: 'Sicko' is Socko in Cannes!", "body": "\nA Letter from Michael Moore: 'Sicko' is Socko in Cannes!\n\n\nMay 23rd, 2007\n\n\nFriends,\n\n\nWell, as you may have read by now, our premiere of \"Sicko\" at the Cannes Film Festival has been an overwhelming success. The 2,000 people inside the Lumiere Theater were alternately in tears and laughing during the two-hour film -- and when it was over, they gave it a standing ovation that seemed to go on for nearly 15 minutes! Many came up to me and said (and critics seem to agree) that this is my best film yet. I don't know about that, and it seems weird to compare any of these movies in the first place. But I do feel safe in saying that I am very, very happy with this film and I can't wait to show it to you when it opens on June 29th.\n\n\nCannes is a crazy place. There are film lovers here from nearly every country in the world. And then there are the people in \"show business.\" These dark forces have virtually ruined this art form (invented by the French and nurtured to brilliance by the country I call home). There are so many bad, awful films now and less and less people are going to the movies. Many who run Hollywood believe that the American people are too stupid to enjoy a film that respects their intelligence. \n\n\nAt the press screening for \"Sicko,\" the Wall Street Journal reported that hardened reporters and critics wept. Even those who have been harsh to me in the past, or who have not agreed with my politics, were moved. Aside from my stated desire that \"Sicko\" ignite a fire for free, universal health care (and a larger wish that we, as Americans, do a better job of treating each other with a true sense of solidarity and respect), I continue to hope that I can make a contribution to the art of cinema and give people a good reason to get out of the house for a few hours. \n\n\nAt my festival press conference, the only negative word came from the Canadians. Two critics didn't like all the nice things I said about their health care system. Yes, Canadian health care has its flaws, but when I asked the two critics if they would exchange their health care cards for mine, they said \"No!\" Of course they wouldn't. Canadians live longer than we do and their infant mortality is not as high as ours. Their system is underfunded because their leaders have been trying to push for more American-style health care.\n\n\nThe rest of the week has been good and I am now on my way back to the U.S. The New York Post reported Sunday that the Bush administration, in addition to going after me for filming scenes in or near Cuba, may now go after the 9/11 rescue workers I took with me to get the medical care they were denied by our own government. I couldn't make up irony like this if I wanted to, and I will do whatever is necessary to defend the human right of these true American heroes to receive the medical attention they deserve. \n\n\nWe've also received word that the HMO and pharmaceutical industries are gearing up to fight \"Sicko.\" We received so many great whistleblower letters while we were making the movie from employees of these companies. We'd like to hear from you again! Send us the internal memos and any other plans you run across at the company copying machine or internet server. It will help to stay ahead of whatever they are up to, and it will also give us a chance for a bit of fun at the industry's expense.\n\n\nI will soon have a special section of my website devoted to \"Sicko.\" Until then, we'll move forward toward our June 29th release date. Hope to see you all there that weekend!\n\n\nYours,\nMichael Moore\nmichael@michaelmoore.com\nMichaelMoore.com\n\n\n\n---\nYou are currently subscribed to Mike's Message as: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe click on the link below:\n\nhttp://go.netatlantic.com/u?id=52827208F&l=michaelmoore\n\n\n"}