{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Michael Poole <mdpoole@troilus.org>", "subject": "Re: discussion with the FSF: GPLv3, GFDL, Nexenta", "body": "Anthony Towns writes:\n\n> I don't think that's meaningful; if I sue you in a court in Australia\n> for not complying with debootstrap's license, and they find that you've\n> infringed the license, it doesn't really matter if I'm doing that out\n> of maliciousness or a genuine. And as far as the actual effects go,\n> I'm not sure you're going to be any better off without that clause in\n> your license: if you set foot in Australia, with an Australian judgement\n> against you, there's a good chance of it being enforced; and if you don't,\n> there seems to be a practical possibility of your extradition anyway,\n> based on [0].\n\nExtradition is for criminal cases, not civil cases.  I cannot imagine\nhow a choice of venue clause would significantly either help or hurt a\ncriminal defendant.\n\nAs has been previously discussed on -legal -- several times, I might\nadd -- there are a variety of reasons that the rest your argument is\nflawed.  To summarize: Most of the expense of non-local defense\nlitigation is in advance of any court judgment on the merits.  The\ncost to dismiss a lawsuit for lack of personal jurisdiction is an\norder of magnitude (or more) less than litigating it through trial.\nIt is harder to set aside a default judgment than to dismiss a\ncomplaint for improper venue.\n\nEven if the license provides for recovery of costs and attorneys' fees\nplus interest, a successful non-local defendant has to pay significant\nout-of-pocket expenses and will probably end up in the red on the\nwhole case due to his time and money being tied up in the lawsuit\nrather than its normal use.\n\nThose are the costs of a choice-of-venue clause.  The (apparently one\nand only) benefit is that it is cheaper for the licensor to sue people\nand/or the results of lawsuits are more predictable.  Is that truly\nacceptable in a free software license?\n\nMichael Poole\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}