{"category": "spam", "to_address": "\"the00\" <the00@plg.uwaterloo.ca>", "from_address": "\"Carlo Payton\" <yjidefoe@dja.de>", "subject": "He neopit it dupo", "body": "\n\n\n\n\n\n\n\nI said: \"Number 449 Idaho Street. In the apartment of the manager. His The smile flashed like lightning and changed her whole face. The body  \"It's kind of pointless any other way. The killers wouldn't be in a hu \"So why did I leave fourteen dollars?\" Flack asked, in a tired voice, \n\"He wanted you to find out for yourself,\" I said. \"He's building your  A seductive voice said: \"You do not like me so well, do you, amigo?\" \"I hate to believe you, Mr. Marlowe,\" she said slowly. \"I'd hate for m\n\"I betcha that was why his face had that disappointed look, after they \"If you keep on with that you won't be in any condition to listen to w I laid the phone down gently on the brown blotter. He was still there, He didn't bother to answer. He gave me a steady look which may or may \n\"You could have saved a nickel. The elevator's free.\" \"What about his habits? What does he do for funвЂ” besides not smoking o We went up to the third floor in silence. We went down the corridor. N The eyes behind the rimless cheaters flashed. \"I should hope not.\"\n\"But please. That is no way to talk. This is business of a great impor \"Don't waste it on him,\" Beifus told French. \"Save it for when you tal \"Working the way you do,\" I said, \"you must be. You have to keep your  \"Oh, they couldn't scare Orrin, Mr. Marlowe,\" she said decisively. \"He\nThere was a quiet pause. Dr. Lagardie's voice was now almost unctuousl I put the telephone receiver back on its hook, glanced out in the kitc \"Not far,\" he said. \"No. Not very far. Just far enough.\" \"I'll call you,\" she said intimately. And out she went, tap, tap, tap \n\"Well, that's fine,\" I said. \"And you won't meet him now. But somebody \"You ain't so tough,\" Toad said, poking me in the stomach with a fat f \"I'm free, white and twenty-one,\" she said. \"I've seen all the approac I put Orfamay Quest's twenty hard-earned dollars in an envelope and wr\n\n"}