{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBSNews Inside Scoop <inside_scoop-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "THE CONTENTIOUS ISSUE OF IMMIGRATION REFORM....WE HAVE A DEAL!!", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video \n\n  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation \n\n\n\n\n\n\nQUOTE OF THE DAY\"A government that robs Peter to \n      pay Paul can always depend on the support of Paul.\" - George \n      Bernard Shaw \n\n\n\nDID YOU KNOW?Worker ants may live seven years and \n      the queen may live as long as 15 years. \n\n\n\nTONIGHT ON THE CBS \n      EVENING NEWSHere is an early preview of what we \n      are planning for tonight’s CBS EVENING NEWS from Anchor and Managing \n      Editor, Katie Couric… Hi everyone, This could be \n      a landmark day for immigration in the United States. Key senators from \n      both parties agreed with the White House on an immigration overhaul that \n      claims to fortify the U.S. border and quickly give legal status to the \n      millions of illegal immigrants who already live in the United States. \n      President Bush called the proposal “orderly and fair.” Sharyl \n      Attkisson will explain the plan and Sandra Hughes will look at \n      the potential political and economic ramifications. In Iraq, the \n      massive search continues for the missing U.S. soldiers from the 10th \n      Mountain Division. More than 4,000 troops were on the hunt this week, and \n      our Mark Strassmann will have a firsthand report from the area \n      that’s being searched. And to cap off our series Gotta Have It: \n      The Hard Sell to Kids, Nancy Cordes will report that Generation \n      Next is earning a new moniker: Generation Plastic. The average college \n      student graduates with more than $3,000 in credit card debt, and now \n      marketers are trying to hook kids as young as 3-years-old on spending \n      money they don’t have. We’ll wrap up tonight’s broadcast by giving \n      you a peak inside the handwritten diaries Ronald Reagan kept during his \n      eight years in the White House. What was his revelation after being shot? \n      What ailment did he warn you can catch from your kids? Join us for the \n      answers tonight. Thanks! Katie For more \n      information on these stories, please click on the following links:\nBipartisan Immigration Deal Reached Click \n      Here Census: Minority Population Tops 100M Click \n      Here And here’s a look at one of the stories we’re working \n      on for Friday’s broadcast: From picking crops in fields as a \n      migrant worker to saving lives on the operating table. You'll meet him in \n      this week's Assignment America. All that and much more, Friday, on \n      the CBS Evening News. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: evening@cbsnews.com \n\n\n\nTONIGHT ON DAVID \n      LETTERMANJoin Dave tonight on The Late Show \n      with actor Luke Wilson AND brainy kid scientists... Don't miss a Top Ten \n      List presented by Homer Simpson. Plus, musical guest Rufus Wainwright! \n      \n\n\n\nFRIDAY MORNING ON \n      THE EARLY SHOWHarry \n      Smith, Hannah Storm, Julie Chen and Russ \n      Mitchell anchor THE EARLY SHOW from New York. Dave \n      Price will bring us the weather. Along with the top news of \n      the day, we will also have the following stories: JUST ASK \n      A WOMAN. . . ABOUT BEING A MOTHER: No one ever said that motherhood \n      was easy. And as many know, being a mom means being hectic! In the third \n      part of our series, Just Ask A Woman, we’ll speak with women about \n      the challenges and the joys of motherhood. We will also learn more from \n      the authors of the book I Was A Really Good Mom Before I Had Kids, \n      an illuminating look at the craziness of being a mom. EARLY \n      SHOW Contributor Mary Lou Quinlan will join us with more. \n      MIKE MYERS IN SHREK THE THIRD: It has been almost four \n      years since we've seen Mike Myers on the big screen, but luckily we can \n      still hear him coming soon to a theatre near you. Thursday, Shrek The \n      Third hits the big screen and Myers once again supplies the voice to \n      everyone's favorite green Ogre. Friday morning, we’ll speak with Myers \n      about making the latest in the Shrek comedies. THAT’S THE WAY \n      IT IS: WALTER CRONKITE AT 90: It is the rare \"celebrity\" who is as \n      reverentially talked about by Mike Wallace and Bill Clinton as by \n      George Clooney and Robin Williams. Walter Cronkite, now 90 years of \n      age, fits that bill. The iconic newsman’s colleagues and friends will \n      celebrate his professional and personal lives in a one-hour primetime \n      special to be broadcast Friday, night on CBS. CSI BEHIND THE \n      SCENES: Another shocking season finale for powerhouse CSI. \n      Thursday night’s episode will shock fans as one of the CSI team \n      hangs on to life. And who falls victim to the \"Miniature Killer\" who has \n      been taunting the CSI team since last year? We’ll ask the cast \n      about the suspense-filled season-ender. BILL GEIST: WAY OFF THE \n      ROAD: For twenty years, Bill Geist has delivered the big news \n      from some of America's smallest towns. And, the Correspondent best known \n      for his reporting for CBS News' Sunday Morning, has often \n      taken us on quite an adventure. From flying with a paperboy pilot, to \n      challenging a watermelon champion speed eater, these exploits and many \n      more are featured in Bill's new book, Way Off The Road: The Peculiar \n      Charms of Small-Town America. Monday morning, Bill will join us for \n      more on his adventures and his latest book. SESAME STREET COMES \n      TO OUR STREET: Some special guests from Sesame Place--the nations only \n      theme park based on Sesame Street, will join us Friday morning. Our \n      favorite friend to tickle, Elmo, and Sesame Place’s newest resident, Abby \n      Cadabby will come visit our neighborhood. If you would like more \n      information on any of these stories or the broadcast, please click on the \n      following address and e-mail us: earlyshow@cbs.com \n\n\n \n\"THAT'S THE WAY IT IS: CELEBRATING CRONKITE AT 90\" FRIDAY, \n      MAY 18TH (8-9pmET/PT) The world is a very different place \n      than it was in the 1960s and '70s when one voice seemed to speak for all \n      Americans and, in so doing, to bind the nation together. That unique and \n      iconic voice was, of course, Walter Cronkite's. CBS News will celebrate \n      the legendary newsman's singular life and career in a CBS News primetime \n      special, \"THAT'S THE WAY IT IS - CELEBRATING CRONKITE AT 90,\" to be \n      broadcast Friday, May 18th (8:00-9:00 PM, ET/PT) on the CBS Television \n      Network. \n\n\n\nSATURDAY ON 48 \n      HOURSHere's a note from Producer Miguel \n      Sancho on Saturday's 48 Hours Mystery, Beyond the \n      Boardwalk: \"This report is a heartbreaker. It chronicles the \n      tragic descent of four beloved but troubled women onto the harsh streets \n      of Atlantic City, and their ultimate demise at the hands of a suspected \n      serial killer. Like any good 48 Hours Mystery episode, this \n      program provides in-depth coverage of the crime and the investigation: the \n      case is a true whodunit, replete with intriguing clues and some very \n      unusual suspects. But just as importantly, the report explores the \n      dynamics of the criminal underworld where the victims, and many young \n      women like them, found themselves trapped in a vicious cycle of \n      drug-abuse, prostitution, and violence. From a producer's \n      perspective, covering this story was an intense and harrowing experience. \n      Atlantic City is an awesome place -- in the very literal sense of \n      inspiring awe. To its great credit, Atlantic City does not pretend to be \n      Disneyland - it is an unabashed adult entertainment environment. And it \n      cannot be denied that the gaming industry has created tens of thousands of \n      jobs, and streamed countless millions of tax revenues into the state. \n      Still, when you first arrive in town, the contrast between the hulking \n      casinos and the squalor that surrounds them is a shock. Frankly the place \n      can look like a collaboration of Bukowski and Bosch. Then, as you start to \n      get a sense of how the streets operate and who the players are - the \n      not-so-hidden economy of sin-seeking tourists, drug dealers, hustlers, and \n      street-walkers - there's the thrill of gaining secret, specialized \n      knowledge. Atlantic City is, truly, one of most fascinating places I have \n      ever been, and for the journalist and the junkie alike, the action of \n      street life is an addiction all its own. But after a while, as you become \n      attached to people whose lives are so sad and hopeless, reporting becomes \n      an emotional ordeal. It is hard to wade through all the human wreckage of \n      the city's dark side without absorbing some of the suffering one \n      witnesses. After three days there, you want desperately to leave. Of \n      course once you've left you can think only about going back. It \n      may be easy for people to dismiss the murders as a story of four women who \n      succumbed to their own bad judgment and worse luck. Others may see the \n      killer as a something of an allegorical figure, a human embodiment of the \n      danger and damage of drug addiction. But if there's one thing I hope the \n      viewers remember, it is that these women, for all their problems, were \n      very real human beings. They all had families and friends who loved them. \n      They all had young children. And whatever bad choices they'd made, none of \n      them deserved this.\" - Miguel Sancho (48 \n      Hours Mystery airs Saturday at 10pmET/9CT) If you would \n      like more information on any of these stories or the broadcast, please \n      click on the following address and e-mail us at: 48hours@cbsnews.com \n\n\n \nSUNDAY \n      ON 60 \n      MINUTES\nDEEPWATER: The country is less secure and the U.S. \n      Coast Guard is in worse shape now than when it began its $24 billion \n      \"Deepwater\" refurbishment plan years ago, says a congressman overseeing \n      the maritime force. Steve Kroft reports. DUMPED ON SKID \n      ROW: Hospitals put homeless patients in a van or a taxi and drop them \n      on the city’s Skid Row, sometimes dressed in only a flimsy gown, even if \n      they're not healthy enough to fend for themselves. Anderson Cooper \n      reports on the practice known as \"hospital dumping.\" ONE LAPTOP \n      PER CHILD: MIT Prof. Nicholas Negroponte’s dream is to put a laptop \n      computer into the hands of every child as an educational aid. Lesley \n      Stahl reports on his progress in Cambodia and Brazil. \n\n\nTO SUBSCRIBEClick here to subscribe to the Inside \n      Scoop.TO UNSUBSCRIBEUnsubscribe information is included \n      in each e-mail you receive. TRANSCRIPTS AND VHS \n      TAPESFor transcripts of our CBS News broadcasts, please call \n      1-800-777-TEXT. To order VHS copies, please call \n      1-800-934-NEWSCOMMENTS Please know that we do read all \n      the e-mails that are sent to this newsletter and when appropriate, these \n      e-mails are forwarded to the each of the respective broadcasts. Email us \n      at InsideScoop@cbsnews.com. While we do try to \n      answer each e-mail, please be advised that sometimes we are just not able \n      to. Thank you. Your friends at the Scoop. \n      \n\n\n\n\nAdvertisement\n\n\n\n\n\n\nTo \n      unsubscribe or change your subscription options, click here.Contact: \n      Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, \n      NY, 10019Help \n      | Advertise | Terms \n      of Service | Privacy \n      Statement©MMVII, CBS Interactive Inc. All Rights Reserved. \n      \n"}