{"category": "ham", "to_address": "Bert Gunter <gunter.berton@gene.com>", "from_address": "Frank E Harrell Jr <f.harrell@vanderbilt.edu>", "subject": "Re: [R] \"R is not a validated software package..\"", "body": "Bert Gunter wrote:\n> Frank et. al:\n> \n> I believe this is a bit too facile. 21 CFR Part 11 does necessitate a\n> software validation **process** -- but this process does not require any\n\nFor database software and for medical devices -\n\n> particular software. Rather, it requires that those using whatever software\n> demonstrate to the FDA's satisfaction that the software does what it's\n> supposed to do appropriately. This includes a lot more than assuring, say,\n> the numerical accuracy of computations; I think it also requires\n> demonstration that the data are \"secure,\" that it is properly transferred\n> from one source to another, etc. I assume that the statistical validation of\n> R would be relatively simple, as R already has an extensive test suite, and\n> it would simply be a matter of providing that test suite info. A bit more\n> might be required, but I don't think it's such a big deal. \n> \n> I think Wensui Liu's characterization of clinical statisticians as having a\n> mentality \"related to job security\" is a canard. Although I work in\n> nonclinical, my observation is that clinical statistics is complex and\n> difficult, not only because of many challenging statistical issues, but also\n> because of the labyrinthian complexities of the regulated and extremely\n> costly environment in which they work. It is certainly a job that I could\n> not do.\n> \n> That said, probably the greatest obstacle to change from SAS is neither\n> obstinacy nor ignorance, but rather inertia: pharmaceutical companies have\n> over the decades made a huge investment in SAS infrastructure to support the\n> collection, organization, analysis, and submission of data for clinical\n> trials. To convert this to anything else would be a herculean task involving\n> huge expense, risk, and resources. R, S-Plus (and much else -- e.g. numerous\n> \"unvalidated\" data mining software packages) are routinely used by clinical\n> statisticians to better understand their data and for \"exploratory\" analyses\n> that are used to supplement official analyses (e.g. for trying to justify\n> collection of tissue samples or a pivotal study in a patient subpopulation).\n> But it is difficult for me to see how one could make a business case to\n> change clinical trial analysis software infrastructure from SAS to S-Plus,\n> SPSS, or anything else.\n\nWhat I would love to have is some efficiency estimates for SAS macro \nprogramming as done in pharma vs. using a high-level language.  My bias \nis that SAS macro programming, which costs companies more than SAS \nlicenses, is incredibly inefficient.\n\nFrank\n\n> \n> **DISCLAINMER** \n> My opinions only. They do not in any way represent the view of my company or\n> its employees.\n> \n> \n> Bert Gunter\n> Genentech Nonclinical Statistics\n> South San Francisco, CA 94404\n> 650-467-7374\n> \n> \n> -----Original Message-----\n> From: r-help-bounces@stat.math.ethz.ch\n> [mailto:r-help-bounces@stat.math.ethz.ch] On Behalf Of Frank E Harrell Jr\n> Sent: Friday, June 08, 2007 7:45 AM\n> To: Giovanni Parrinello\n> Cc: r-help@stat.math.ethz.ch\n> Subject: Re: [R] \"R is not a validated software package..\"\n> \n> Giovanni Parrinello wrote:\n>> Dear All,\n>> discussing with a statistician of a pharmaceutical company I received \n>> this answer about the statistical package that I have planned to use:\n>>\n>> As R is not a validated software package, we would like to ask if it \n>> would rather be possible for you to use SAS, SPSS or another approved \n>> statistical software system.\n>>\n>> Could someone suggest me a 'polite' answer?\n>> TIA\n>> Giovanni\n>>\n> \n> Search the archives and you'll find a LOT of responses.\n> \n> Briefly, in my view there are no requirements, just some pharma \n> companies that think there are.  FDA is required to accepted all \n> submissions, and they get some where only Excel was used, or Minitab, \n> and lots more.  There is a session on this at the upcoming R \n> International Users Meeting in Iowa in August.  The session will include \n> dicussions of federal regulation compliance for R, for those users who \n> feel that such compliance is actually needed.\n> \n> Frank\n> \n\n\n-- \nFrank E Harrell Jr   Professor and Chair           School of Medicine\n                      Department of Biostatistics   Vanderbilt University\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}