{"category": "ham", "to_address": "\"Vanessa Calmese\" <debian-laptop@lists.debian.org>", "from_address": "\"iPodSweepstakes\" <iPodSweepstakes@iPodSweepstakes.com>", "subject": "Email Alert: 402 Pod Points from iPodSweepstakes", "body": "\nWin A Free iPod From ipodsweepstakes.com\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSavings And Coupons and 4 Pod Points\nAt SavingsAndCoupons.com, you will save money and get FREE stuff! \n\nGet 4 Pod Points when you join SavingsAndCoupons.com for FREE!\n Click Here. \n\n\n4 Pod Points\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFree Information and 20 Pod Points\nEarn your degree from the comfort of your own home with a leading university.  \n\nGet 20 Pod Points just for requesting FREE information about getting a degree!  \n Click Here. \n\n\n20 Pod Points\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFree Coupon and 14 Pod Points\nInsomnia can represent a variety of different things.  No matter what the cause there are solutions.  \n\nGet 14 Pod Points just for requesting a free coupon to help relieve your sleeping disorder!\n Click Here. \n\n\n14 Pod Points\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTry Vonage For Free and 360 Pod Points\nSave lots of money on your phone service.  Vonage is a revolutionary new phone service that uses your broadband Internet connection.  Act now and you will get one month FREE! \n\nGet 360 Pod Points when you try Vonage for FREE!\n Click Here. \n\n\n360 Pod Points\n\n\n\n\n\n\n\n\n\n\n\n\n\nHurry, These Offers ExpireFriday, July 6, 2007!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n      Note: Neither iPodSweepstakes.com nor its parent company, ScotInteractive, Inc. are directly affiliated with Apple Computer, Inc. The Apple trademark, logo, and products found in this email are the property of Apple Computer, Inc. and ScotInteractive does not, in any way, claim to represent or own any of the Apple trademarks or rights. Apple Computer, Inc. does not own, endorse, or promote ScotInteractive, Inc. or iPodSweepstakes.com.\n\n \n\n\n\n\n      You have received this message as part of your iPodSweepstakes.com membership. You agreed to receive these offers by email on\n      8/16/2006 12:22:19 PM.  If this appears to be in error, or if you no longer wish to receive email from us,\n      click here or email Helpdesk@iPodSweepstakes.com and type \"unsubscribe\" in the subject line, or write to us at 945 Clint Moore Road, Boca Raton, FL 33487.\n\n\n\n\n\n\n\n\n\n\n\n\n"}