{"category": "spam", "to_address": "Kedda <kedda@flax24.uwaterloo.ca>", "from_address": "Daniel Johnson <istandout@gilanglass.com>", "subject": "Tasty Cialis", "body": "\n\nCan't have sex like you had 10 years ago? Tired with your sexual problems?\nClick here to have a nice dick\nLicensed Viagra and Cialis we are offering would improve your sexual life in few moments.\nClick here\nBest quality drugs, instant shipping worldwide, friendly support! Lowest prices on the web!\nWith best regards,\nDaniel Johnson\n \n \nEiu celikom Zavladelo potriasenie, navalilos na nee, kak mnogotonnyj kamen, i ia oshchutil, kak Sminaetsia ee volia, slovno miagkij vosk, kak temneet razum, slovno koster, Zalivaemyj silnym holodnym dozhdem. Vymyvaiushchij potok ne dal mne eto obdumat, vyrval i unes. Izmenenie planov Nekotoroe vremia vse troe molchali, ogoroshennye rasskazom malchishki Rasskazom toroplivym i emocionalno nasyshchennym, no vpolne podrobnym i poniatnym. Ia naslazhdalsia dolgozhdannym blagostnym pokoem pervozdannoj Pustoty, miagko baiukaiushchej moe ia v zabotlivyh nevidimyh lapah. \nDlia polnoj Identichnosti novogo Dosa Plamia im prishlos sdublirovat i sposobnosti k Pirokinezu, no ne mentalno, a tehnicheski. No on dal mne tak neobhodimoe vremia. Stroenie Okruzhal prostornyj priamougolnik vysokogo reshetchatogo zabora iz Metallicheskih prutev, otodvinutogo ot sten metrov na desiat. Za stolom sidel shefir. Vse bylo rasschitano do melchajshih dolej sekundy. Ty vyjdesh Pobeditelem pod etim kupolom. Dozhdalsia, Poka vygovoriatsia ostalnye, i vesko skazal slovno gvozd vbil: Ne poluchitsia. Terpenie Bigmana lopnulo. \nVse, chego on Kasalsia na poverhnosti zemli, na mnogie tysiachi shagov obrashchalos v pepel, Neosiazaemyj prah. Rycari rubilis otchaianno, Zhestoko, nasmert, no oba umelo otrazhali udary drug druga. Kliuch pochti vyshiblo, dyhanie sbilos, v viskah Besheno stuchala goriachaia krov, hotia na ataku Dosa ushlo ne bolshe neskolkih Mgnovenij. Nachnu s togo, chto Sposobnosti etogo sushchestva, po otzyvam Celitelia, prosto fantastichny. ejisuminyon WkBKUVBxRVtRVEUcRkNURVdBWFpeHFBV\n \n\n\n"}