{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"CBSNews.com Weekday Afternoon HTML\" <cbsnews_weekday_afternoon_html-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "News Summary", "body": "\n\n\nCBSNews.com\n\n\n\n\n\n\nMay 2, 2007\n\n\n                              \t\t\n                              \t\t\n                              \t  Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | Sports | Blogs | Interactives | Video\n\n\n\n                              \t\n                              \t  The Early Show | CBS Evening News | 48 Hours | 60 Minutes | The Saturday Early Show | CBS Sunday Morning | Face The Nation\n\n\n\n\n\n\nTOP STORIESStudy On Race Calls Foul On NBA Referees\nA study of NBA officiating found white referees called fouls at a greater rate against black players and black officials called\n                        fouls more often against white players, The New York Times reported. The league strongly disputed the findings. More...\n• Candy-Flavored Meth Targets New Users• Bush Demands Democrats Revise Iraq Bill\n                     \t\t\t\t\t| Watch• NASA Ponders Death, Sex On Mars MissionU.S.Candy-Flavored Meth Targets New Users\nMeth makers are combining the illicit drug Methamphetamine with sweet drinks, lollipops and more to mask its normally bitter\n                        taste and entice first-time users. \"Strawberry Quick,\" as it's called, has been found in several states. More...\n• Study On Race Calls Foul On NBA Referees• Man Charged With Running Tax-Dodger Bank• Order To Open Fire In Kent State Shooting?• More StoriesWorldIran-U.S. Meeting, On Or Off?\nIran's foreign minister says Tehran is still deciding whether he should meet face-to-face with Secretary of State Condoleezza\n                        Rice on the sidelines of an Iraq summit this week. Rice says she is \"prepared\" for such a meeting. More...\n• Israeli Leader Clinging To Power • Brit War Chief: We Underestimated Cheney• Arrest Warrants Issued For Darfur Figures• More StoriesPoliticsSounding Like Reagan Not Easy For GOP\nThe war in Iraq has left the GOP feeling gloomy and pessimistic about it's future, making it difficult for any of the party's\n                        presidential hopefuls to express the upbeat optimism Ronald Reagan was known for, The Politico reports. More...Watch: GOP Alternative Wanted\n• Bush Demands Democrats Revise Iraq Bill\n                     \t\t\t\t\t| Watch• Senate Skeptical Over Revised Spying Rules• Bush Thanks \"American Idol\" Viewers• More StoriesHealthPassive Smoke Boosts Dementia Risk\nA new study suggests that people who live with a smoker for more than 30 years are about 30 percent more likely to develop\n                        dementia than those who have never lived with a smoker. More...\n• Heart Attack Deaths In Hospitals Plummet• Candy-Flavored Meth Targets New Users• Having Soup First May Cut Calories Later• More StoriesSciTechNASA Ponders Death, Sex On Mars Mission\nWith NASA planning to land on Mars in 30 years, and with the recent discovery of the most \"Earth-like\" planet ever seen outside\n                        the solar system, the space agency has begun to ponder some of the thorny questions posed by deep space exploration. More...\n• X-Rated Internet Addiction\n                     \t\t\t\t\t| Watch• Candy-Flavored Meth Targets New Users• Which Cities Have The Dirtiest Air?• More StoriesBusinessMedia Magnate Murdoch Faces Dow Battle\nThe family that owns Dow Jones, the publisher of The Wall Street Journal and other business news services, opposes Rupert\n                        Murdoch's $5 billion offer for the company. But his bid may put the company in play for other offers. More...\n• WSJ's Take On Rupert Murdoch\n                     \t\t\t\t\t| Watch• Auto Sales Take Nosedive In April• Rolls-Royce Pulls Away From Sudan\n                     \t\t\t\t\t| Watch• More StoriesEntertainmentBritney Back On Stage\nBritney Spears has made her comeback. The rehabbed pop princess took the stage for a five-song set at San Diego's House of\n                        Blues in what is thought to be her first concert in nearly three years. More...\n• Bush Thanks \"American Idol\" Viewers• Ratzenberger Booted From Dance Floor• Birkhead Back In Kentucky With Dannielynn • More StoriesOpinionIs 60 The New 40 Or Is 40 The New 60?\nSpecial Contributor Lloyd Garver says older Americans may feel younger than ever, but they're still, well, older Americans,\n                        in a culture that prizes youth. There's really only one job open for a geezer. More...\n• Republicans For Hillary?\n                     \t\t\t\t\t| Watch• Congress Ignorant On Iraq\n                     \t\t\t\t\t| Watch• Beginning Of The End Of Roe V. Wade?\n                     \t\t\t\t\t| Watch• More StoriesCBS NEWS BROADCASTSCBS Evening News: Immigration Raids Leave Children Behind\nThe Munoz children were born in the United States, but since an illegal immigration raid swept up their parents, they've been\n                        left to fend for themselves, seeing their family only once a week, Sandra Hughes reports. More...Watch: Family Divided By Deportation\n• CBS Evening News: \"Cheese\" Takes Toll On Texas Teens\n                     \t\t\t\t\t| Watch• CBS Evening News: Fighting On The Fashion Front In Iran\n                     \t\t\t\t\t| Watch• CBS Evening News: Eye On Technology: X-Rated Internet Addiction\n                     \t\t\t\t\t| Watch\n\nAdvertisement\n                        \t\n                        \t\n                        \n\n\n\nSexless Marriage ReliefMany couples balancing life at work and at home find themselves failing to have sex. Susan McGuiness looks at one couple who\n                                    managed to bring sex back into their marriage.\nTOP VIDEOS\nDrugs Sold Online May Be Fake\nRoyal Watch On Queen's Visit\nForeign Adoption Dilemmas\nDannielynn's Homecoming \nCapitol Bob On Veto, Joe Biden\nVeto Fuels War Debate\nPaying More At The Pump\nEx-Porn Producer Speaks Out\nTreating Bipolar Kids\n All Videos\n\n\n\nINSIDE CBSNEWS.COMCouric E-Mail Sign up for a daily e-mail that tells you what our evening's broadcast will cover. Blog: Public EyeInside the news. Inside CBS. An unprecedented look inside the workings of CBS News. Check it out. Tell us what you think.CBS News VideoCBS News on YOUR schedule. WATCH the top stories of the day in full broadband quality. CBS News Video is ALWAYS FREE.\nCBS News PodcastsCBS News on the go. News, Entertainment, Tech, and more. Listen or download.The Early ShowThe latest recipes and entertainment news, plus health and lifestyle tips. All in one place. Visit The Early Show online.60 MinutesEx-CIA Chief George Tenet defends the controversial High Value Program and denies to agency uses torture. Scott Pelley\n                           reports, Sunday at 7 p.m. ET/PT.\n                        48 Hours MysteryMurder In The Fast Lane:A sister fights for justice in the murders of her brother and his wife. Bill Lagattuta\n                           reports, Saturday at 10 p.m. ET/PT.\n                        Week In PhotosSee the week's most compelling pictures.The Inside ScoopGet the Scoop about what's on CBS News this week.Daily CrosswordAre you up to the challenge? Try our daily Crossword.\n\n\n\n\nBack To Top\n\n\n\nTo unsubscribe or change your subscription options, click here.Contact: Email Administrator, CBSNews.com, 524 W. 57th St., Room 514/1, New York, NY, 10019Help | Advertise | Terms of Service | Privacy Statement©MMVII, CBS Interactive Inc. All Rights Reserved.\n               \n\n\n\n"}