{"category": "ham", "to_address": "r-packages@stat.math.ethz.ch", "from_address": "Alejandro Jara Vallejos <Alejandro.JaraVallejos@med.kuleuven.be>", "subject": "[R] [R-pkgs] DPpackage - New version", "body": "Dear List:\n\nI have uploaded version 1.0-4 of DPpackage on CRAN. Since the first  \nversion (1.0-0), I have not communicated the improvements of the  \npackage. I'll use this email to summarize its current status.\n\nThe name of the package is motivated by the Dirichlet process.  \nHowever, DPpackage tries to be a general package for Bayesian  \nnonparametric and semi-parametric data analysis. So far, the package  \nincludes models based on Dirichlet processes, Dirichlet process  \nmixtures of normals, Polya trees, and Random Bernstein polynomials. A  \nlist of current functions is given next:\n\n1) Density estimation: DPdensity (using DPM of normals), PTdensity  \n(using Mixtures of Polya Trees), and BDPdensity (using  \nBernstein-Dirichlet prior). The first two functions allow uni- and  \nmulti-variate analysis.\n\n2) Nonparametric random effects distributions in mixed effects models:\n\n    2.1) DPlmm and DPMlmm, using a DP/MDP and DPM of normals prior,  \nrespectively, for the linear mixed effects model.\n\n    2.2) DPglmm and DPMglmm, using a DP/MDP and DPM of normals prior,  \nrespectively, for generalized linear mixed effects models,  \nrespectively. The sampling(link) considered by these functions are  \nbinomial(logit,probit), poisson(log) and gamma(log).\n\n    2.3) DPolmm and DPMolmm, using a DP/MDP and DPM of normals prior,  \nrespectively, for the probit-ordinal mixed effects models.\n\n    2.4) DPrasch and FPTrasch, using a DP/MDP and finite PT/MPT  \n(mixture of Polya Trees) prior for the Rasch model with binary  \nsampling distribution, respectively.\n\n    2.5) DPraschpoisson and FPTraschpoisson. The same as before (2.4)  \nbut with a Poisson sampling.\n\n    2.6) DPmeta and DPMmeta for the random (mixed) effects  \nmeta-analysis models, using a DP/MDP and DPM of normals prior,  \nrespectively.\n\n3) Binary regression with nonparametric link:\n\n    3.1) CSDPbinary, using Newton, Czado and Chappell (1996)'s  \ncentrally standardized DP prior.\n\n    3.2) DPbinary, using the regular DP prior for the inverse of the  \nlink function.\n\n    3.3) FPTbinary, using a finite PT prior for the inverse of the  \nlink function.\n\n\n4) AFT model for interval-censored data:\n\n    4.1) DPsurvint, using a MDP prior for the baseline distribution.\n\n5) ROC curve estimation:\n\n    5.1) DProc, using DPM of normals.\n\n6) Linear model with a nonparametric for the error distribution:\n\n    6.1) PTlm, using MPT.\n\n7) DP prior elicitation:\n\n    7.1) DPelicit, using the exact and approximated formulas for the  \nmean and variance of the number of clusters given the total mass  \nparameter and the number of subjects.\n\n\nTim Hanson and Fernando Quintana have made contributions to the  \ncurrent version. I would also like to thank George Karabatsos for his  \ninput to the current status of the package and Peter Mueller for  \nactively promoting the package.\n\nVarious other improvements have been motivated by questions asked by  \nmany people around the world. I would like to thank all of them too.\n\nI welcome anyone who sends comments, suggestions, remarks, and  \nparticularly those who find bugs or mistakes in any part of the  \npackage or its documentation. DPpackage is an open source program for  \nBayesian nonparametric developments. All contributions are welcome.\n\nBest regards,\n\nAlejandro.\n\n\nDisclaimer: http://www.kuleuven.be/cwis/email_disclaimer.htm\n\n_______________________________________________\nR-packages mailing list\nR-packages@stat.math.ethz.ch\nhttps://stat.ethz.ch/mailman/listinfo/r-packages\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}