{"category": "ham", "to_address": "\"Zombie V. Warwick\" <ktwarwic@flax9.uwaterloo.ca>", "from_address": "\"IRS e-News for Small Businesses\" <sbse@lists.qai.irs.gov>", "subject": "IRS e-News for Small Businesses", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ne-News for Small Businesses                                                                      May 3, 2007\n\n\n\n\nTax Resources for Small Businesses\nSmall Business and Self-Employed One-Stop Resource\nSmall Business Forms and Pubs\nSmall Business Events\ne-File for Businesses and Self-Employed\nBusinesses with Employees\nSmall Business Products\nSelf-Employed Individuals\nS Corporations\n\nOther Resources\nFind it Fast!\nAll Forms and Pubs\nElectronic IRS\nFederal Tax Gap\nRetirement Plans\nTax Information for Charities and Other Non-Profits\nState Links\nOther Agencies\nSSA/IRS Reporter\nBack to Top\n\n\n\n\n\nIssue Number:    2007-15\nInside This Issue\n\n\nIRS Accepts More Tax Payments via Credit Card\nWhat Business Expenses Can I Deduct?\nSome Issues to Consider When Operating a Business with Your Spouse\nNew Developments in International Taxation\nRecommended Reading for Small Businesses\n\n\n\n\n\n  1.  IRS Accepts More Tax Payments via Credit Card\n\n\n\nThe IRS recently expanded the types of payments individuals and businesses can pay by phone or Internet with their credit cards.  \nBeginning this year, you can use your credit card to pay Trust Fund Recovery Penalty liabilities and the balance due on certain employment tax returns, including installment agreement payments on those liabilities.\nRelated link:\n\nPay Taxes by Credit Card \n\n\nBack to Top\n\n  2.  What Business Expenses Can I Deduct?\n\n\n\n Business expenses are the cost of carrying on a trade or business. These expenses are usually deductible if the business is operated to make a profit. \nIt is important to separate business expenses from:\n\nExpenses used to figure the cost of goods sold\nCapital Expenses\nPersonal Expenses\nOur series of Fact Sheets on the Tax Gap has additional guidance for deducting certain business expenses.\n\n\nBack to Top\n\n  3.  Some Issues to Consider When Operating a Business with Your Spouse\n\n\n\n One of the advantages of operating your own business is hiring family members. However, the employment tax requirements for family employees may vary from those that apply to other employees. \nIRS.gov offers some issues to consider when spouses operate a business together.\n\n\nBack to Top\n\n  4.  New Developments in International Taxation\n\n\n\n Operating a small business is challenging enough in the United States, but when you do business overseas, you confront another layer of complexity and regulations. \nThis IRS.gov New Developments in International Taxation page leads you through some of the regulations, certain fees, forms to use, and residency and housing issues when doing business internationally.\n\n\nBack to Top\n\n  5.  Recommended Reading for Small Businesses\n\n\n\n The IRS has a number of publications for small businesses, and this comprehensive list is a great resource. \nMost are available to browse online. All may be downloaded in Adobe PDF format and printed.\n\n\nBack to Top\n\n\nThank you for subscribing to this IRS e-mail service.\nThis message was distributed automatically from the mailing list e-News For Small Businesses. Please Do Not Reply To This Message. To unsubscribe from this list, send a blank e-mail to Unsubscribe.\n\n\n\n\n\n"}