{"category": "spam", "to_address": "<info@cnpc.com.cn>", "from_address": "China National Petroleum Corporation (CNPC) <kkbb1@bellsouth.net>", "subject": "(Cnpc Agent Needed)", "body": "9th May 2007,\n\nFROM THE DESK OF :\nMr. He Peijun\nChina National Petroleum Corporation (CNPC)\n6, Liupukang Jie, Xicheng Dist., Beijing 100724.China.\nhttp//www.cnpc.com.cn\nEmail: cnpc_beijing@yahoo.com.cn\n\nGreetings to You & Yours, \nFUNDS RETRIEVAL AGENT REQUIRED IN AMERICA AND CANADA,This mail is serving as an invitation to treat with the above named company.Over the years we have accumulated invaluable experience in our business and we are proud to claim we are second to none.We exist as a multi-national organisation with full government approval for petroleum resources and control in china and other parts of the world Our activities vary from Exploration and production,Refining and marketing,Petrochemicals,Natural gas and pipelines,Field operations and technical services,Engineering and construction,Equipment manufacturing and supply,Auxiliary services and export into the various part of Canada,America,Europe and the rest of the world.\n\nWHAT YOU NEED TO DO FOR US? \nTheinternational money transfer tax for legal entities (companies) in UK is 25%, whereas for the individual it is only 7%.There is no sense for us to work this way, while tax for international money transfer madeby a private individual is 7% .That's why we need you! We need agents to receive payment for our textiles( in money orders or Cheques) and to resend the money to us via Western Union Money Transfer.This way we will save money because of tax Increament. \nJOB DESCRIPTION? \n1. Recieve payment from Clients \n2. Cash Payments at your Bank \n3. Deduct 10% which will be your percentage/pay on Payment processed. \n4. Forward balance afer deduction of percentage/pay to any of the offices you will be contacted to send payment to(Payment is to be forwarded by Western Union MoneyTransfer). \nHOW MUCHWILL YOU EARN? \n5% from each operation! For instance: you receive 7000 Dollars, Euros or British pounds Sterling via cheques or money orders on our behalf.You will cash the money and keep 350 Dollars,Euros or Pounds (5% from 7000 Euros) for yourself! At the beginning your commission will equal 5%, though later it will increase up to 10%! \n \nADVANTAGES\nYou do not have to go out as you will work as an independent contractor right from your home / office. Your job is absolutely legal. You can earn up to 3000 Euros or $ - 4000 Euros or $ monthly depending on time you will spend for this job. \nYou do not need any capital to start.You can do the Work easily without leaving or affecting your present Job.The employees who make efforts and work hard have a strong possibility to become managers. Anyway our employees never leave us due to our excellent work condition. \n \nMAIN REQUIREMENTS \n18 years or older \nLegally capable\nResponsible \nReady to work 3-4hours per week. \nwith PC knowledge \ne-mail and internet experience (minimal) \nIf you are interested in being a FUNDS RETRIEVAL AGENT in the above location and your locality, please fill out this form below:\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\nCNPC. Funds\nRetrieval Agent Form:\nTitle ( Ms. Mr Mrs Dr ):\nFirst Name:\nSurname:\nAge:\nRelevant Experience:\nYour Company Name:\nResidential Address Not P.O.BOX Plus Your Zipcode:\nCountry:\nPhone Number:\nFax Number:\nEmail Address:\nDo you have an exclusive relationship with another china based company?YES\n/NO.Please also let us know the best time to reach you on phone especially as we\nhave a difference in time. Thank you for your time.\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n \nRespectfully Submitted,\nMr. He Peijun\nproject manager,\nCNPC Beijing.\nChina National Petroleum Corporation .All Rights Reserved. Copyright\n(c) 2003 - 2007.\n------------------------------------------------------------------------\n\n"}