{"category": "spam", "to_address": "memolink@flax9.uwaterloo.ca", "from_address": "\"Rochelle and Bethea\" <rochelle@myhealthwealthandhappiness.com>", "subject": "Memo, here's your forecast for June 11th - June 17th", "body": "\n\n\n\n\n\n\n\n\nMemo, to ensure that your weekly forecasts are delivered correctly to your inbox, please add our email address Rochelle@myhealthwealthandhappiness.com to your address book.\n \n\nNew Moon, June 14, 11:14 PM EST\n\n\n\n\n\n\n               \n\n\n\n\nDear Memo,\n\n    \"Get it fast\" – \"do it now\" – even \"lose five pounds overnight!\"  If you pay any attention to advertisements or the media, it seems like we're being bombarded with messages to speed things up, get things quickly, and find instant gratification.  So I'm not really surprised that stress seems to be playing such a major part in our lives.  We seem to be living in an environment that urges hurry and emphasizes instant solutions.  Do you find that to be true, too, Memo?\n    That's why I was so tickled to come across an \"instant solution\" that actually does work – and it helps to relieve stress!  And it involves the most basic life activity – breathing.  This little exercise can be done inconspicuously anywhere, anytime.  So, the next time you find yourself feeling anxious or tense or unable to concentrate, why not try it?  It will help you feel calmer and more grounded.\n\nHere's what you do.  Sit comfortably and start to pay attention to your breathing.  Notice how shallow or deep it is, but don't try to change the rhythm of it.\nNow, curl your fingers over your thumbs to make a fist with each hand.  Then, squeeze your thumbs firmly and hold it for a minute or so.\nWhen you do this, you'll notice that your breathing will very quickly become deeper and stronger.  As you continue the squeeze, along with the deeper breathing, you will also start to feel stronger and more centered, both mentally and physically.\nThen release your thumbs, and your breathing will return to \"normal.\"\n\n    So, Memo, for some real \"instant gratification,\" now you know what to do!\n\n                        Until next week,                            \nP.S. Don’t forget to add Rochelle@myhealthwealthandhappiness.com to your address book.  We want to make sure that you receive your weekly forecasts on time.\n\n\n\n\n                      \n\n\n\n\n\n\n\n                 \n\n\n    It's a New Moon this week, Memo, on the14h and in Gemini.  This is usually a seeding time for new ideas or projects and, with Mars still in feisty Aries making positive links to steady Saturn on the 11th and imaginative Neptune on Wednesday, it's worth jotting your ideas down and putting them somewhere safe.  But when Mercury turns retrograde on the 15th making a total of four planets in reverse motion, you will just have to accept that frustrating delays in some areas are going to be inevitable.\n\n\n\n\n\nMemo             June 11 - June 17             \n\n\n\n\n \n\n\n\n    Memo, I want you to take maximum advantage of the luck coming your way this week. From my calculations, Wednesday is going to be your lucky day for this period.  And your Lucky Numbers are 11, 15, 24, 19, 37, 49.  I hope you'll make the best of them.\n\n\n\n\n\n\n\n\n\n\n\nJune 11th for Memo\n\n\n\n\n\n\n\n\n\n\n    Let worries melt away and allow happier thoughts and hopes to replace them.  Tomorrow may bring you just what you want.  You know I believe in you, so please believe in yourself.\n\n\n\n\n\n\n\n    The pursuit of pleasure, like the pursuit of happiness, may not come to you automatically.  Like a knock at the door, it's waiting for an answer.  So, my dear, enjoy and be happy today.\n\n\n\n\n\n\n\n\n\n\n    Your duties and responsibilities take on a lighter weight.  Not only will they seem easier and more fun, you may receive some recognition from those who are looking on.\n\n\n\n\n\n\n\n    If you are already feeling some tension around your work arena, then you will need to cultivate an attitude of flexibility today.  Stick to disciplined routine, dear one.  Ignore the unwise counsel of another.\n\n\n\n\n\n\n\n\n\n\n\n\nJune 12th for Memo\n \n \n \n \n \n\n \n \n    The saying \"The more the merrier\" may apply to you today, my friend. If you are planning an event, I suggest inviting people whom you feel would add to the occasion.\n\n\n  \n \n \n    You would thoroughly enjoy a quiet evening at home with a few close friends and family members.  My dear, take time for relaxation and revitalization.  Your dreams are worth achieving, but enjoy the calm.\n\n \n \n\n \n \n\n\n\n\n    A neighbor could introduce you to a whole new circle of friends.  You may be spending more and more time with these folks as the months go by, as you share may of the same interests.\n \n \n\n \n \n\n\n    Where an important friendship is concerned, remember that today's denial could bring tomorrow's acceptance.  Nothing is lost, but rather you could be in the middle of a transformation.  Ride the tide, dear.\n \n \n \n \n\n\n    Be sure something you wish for now is what you really want. Sometimes getting what you ask for turns out to be more of a  challenge than you bargained for.\n  \n\n\n\n\n\n\n\n\nJune 13th for Memo\n\n \n \n \n \n \n \n    The simple truth can have the most profound influence today, so stick with the basic facts of the situation.  Friends can be stabilizing and calming for you at this time.\n\n\n \n\n\n \n \n    Investigating computers, technology, and gadgets may have a strong appeal to you today.  If you are on the \"information highway,\" you can find out whatever you want to know.\n\n\n \n\n \n \n    You have a real need to experience lots of different things in life and one of the ways you do this is through your friendships.  Today you may meet an interesting person through a social engagement.\n\n \n \n\n\n\n\n\n\n\n\n\nJune 14th for Memo\n  \n \n\n \n \n \n    This looks to be a fun, sociable day today, my dear. Whether you are doing the inviting, or accepting an invitation, enjoy the stimulation of friends, colleagues or community ties.\n\n\n\n\n\n \n \n    Generally, you are open to new ideas, but today, a friend's ideas may just hit you wrong.  Moods are touchy now, to say the least, and you will need to pick and choose your confrontations.  Stay goal oriented.\n\n\n \n\n \n \n    An unreliable friend could lead you down the garden path if you're not careful.  If this person proposes an idea that seems too good to be true, it probably is.  Give this brainstorm a pass.\n\n \n\n \n \n\n\n\n\n    A promise made to you can come true now.  You may have to remind someone of what they said, but this can be done gently.  You get what you need, especially if you show your gratitude.\n  \n\n \n \n\n\n    Friends may be in a mood to chat. You may be in a mood to see everyone at once.  A party-like atmosphere can erupt spontaneously and you may find yourself in the middle of it all.\n  \n\n \n\n\n\n    If you're preparing to make a long journey now, consider visiting good friends as time allows.  Cultural exchanges present new ideas that can be incorporated into your current philosophy.  Let dreams manifest.\n \n\n\n\n\n\n\n\nJune 15th for Memo\n  \n \n \n\n\n \n \n    Seeing old friends and making new ones can be very rewarding and satisfying today, my dear.  A group activity can give vital support to everyone toward fulfilling special goals.\n\n\n \n\n\n \n \n    If you feel very sentimental today but can't quite put your finger on why, I'm not at all surprised, my dear.  A nostalgic tone calls out to you like a sweet, soft song.\n\n \n\n\n \n\n\n\n\n\n    You accomplish more these days, my friend, if you stay quietly behind the scenes.  Let your unconscious mind filter through your conscious thoughts.  Pay attention to dreams and use your psychic energy.    \n\n \n \n\n\n    Tackle any self-doubts you have by telling yourself that you can do it.  Taking a good look at yourself may be scary, but you actually profit a great deal by discovering you're wonderful.\n  \n\n\n\n\n\n\n\n\nJune 16th for Memo\n  \n \n \n \n \n \n    \"Practice makes perfect\" can apply to how you feel when you are by yourself.  The quality of time spent alone can be excellent if you cherish peace and quiet, and make the most of it.\n\n\n \n \n\n \n \n    It is possible that you will hear from someone from your past now. Your coping skills are probably sharpened and you can put certain aspects of your life into perspective more easily today, my dear.\n\n\n \n \n\n \n \n    Assuming a more positive outlook on life is the key to your success. If you happen to encounter an occasional roadblock, look for creative ways to overcome it.  You can do it, my dear.\n\n \n\n \n \n\n\n\n\n\n\n\nJune 17th for Memo\n \n \n \n \n \n \n \n    If someone confides that their life is not all that they'd hoped for, I suggest you try to show them that you care and that they have the power to alter the course.\n\n\n  \n\n \n \n    Even if you don't usually remember your dreams, today could be a surprising exception, especially if you've been doing a lot of \"inner\" work in order to understand more.\n\n\n  \n\n \n \n    If you are feeling frustrated or disappointed today, look at the underlying cause.  You may need to reorganize your business structures or look for a new approach to pressing problems.\n\n \n\n \n\n\n\n\n\n\n\n\n    Memo, next week provides a good boost for accomplishing those things you've always been meaning to get around to....\n\n                       Best Regards, \n                        \n\n\n\n\n\n    If at any time you no longer wish to receive your weekly forecast, you can simply click here or send a letter to me at 167 Cherry St. PMB 292, Milford, CT 06460-3400, and I will stop emailing them to you. It's as simple as that. My only desire is to help you, Memo.\n\n"}