{"category": "ham", "to_address": "msn-list@te.verweg.com", "from_address": "msn-list-request@te.verweg.com", "subject": "MSN-list Digest, Vol 7, Issue 149", "body": "Send MSN-list mailing list submissions to\n\tmsn-list@te.verweg.com\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\nor, via email, send a message with subject or body 'help' to\n\tmsn-list-request@te.verweg.com\n\nYou can reach the person managing the list at\n\tmsn-list-owner@te.verweg.com\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of MSN-list digest...\"\n\n\narchive of the list:\nhttp://msn-list.te.verweg.com/\n.\n\n\nToday's Topics:\n\n   1. CATANIA: CARABINIERI RECUPERANO OPERE D'ARTE RUBATE\n      (Museum Security Network Mailing list)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nDate: Sun, 24 Jun 2007 06:13:03 +0200\nFrom: Museum Security Network Mailing list \nSubject: [MSN] CATANIA: CARABINIERI RECUPERANO OPERE D'ARTE RUBATE\nTo: \nMessage-ID: <002501c7b615$f5b22610$e1167230$@org>\nContent-Type: text/plain;\tcharset=\"us-ascii\"\n\nCATANIA: CARABINIERI RECUPERANO OPERE D'ARTE RUBATE  \n  \nCATANIA (ITALPRESS) - I carabinieri del nucleo operativo della Compagnia di\nCatania Piazza Dante hanno trovato all'interno di un furgone, risultato\nrubato, 27 dipinti, tutti olio su tela, risalenti ad un'epoca compresa tra\nla prima meta' del '500 e la seconda meta' dell'800; 80 argenti antichi di\nvarie epoche, il piu' antico risalente ai primi del XIII secolo, 24 oggetti\nd'arte sacra risalenti ad un'epoca compresa tra la prima meta' del '500 e la\nseconda meta' dell'800, la maggior parte create da maestranze messinesi (le\npiu' preziose) e francesi. Tutte le opere erano state rubate nei primi\ngiorni del mese di maggio a Catania ad un collezionista privato. Il successo\ndell'operazione, secondo gli investigatori, e' da ascrivere al tempestivo e\ncompleto inserimento delle immagini dei pezzi trafugati all'interno della\nBanca Dati delle opere d'arte rubate. Infatti il collezionista, dopo il\nfurto, si era presentato presso gli uffici della stazione carabinieri per\nsporgere denuncia e portando con se tutte le foto delle opere che aveva\npreventivamente catalogato. Queste sono state immediatamente inserite\nall'interno del database dagli specialisti di Palermo. La Banca dati delle\nopere d'arte rubate interamente gestita dai carabinieri del Comando Tutela\nPatrimonio Culturale di Roma, considerata la piu' grande del genere al\nmondo, contiene infatti circa 2 milioni e 600 mila inserimenti, s facilmente\nconsultabile da chiunque al sito www.carabinieri.it e consente di\nindividuare immediatamente un'opera rubata attraverso la riproduzione\nfotografica cosi' rendendo difficoltoso ogni tentativo di ricettazione. Le\nopere recuperate, considerate di rilevante importanza storico artistico,\nsaranno studiate e catalogate dalla Sovrintendenza ai Beni Culturali di\nCatania con l'ausilio dei Carabinieri del Nucleo Tutela Patrimonio Culturale\ne quindi restituite al legittimo proprietario. (ITALPRESS). 23-Giu-07 16:24\nNNNN  \n\nhttp://www.siciliaonline.it/\n\n\n\n------------------------------\n\n_______________________________________________\nMSN-list mailing list\nMSN-list@te.verweg.com\nhttp://duvel.te.verweg.com/cgi-bin/mailman/listinfo/msn-list\n\n\nEnd of MSN-list Digest, Vol 7, Issue 149\n****************************************\n\n"}