{"category": "ham", "to_address": "debian-legal@lists.debian.org", "from_address": "Steve Langasek <vorlon@debian.org>", "subject": "Re: Final text of GPL v3", "body": "On Sat, Jun 30, 2007 at 01:05:21AM +0200, Francesco Poli wrote:\n> [...]\n> >   3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n> [...]\n> >   When you convey a covered work, you waive any legal power to forbid\n> > circumvention of technological measures to the extent such\n> > circumvention is effected by exercising rights under this License with\n> > respect to the covered work,\n\n> This clause is troublesome, as it seems to be overreaching.  For\n> instance, it could be interpreted as covering legal powers to forbid\n> \"computer crimes\" such as unauthorized intrusion into computer systems.\n\n\"you cannot forbid circumvention of technological measures\" is not the same\nthing as \"you cannot seek recourse under the law if the user commits a crime\nagainst you using the work\".\n\n> E.g.: suppose that the covered work is a vulnerability scanner, or\n> password cracker, or anyway a tool that could be used (among other\n> things) to break into other people's computers.  Using that tool in this\n> manner is exercising a right \"under this License\" and is a circumvention\n> of appropriate technological measures set to protect a computer system\n> or network from unauthorized access.  Gaining unauthorized access to a\n> protected computer system or network is forbidden by law in several\n> jurisdictions; do I waive such a legal protection, when I convey the\n> covered work?\n\nNo, because that's criminal trespass, which is distinct from the\n\"circumvention of technological measures\" which is being waived.\n\n> [...]\n> >   5. Conveying Modified Source Versions.\n> [...]\n> >     d) If the work has interactive user interfaces, each must display\n> >     Appropriate Legal Notices; however, if the Program has interactive\n> >     interfaces that do not display Appropriate Legal Notices, your\n> >     work need not make them do so.\n\n> Clause 5d is definitely worse than the corresponding clause 2c in GPLv2.\n\nNo, it's different from GPLv2 2c only in that it's extended to \"interactive\nuser interfaces\" instead of just programs that \"read commands interactively\nwhen run\".\n\n> What is more awkward is that it seems that when a non-interactive work is\n> modified so that it becomes an interactive work, the modifier is\n> *compelled* to implement these features in *any* newly created interactive\n> interface.\n\nWelcome to 1991.\n\n> This clause is very close to fail DFSG#3.\n> Hence, this is possibly a Freeness issue.\n\nIt's absurd to say that this requirement is permissible in the GPLv2 but not\nin the GPLv3.\n\n> This clause could be not enough to protect recipients from patent\n> lawsuits, and thus make the work fail several DFSG, when there are\n> actively enforced patents infringed by the work.\n\nUm, no.  The DFSG does not require indemnification against third-party\nclaims; an actively-enforced patent may require us to *not distribute the\nwork at all*, but that's not a question of DFSG-freeness of the work.\n\n> [...]\n> >   A patent license is \"discriminatory\" if it does not include within\n> > the scope of its coverage, prohibits the exercise of, or is\n> > conditioned on the non-exercise of one or more of the rights that are\n> > specifically granted under this License.  You may not convey a covered\n> > work if you are a party to an arrangement with a third party that is\n> > in the business of distributing software, under which you make payment\n> > to the third party based on the extent of your activity of conveying\n> > the work, and under which the third party grants, to any of the\n> > parties who would receive the covered work from you, a discriminatory\n> > patent license (a) in connection with copies of the covered work\n> > conveyed by you (or copies made from those copies), or (b) primarily\n> > for and in connection with specific products or compilations that\n> > contain the covered work, unless you entered into that arrangement,\n> > or that patent license was granted, prior to 28 March 2007.\n\n> This clause fails to protect recipients from patent lawsuits, whenever\n> the related \"discriminatory\" patent license was granted, or the related\n> nasty arrangement was in place, prior to 28 March 2007.  In those cases,\n> the work fails several DFSG\n\nUm, no, it doesn't.\n\n-- \nSteve Langasek                   Give me a lever long enough and a Free OS\nDebian Developer                   to set it on, and I can move the world.\nvorlon@debian.org                                   http://www.debian.org/\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}