{"category": "ham", "to_address": "\"John Fox\" <jfox@mcmaster.ca>", "from_address": "Tim Hesterberg <timh@insightful.com>", "subject": "Re: [R] Weighted least squares", "body": "As John noted, there are different kinds of weights, and \ndifferent terminology:\n* inverse-variance weights (accuracy weights)\n* case weights (frequencies, counts)\n* sampling weights (selection probability weights)\n\nI'll add:\n* inverse-variance weights, where var(y for observation) = 1/weight\n  (as opposed to just being inversely proportional to the weight)\n* weights used as part of an algorithm (e.g. for robust estimation,\n  or glm's using iteratively-reweighted least-squares).\n\nFor linear regression, the type of weights don't affect regression\ncoefficient calculation, but do affect inferences such as standard errors\nfor the regression coefficients, degrees of freedom for variance\nestimates, etc.  \n\nlm() inferences assume the first type.  \nOther formulae are appropriate for inferences for types 2-4.\nCombinations of types 1-4 require other formulae; this gets nontrivial.\nFor the 5th type, inferences need to be handled by the algorithm that\nis using weighted linear regression.\n\nTim Hesterberg\n\nJohn Fox wrote:\n>I think that the problem is that the term \"weights\" has different meanings,\n>which, although they are related, are not quite the same. \n>\n>The weights used by lm() are (inverse-)\"variance weights,\" reflecting the\n>variances of the errors, with observations that have low-variance errors\n>therefore being accorded greater weight in the resulting WLS regression.\n>What you have are sometimes called \"case weights,\" and I'm unaware of a\n>general way of handling them in R, although you could regenerate the\n>unaggregated data. As you discovered, you get the same coefficients with\n>case weights as with variance weights, but different standard errors.\n>Finally, there are \"sampling weights,\" which are inversely proportional to\n>the probability of selection; these are accommodated by the survey package. \n>\n>To complicate matters, this terminology isn't entirely standard.\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}