{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@flax9.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "factious: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n\nADVERTISEMENT\nWord of the Day for Wednesday, June 27, 2007\nfactious \\FAK-shuhs\\, adjective:\n1. Given to faction; addicted to form parties and raise dissensions, in opposition to government or the common good; turbulent; seditious; prone to clamor against public measures or men; -- said of persons.\n2. Pertaining to faction; proceeding from faction; indicating, or characterized by, faction; -- said of acts or expressions; as, factious quarrels.\nDespite Washington's considerable leverage with the ethnic Albanians, it was unclear whether the province's factious leadership understood the message. -- Danica Kirka, \"Rubin to Kosovars: Avoid Violence\", Los Angeles Times, March 14, 2000\nMany nobles sought good government, rather than being factious, and were only forced into war by the king's incompetence. -- \"Cade's Rebellion, History of United Kingdom,\", Encyclopedia Britannica\nNearly four months after the independent counsel, Kenneth Starr, delivered his report of possible impeachable offenses to the House, the Judiciary Committee will launch the final chapter of its factious inquiry this week, debating the merits of impeachment before taking its vote. -- Lizette Alvarez, \"Republicans Offer Clinton Lawyers 2 Days for Defense\", New York Times, December 7, 1998\nFactious derives from Latin factiosus, from factio, a party, a group of people, especially a political party, faction, or side.\nDictionary.com Entry and Pronunciation for factious\nYesterday's Word - Previous Words - Help\n\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-10079996-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}