{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "215p 6/12 Update: Solar arrays deployed", "body": "\n\n\n\n\n215p 6/12 Update: Solar arrays deployed\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 44\nPosted: 2:03 PM, 6/12/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-41 (06/11/07): Shuttle mission extended two days; fourth spacewalk added; blanket repair ordered\n   SR-42 (06/11/07): Spacewalk ends\n   SR-43 (06/12/07): Crew awake; solar array deploy on tap\n   SR-44 (06/12/07): S4 solar array wings deployed\n\n=================================\n\n2:03 PM, 6/12/07, Update: S4 solar array wings deployed\n\nTwo new solar array wings attached to the international space station Monday were slowly unfurled today, pulled from their storage boxes by self-assembling masts. Carried out in stages, the 15-foot-wide wings extended like giant window blinds, stretching some 240 feet from tip to tip.\n\nAs the first array wing - S4-1A - deployed to its full length shortly before 12:30 p.m., the gold-colored blankets rippled and gently oscillated back and forth as folded slats separated and were pulled taut.\n\n\"And Houston, ISS, we see 100 percent deploy on 1A,\" astronaut Jim Reilly radioed from the Destiny laboratory module.\n\nForty five moments later, the other wing of the new array - S4-3A - was deployed, first to 49 percent and then, after a half-hour pause, to 100 percent. Again, there were no problems.\n\n\"Houston, ISS, we see a good deploy,\" Reilly confirmed when the second wing unfurled.\n\nThe new arrays, the first to be mounted on the right side of the station's main power truss will provide an additional 14 kilowatts of electricity to the lab complex, joining the identical P4 arrays mounted on the left side of the station.\n\nA third set of arrays, known as P6, is mounted on top of the station at right angles to the power truss. P6 provided electricity to the U.S. section of the station during the initial stages of assembly and is in the process of being retracted so it can be moved to the left end of the power truss later this year.\n\nOne of the P6 wings - P6-4B - was retracted during a shuttle visit last December. Work to retract the P6-2B wing, which extends to the right side of the lab complex, will begin Wednesday. Based on problems retracting P6-4B, flight controllers have reserved time for possible spacewalk assists during EVAs Wednesday and Friday.\n\nToday's deploy was carried out in stages to let the sun warm the blankets and thus prevent a phenomenon known as stiction.\n\nDuring the deployment of the P6 arrays in 2000, engineers were surprised when several of the blanket panels emerged from the storage box stuck together. When they jerked free, a tensioning cable jumped its guides and required repairs on a subsequent spacewalk. For the second array's deployment, the crew let the sun warm up the array and deployed it in a so-called high-tension mode. That technique worked, and the array unfurled without incident.\n\nThe same technique was used last September for the P4 array wings and again today for S4.\n\nEach side of the main power truss features a solar alpha rotary joint, or SARJ, designed to rotate the outboard arrays through 360 degrees to keep them roughly face-on to the sun as the station circles the planet.\n\nThe new right-side SARJ in the S3 truss segment can't rotate until the astronauts retract the remaining P6-2B array at least 19 mast bays to provide the necessary clearance. In order to move P6 to the left end of the main power truss, the mast must be retracted all the way. Retraction begins early Wednesday.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}