{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Albert E. Sten-Clanton\" <albert.e.sten_clanton@verizon.net>", "subject": "Re: Software speech opinions", "body": "> >.  In real life, a good majority of the people who use computers will know \n> >little or nothing about how to fix the problems that arise.  Do you really \n> >propose that these people, such as my wife, have no business complaining or \n> >suggesting because they're not ultranerds?\n> \n> Well, sort of, yeah. Pointing out problems is one thing. Complaining is \n> another. And telling other people what they should do to solve your problems \n> is yet another thing entirely.\n> \n\nI know there are good and bad ways of \"pointing out problems,\" which is why I mentioned treating people right when you do it.  I hope I generally do.  \n\nAs for \"telling other people what they should do to solve your problems,\" that's about what I'd expect of any constructive user of any product to do if he or she didn't create the product--for that matter, whether it's \"free\" or not.  To me, the question is not whether you should do it, but how.\n\n> But anyway, my main point was to suggest that people ask themselves what \n> they've contributed to the open source community. Even if you're not a \n> coder, you can write documentation, maintain a web site, etc.\n> \nThis is certainly a fair point.  I'd add only that you can't be expected to contribute in those ways until you know what you're doing.  I've learned the hard way that bad documentation sometimes is worse than none at all, for example.  In any event, my impression is that those who made suggestions or complaints on the relevant topics here are already givers as well as takers.\n\nSomebody else suggested giving money to the free software movement.  That also seems a good idea, though I don't know to whom I'd donate for the purpose of, say, getting Speakup or similar non-visual access into the vanilla kernel as a standard feature (assuming it can be done).\n\nAl\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}