{"category": "ham", "to_address": "Andrew Bartlett <abartlet@samba.org>, Alison Winters <alisonw@sgi.com>", "from_address": "David Collier-Brown <davec-b@rogers.com>", "subject": "Re: Janitorial tasks (like literal '%' in smb.conf)", "body": "   Ok, Alison, want to propose a patch to Andrew?\n\n   And I'll then resurrect my crosscheck project, then, for the Samba 4\ntimescale.\n\n--dave\n\nAndrew Bartlett wrote:\n> On Tue, 2007-05-08 at 08:49 -0400, David Collier-Brown wrote:\n> \n>>Alison Winters wrote:\n>>\n>>>Indeed.  This fix should be trivial (add an option to alloc_sub_basic to\n>>>do something like realloc_string_sub(a_string, \"%%\", \"%\")).  But it's\n>>>also silly that backslashes sometimes have meaning and other times do\n>>>not (see\n>>>http://lists.samba.org/archive/samba-technical/2007-May/053111.html).  I\n>>>think Samba would gain a lot from an audit of what values are expected\n>>>and legal for each smb.conf option.\n>>\n>>\tI did one once upon a time, as part of a proposal to\n>>\tsanity-check shares for mutually contradictory options,\n>>\tbut we never went anywhere with it.\n> \n> \n> Yeah, the problem there was that in the Samba world of insanely\n> configurable options, the mutually contradictory options sometimes made\n> sense...\n> \n> A few years older and wiser, and I think reducing the number of valid\n> (or at least unwarned) combinations (even at the expense of some\n> historical configurations) would be a good thing...\n> \n> \n>>\tI wonder... there are a lot of little \"kernel janitor\"\n>>\ttasks that new contributors or very occasional contributors\n>>\tlike myself might do, but we lack a \"supervisor of\n>>\tcleaning staff\" to review and apply proposed changes.\n>>\n>>\tAre any of the core developers interested in the care\n>>\tand feeding of minor contributors? Of Google summer\n>>\tstudents?\n> \n> \n> A number of us have been mentors for SoC in the past, and are again with\n> our 2 students this year.  \n> \n> For Samba4, I'm happy to try and help minor contributions and\n> contributors along their way. \n> \n> Andrew Bartlett\n\n-- \nDavid Collier-Brown,         | Always do right. This will gratify\nSystem Programmer and Author | some people and astonish the rest\ndavecb@spamcop.net           |                      -- Mark Twain\n(416) 223-5943\n\n"}