{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Gregory Nowak\" <greg@romuald.net.eu.org>", "subject": "Re: Regarding running Linux with Speakup under a virtual machinewith\n\tWindows XP", "body": "Another option is to use ntldr, the windows nt loader. There is a minihowto \ndescribing how to do this under winnt4, but I can tell you from experience \nthat if you follow that, the procedure under winxp at least is exactly the \nsame as described.\n\nGreg\n\n\n--\nweb site: http://www.romuald.net.eu.org\ngpg public key: http://www.romuald.net.eu.org/pubkey.asc\nskype: gregn1\n(authorization required, add me to your contacts list first)\n\n--\nFree domains: http://www.eu.org/ or mail dns-manager@EU.org\n\n----- Original Message ----- \nFrom: \"Michael Whapples\" \nTo: \"Speakup is a screen review system for Linux.\" \nSent: Thursday, June 07, 2007 2:15 PM\nSubject: Re: Regarding running Linux with Speakup under a virtual \nmachinewith Windows XP\n\n\n> To add another option, it is possible to set up dual boot on the\n> computer and make windows the default. If you think the lilo, grub or\n> other boot loader screen would be off-putting to the rest of your\n> family, you can install lilo (I don't know about grub) to a floppy disk,\n> and leave the windows boot loader on the HD, so when you want linux\n> stick the lilo disk in. I guess you could actually install lilo to any\n> disk that you could boot from, eg. USB storage devices, etc. NOTE: with\n> this it is only the boot loader on the removable media, the OS is still\n> on the HD and so will behave as you would want and expect. I don't know\n> if other distros offer installing the boot loader to other places like\n> floppy, but I know slackware allows lilo on a floppy from the installer\n> (any distro should be able to install lilo to a floppy but you may need\n> to do it once it is installed).\n>\n> From\n> Michael Whapples\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}