{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nRisk Management 101: Managing Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nEPRI's Value \n\t\t\tand Risk in Energy Markets - Introduction & Principles\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nThe Impact of Today's Market Forces on Future CIS System Design (UtiliPoint.com - Jun. 13, 2007)\n\n\n\nUtiliPoint.com - Jun. 13, 2007 - During CS Week in May, the CS Executive Summit provided the opportunity to attend a session where CIS industry stakeholders, such as software vendors, integrators, and utilities, shared what they believe the key drivers for change are in the CIS market space.\n\n\nJun 13, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 13, 2007\n\n\n\nFirst Enercast Featured Articles for June 13, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 13, 2007 PowerMarketers Industry Publications\n\n\n\nReliability Standards Now Real (EnergyBiz Insider - Jun. 13, 2007)\n\n\n\nEnergyBiz Insider - Jun. 13, 2007 - For years it's been the buzz. Next week, it becomes real. Utilities that violate any of the 83 reliability standards set by an industry oversight group will face penalties.\n\n\nJun 13, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 13, 207)\n\n\n\nNatural Gas Intelligence summudles for Jun. 13, 2007\n\n\nJun 13, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nStorm cut power to 8,300 in Forsyth: Homes and businesses were without electricity, cable-television service\n\n\n\nJun. 13--The strong thunderstorm that blew through Winston-Salem and Forsyth County on Monday afternoon knocked down so many power lines that utility crews worked all yesterday to restore electricity.  The storm left more than 8,300 county residents without power immediately after it passed through the county. Most of the outages were caused by tree limbs that fell onto power lines, either ...\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\nElectricity use rises with heat\n\n\n\nJun. 13--HIGH POINT -- The current respite from the oppressive heat likely will end Sunday, ushering in another spell of 90-plus degree days.  Meanwhile, air conditioners and cooling systems have been going full tilt through the last of May and early June. May 29 was the only day last month that climbed into the 90s, hitting 91, according to Rod Gonski, a National Weather Service meteorologist. ...\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\nGoogle, Intel going green: TECH POWERS JOIN PUSH TO SAVE ENERGY WITH MORE EFFICIENT COMPUTERS, SERVERS\n\n\n\nJun. 13--Google and Intel threw their weight behind an initiative Tuesday to help blunt the impact of global warming by bringing greater energy efficiency to personal computers and servers.  An estimated 2 percent of worldwide carbon emissions comes from producing the electricity that powers computers and telecommunications gear. The two high-tech titans hope to reduce that by 54 million tons of ...\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\nBPA moves ahead on contracts, formula to share low-cost power\n\n\n\nJun. 12--The Bonneville Power Administration will go ahead negotiating 20-year power-supply contracts with public-utility customers, despite calls by Oregon congressmen to hold off until the BPA figures out how to resume sharing its low-cost hydropower with private utilities.  The federal agency, according to one report for a regional alliance of public-interest groups, also is working on a ...\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nMalfunction shuts down Browns Ferry Unit 1 for more testing\n\n\n\nJun. 12--Unit 1 at Browns Ferry Nuclear Plant hit another glitch Saturday, briefly causing an increase in pressure within the reactor vessel, according to Nuclear Regulatory Commission records.  The event, coming after Tennessee Valley Authority hooked Unit 1 to the power grid for the first time in 22 years and after making it to 99-percent power, was a slight setback in the re-start.\n\n\nJun 12, 2007 Knight Ridder Tribune Business News\n\n\n\nPower outage strikes West Charlotte\n\n\n\nJun. 13--Duke Power and city transportation officials are working to repair problems caused by a power outage this morning in the West Charlotte area.  Some of the power had been restored by 8:50 a.m., but the outage has affected many traffic signals on the west side. Streets involved include Freedom Drive, Wilkinson Blvd, West Blvd and Ashley Road. Duke Power does not know what caused the outage ...\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\nStarting the sizzle: 100-degree temperatures are forecast to scorch Valley for the rest of the week.\n\n\n\nJun. 13--The first triple-digit temperatures of the year are in the forecast, with highs above 100 degrees expected the rest of this week.  Thursday and Friday could see highs of 106, giving residents an unwelcome reminder of the record temperatures last July, said Gary Sanger, a meteorologist with the National Weather Service in Hanford. \"The forecasted high for [today] is 104, and then it does ...\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\nTulare Co. OKs power deal: It will join a new Valley group to get lower rates.\n\n\n\nJun. 13--VISALIA -- Tulare County supervisors are moving forward with a power program that will bring competition to the Valley utility business.  In a 4-1 vote, the Board of Supervisors entered an agreement Tuesday with the San Joaquin Valley Power Authority, which says it can provide electricity at lower rates than utility companies to 14 Valley communities.\n\n\nJun 13, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nSAN FRANCISCO / PUC to explore new electricity sources / Inquiry will ask if sun, wind, fuel cells cheaper than PG&E\n\n\n\nThe San Francisco Board of Supervisors gave approval Tuesday to the San Francisco Public Utilities Commission to explore whether generating electricity from the sun, wind and fuel cells would cost city residents less than what they pay Pacific Gas & Electric Co. for energy. In a series of votes, the board overwhelmingly endorsed a proposal to direct the commission to seek proposals and more ...\n\n\nJun 13, 2007 San Francisco Chronicle\n\n\n\nHospital evacuates about 200 after rupture of natural gas line\n\n\n\nAbout 200 people were evacuated from Anne Arundel Medical Center yesterday after a contractor ruptured a natural gas line, a hospital spokeswoman said. Staff members, patients and visitors at the Wayson, Donner and Edwards pavilions at the Annapolis-area hospital were sent outside or to other buildings on the campus shortly before noon, said Effie Dawson, an AAMC spokeswoman.\n\n\nJun 13, 2007 Baltimore Sun\n\n\n\nScottsdale mayor to receive award for city's green efforts\n\n\n\nLesley Wright The Arizona Republic Jun. 12, 2007 12:00 AM SCOTTSDALE - Scottsdale Mayor Mary Manross will be in Washington, D.C., on Wednesday to receive the Mayor's Energy Leadership Award at the 18th annual Energy Efficiency Forum. 'This is an honor for our entire community, our citizen board and committee members, staff and management and my fellow City Council colleagues,' Manross said. ...\n\n\nJun 12, 2007 Arizona Republic\n\n\n\nProgress Energy closes on sale of remaining merchant business\n\n\n\n-- Progress Energy announced that its subsidiaries closed on the previously announced sale of its nonregulated power plants, hedges and contracts. Net proceeds from the transactions totaled approximately $480  million, including income tax benefits, and are expected to be used for corporate purposes. Interested in a subscription to Power Engineering Magazine? ...\n\n\nJun 13, 2007 Power Engineering\n\n\n\nPortland General Electric's Port Westward Plant available for commercial generation\n\n\n\n-- Portland General Electric Company said that its Port Westward Generating Plant, a 40-MW natural gas-fired power plant located near Clatskanie, Ore., is available for commercial generation. The plant is owned and operated by PGE, and is the first major new generating plant placed into service by the company since 1995. It has the capacity to serve approximately 300,000 homes.\n\n\nJun 13, 2007 Power Engineering\n\n\n\nGE Energy introduces 4-MW Jenbacher gas engine\n\n\n\n-- GE Energy's Jenbacher gas engine business introduced a 4-MW, 24-cylinder J624 GS Jenbacher gas engine to the market. A news release said the engine is successfully running on the test bench in Jenbach, Austria. Initially, the engine will be operated with natural gas and its first customers will be greenhouse operators in the Netherlands. In the next step, this engine will be used for coal mine ...\n\n\nJun 13, 2007 Power Engineering\n\n\n\nPPL signals interest in third nuclear unit\n\n\n\n-- PPL Corporation has sent a letter to the U.S. Nuclear Regulatory Commission indicating the company's intent to submit an application for a combined construction and operating license, a step it says would preserve the option to build a third nuclear generating unit at the Susquehanna plant near Berwick, Pa. Options for future growth in the company's generating fleet also include the ...\n\n\nJun 13, 2007 Power Engineering\n\n\n\nNevada Power to spend $60 million on burner technology\n\n\n\n-- Nevada Power Co. will spend up to $60 million on an advanced burner technology that will reduce nitrogen oxide emissions from its Clark Generating Station power plant. The upgrade is part of a deal with the U.S. Environmental Protection Agency resolving alleged violations related to the power plant. The company will also contribute $400,000 to Vegas PBS to fund a solar panel array on its new ...\n\n\nJun 13, 2007 Power Engineering\n\n\n\nTVA extends WorleyParsons contract for power plant services\n\n\n\n-- WorleyParsons announced the extension of a contract with Tennessee Valley Authority (TVA) to provide engineering services for their fossil and hydro power plants. TVA has extended the term of  the contract from 2009 to 2014. The average yearly revenue under this contract is expected to be U.S.\n\n\nJun 13, 2007 Power Engineering\n\n\n\nDenver's global warming plan gets some heat\n\n\n\nDenver's global warming plan gets some heat STORY TOOLS   RELATED STORIES  MORE STORIES By Stuart Steers, Rocky Mountain News June 11, 2007 People around the country accused Denver of embracing a \"crackpot\" scheme to fight global warming Monday, after the city's plan drew widespread attention on the Internet. The reaction was to a Rocky Mountain News story that detailed some of the proposals in ...\n\n\nJun 12, 2007 Rocky Mountain News\n\n\n\n\n\nPacific Gas and Electric Company Joins Google and Intel in Alliance to Promote Energy Efficient Computing\n\n\n\nUtility Offers Several Rebate Programs for Efficient Computer Technology SAN FRANCISCO, June 13 /PRNewswire-FirstCall/ -- Pacific Gas and Electric Company has joined Google, Intel Corporation and several other organizations as part of the Climate Savers Computing Initiative. The goal of the initiative is to promote the use of energy efficient computers and power management tools to help the world ...\n\n\nJun 13, 2007 PR Newswire\n\n\n\nFitch Affirms El Paso Corp.; Rates Proposed $1.275B Notes 'BB+'\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings has affirmed the ratings of El Paso Corporation (El Paso) and its core pipeline subsidiaries, and assigned a senior unsecured rating of 'BB+' to the company's proposed offering of $1.275 billion of senior unsecured notes due in 2014 and 2017. Proceeds from the note offering will be used to refinance the $1.2 billion of 7 3/4% senior unsecured notes at the ...\n\n\nJun 13, 2007 Business Wire\n\n\n\nDairyland Power's 66th Annual Meeting Highlights\n\n\n\nNearly 700 delegates and guests attended Dairyland Power Cooperative's 66th Annual Meeting at the La Crosse Center earlier today.     (Logo: http://www.newscom.com/cgi-bin/prnh/20060607/CGW008LOGO )     The theme of the meeting was 'Our Pledge to the Future.' Dairyland's commitment to reliably meeting energy needs while addressing environmental and economic concerns provided the meeting's focus. ...\n\n\nJun 13, 2007 PR Newswire\n\n\n\nBull Moose Energy Secures $60 Million In Financing from Morgan Stanley To Develop Biomass Power Production Plants\n\n\n\n05:45 PM Eastern Daylight Time Bull Moose Energy Secures $60 Million In Financing from Morgan Stanley To Develop Biomass Power Production Plants First 20 Megawatt Project Will Provide Power to SDG&E SAN DIEGO--(BUSINESS WIRE)--Bull Moose Energy today announced that Morgan Stanley has agreed to invest up to $60 million in the San Diego-based firm to finance the development of a new generation of ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nSouthwall to Promote Glazing Energy Performance as Key Component in Achieving Sustainable Development\n\n\n\nPALO ALTO, Calif.--(BUSINESS WIRE)--Southwall Technologies Inc. (OTCBB:SWTX), the worldwide innovator of high performance, energy-saving films and glass products, will deliver a presentation entitled Superior High Performance Windows Innovative Technologies, at Glass Processing Days, a biannual global glass industry forum and product exhibition, June 15-18 in Tampere, Finland.\n\n\nJun 12, 2007 Business Wire\n\n\n\nUtility Wind Integration Group Begins Fundraising Campaign for User Group Activities\n\n\n\n02:03 PM Eastern Daylight Time Utility Wind Integration Group Begins Fundraising Campaign for User Group Activities Step marks move forward on research agenda, service offering for members RESTON, Va.--(BUSINESS WIRE)--The Utility Wind Integration Group (UWIG) announced that it has begun a campaign to raise funding for expanded research and development activities among its five user groups.\n\n\nJun 13, 2007 Business Wire\n\n\n\nutility.net Announces Partnership With visp.net to Enable Local ISP's to Resell Broadband Services in Underserved Markets:\n\n\n\nBeginning With an Initial Roll-Out in Central Michigan With Consumers Energy, the Relationship With visp.net Sets the Stage for Nationwide BPL Deployment Offering Consumers Freedom of Choice Through Their Local ISP's LOS ANGELES, June 13 /PRNewswire/ -- utility.net, a Los Angeles, CA based Broadband over Power Line (BPL) network provider (http://www.utility.net), announces its selection of ...\n\n\nJun 13, 2007 PR Newswire\n\n\n\nNevada Power and U.S. EPA Reach Settlement on Clark Generating Station\n\n\n\nNevada Power Company, a wholly-owned subsidiary of Sierra Pacific Resources (NYSE: SRP), today announced that it has reached a settlement agreement with the U.S. Environmental Protection Agency resolving alleged violations related to its Clark Generating Station in Las Vegas, Nev. Under the agreement, the company will spend up to $60 million on an advanced burner technology that will reduce ...\n\n\nJun 13, 2007 PR Newswire\n\n\n\nProgress Energy Closes on Sale of Remaining Merchant Business; Clearly Focused on Regulated Utilities\n\n\n\nRALEIGH, N.C., June 13 /PRNewswire-FirstCall/ -- Progress Energy (NYSE: PGN) announced today that its subsidiaries closed on the previously announced sale of its nonregulated power plants, hedges and contracts. Net proceeds from the transactions totaled approximately $480 million, including income tax benefits, and are expected to be used for corporate purposes.\n\n\nJun 13, 2007 PR Newswire\n\n\n\nEl Paso Corporation to Pursue $1.275 Billion Public Offering of Senior Notes\n\n\n\nHOUSTON, June 13 /PRNewswire-FirstCall/ -- El Paso Corporation (NYSE: EP) (El Paso), announced today that it plans to issue $1.275 billion of its unsecured senior notes in a public offering. The notes are being offered under El Paso's shelf registration statement.     El Paso plans to use the net proceeds from the sale of the notes to fund the purchase by El Paso's subsidiary, El Paso Exploration ...\n\n\nJun 13, 2007 PR Newswire\n\n\n\nDevelopers of New Illinois Generation Look at a Diverse Mixture for the Future\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). The state of Illinois currently has about 45,700 megawatts (MW) of operational generating capacity. This includes 11,600 MW of nuclear generation and 17,100 MW of coal and/or coke-based capacity.  For details, view the entire article by subscribing to Industrial Info's Premium Industry News at ...\n\n\nJun 13, 2007 Internet Wire\n\n\n\nPGM Integrated Creates Branding Campaign for SourceGas\n\n\n\n11:00 AM Eastern Daylight Time PGM Integrated Creates Branding Campaign for SourceGas DENVER--(BUSINESS WIRE)--PGM Integrated, an award-winning integrated marketing agency, recently launched an integrated branding campaign for SourceGas, formerly the Retail division of Kinder Morgan, and a leading supplier and distributor of natural gas products to residential, business and agricultural customers ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nFitch Affirms CenterPoint Energy & Subsidiaries; Outlook Stable\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch affirms the ratings of CenterPoint Energy, Inc. (CNP, Issuer Default Rating [IDR] 'BBB-') and its operating subsidiaries, CenterPoint Energy Houston Electric (CEHE, IDR 'BBB') and CenterPoint Energy Resources Corp. (CERC, IDR 'BBB'). Approximately $6.8 billion of debt is affected by today's rating actions. The Rating Outlook for all three issuers remains Stable. ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nBioCentric Energy Board of Directors Approves Funding for Mason City\n\n\n\nBioCentric Energy, Inc. (BCEI)  BioCentric Energy, Inc. (BCEI) is pleased to announce that the Board of Directors unanimously approved funding to facilitate the first Cellulosic Ethanol plant utilizing the 'Rivera Process' at BCEI's Mason City, Iowa, location.  The Rivera Hydrolysis/Pyrolysis (HP) sublicense was provided to BCEI by Sustainable Power Corp. (PINKSHEETS: SSTP), the primary master ...\n\n\nJun 12, 2007 Internet Wire\n\n\n\n\n\nWestar seeks feedback on transmission line\n\n\n\nWestar Energy Inc. is planning a series of meetings asking for suggestions on the route of a proposed transmission line from a substation near Rose Hill to one northeast of Perry, Okla. Westar (NYSE: WR) and Oklahoma Gas & Electric Co., a subsidiary of OGE Energy Corp. (NYSE: OGE), are working together to build the 345 kilovolt high-capacity transmission line.\n\n\nJun 12, 2007 Wichita Business Journal\n\n\n\nTsakos Energy Navigation secures liquefied gas charter\n\n\n\nTsakos Energy Navigation (TEN) has won a time charter of its Neo Energy vessel to ship liquefied natural gas (LNG). Terms of the deal and the name of the employer were not disclosed.The Athens-based carrier said this charter comes on the heels of the 2007-built 150,000 m3 LNG vessel's previous profitable employment secured by the company. The company said the returns from the new charter will ...\n\n\nJun 13, 2007 Datamonitor\n\n\n\nTexas Utility TXU to Retrofit Coal Plants With Mercury - Control Systems\n\n\n\nTexas Utility TXU to Retrofit Coal Plants With Mercury-Control Systems June 13, 2007 - 11:07 a.m. DALLAS (AP) - Electric utility TXU Corp. said it would add pollution-control systems designed to reduce emissions of mercury from its coal-fired power plants. TXU officials said it was the country's largest voluntary program to reduce mercury emissions. The announcement Tuesday came one day before ...\n\n\nJun 13, 2007 Canadian Business Magazine\n\n\n\nSuperior Plus to sell electricity contracts in Ontario via Bruce Power deal\n\n\n\nCALGARY (CP) - Calgary-based Superior Plus Income Fund (TSX:SPF.UN) plans to start selling fixed-price electricity to Ontario consumers via a three-year supply deal with Bruce Power LP. Under the arrangement announced Wednesday, Superior will sell power to customers on contracts running up to five years. The trust said the deal between its subsidiary, Superior Energy Management Electricity, and ...\n\n\nJun 13, 2007 Canadian Business Magazine\n\n\n\nWhiteFence Goes Green With Launch of GreenEnergyChoice.com\n\n\n\nNew Site Gives Consumers a Broad Range of Environmentally-Conscious Energy Choices Houston, TX (PRWEB) June 13, 2007 -- WhiteFence, the leading online comparison marketplace for consumers looking to evaluate and order essential , today announced the launch of GreenEnergyChoice.com. As environmentally-conscious energy production scales up and produces more energy, 'clean power' is becoming ...\n\n\nJun 13, 2007 PRWeb\n\n\n\n>> USEC Tumbles After Newspaper Report About Uranium Enricher's Future\n\n\n\nUSEC Shares Tumble After Newspaper Report That the Uranium Enricher's Future Is on the Line Dan Sewell CINCINNATI (AP) - The stock price of the nation's only company that enriches uranium for nuclear power plants tumbled on Tuesday as it prepares to demonstrate an advance that figures to play in a crucial role in its future. USEC Inc. shares fell $2.55, or 11.7 percent, to $19.24 on Tuesday after ...\n\n\nJun 13, 2007 Canadian Business Magazine\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nJBIC set to offer wind farm loan to PNOC-EDC\n\n\n\n- The Japan Bank for International Cooperation (JBIC) has said it is willing to extend a loan to the Philippine National Oil Company - Energy Development Corporation (PNOC EDC) to fund a wind power project in the Ilocos Norte province, according to the National Economic and Development Authority (NEDA). The PNOC-EDC proposal to seek JBIC funding came after the 30 MW Northern Luzon wind power ...\n\n\nJun 12, 2007 Power Engineering\n\n\n\nCH2M HILL and GE to Design and Build US$660 Million Gas-Fired Power Plant: Largest in Australia\n\n\n\nCH2M HILL and GE Energy (GE) today announced its consortium will be the engineer, procurement and construction (EPC) contractor for Australian-based Origin Energy's new 630 megawatt Darling Downs Power Station to be located in Queensland, Australia. CH2M HILL and GE will design and construct the US$660 million (AUD$780 million) project, which will operate from single-fuel plant firing coal seam ...\n\n\nJun 12, 2007 PR Newswire\n\n\n\nIdentify the Challenges and Barriers to the Growth for Renewable Technologies Worldwide\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c59583) has announced the addition of Investment in Renewable Technologies Worldwide to their offering. It is possible that the world is heading towards a global energy crisis due to a decline in the availability of cheap oil and recommendations to a decreasing dependency on fossil fuel.\n\n\nJun 13, 2007 Business Wire\n\n\n\nMillion euro contract for a combined-cycle power plant fuelled by waste gas\n\n\n\n- Alstom has received a 330m turnkey contract from Brazilian steel producer ThyssenKrupp CSA Companhia Siderurgica to build a 490 MW combined-cycle power plant. The power plant, to be located in Sepetiba, Rio de Janeiro State, Brazil, will be fuelled by blast furnace waste gas from a new steel mill, which will be built in parallel by the customer, with excess energy exported to the national grid. ...\n\n\nJun 12, 2007 Power Engineering\n\n\n\nRWE to publish power generation details online to improve transparency\n\n\n\n- German utility RWE has outlined plans to increase transparency on the European electricity market by publishing additional production and grid data. From 1 July 2007, the company's power generation arm will use a special website to post information on unplanned outages for each power plant unit within an hour of their occurrence. The company said that, as a result, all market players would have ...\n\n\nJun 13, 2007 Power Engineering\n\n\n\nAlstom wins a 330 million euro contract for a combined cycle power plant fuelled by blast furnace waste gas in Brazil\n\n\n\nLEVALLOIS-PERRET, France--(BUSINESS WIRE)--Regulatory News: Alstom (Paris:ALO) has received a 330 million euro turnkey contract from Brazilian steel producer ThyssenKrupp CSA Companhia Siderrgica to build a 490 MW turnkey combined cycle power plant. The power plant, to be located in Sepetiba, Rio de Janeiro State, Brazil, will be fuelled by blast furnace waste gas from a new steel mill, which ...\n\n\nJun 12, 2007 Business Wire\n\n\n\nMHI receives wind turbine orders from U.S. developers\n\n\n\n11 June 2007 -- Mitsubishi Heavy Industries Ltd. has received massive orders for its wind turbine power generation systems in succession from five major U.S. wind power generation developers. The wind turbines ordered total 788 units with collective power generation capacity of 1,363.4 MW. The orders consist of 411 units of 2.4 MW wind turbines and 377 1 MW.\n\n\nJun 13, 2007 Power Engineering\n\n\n\nOil Prices Fall Ahead of Inventory Data\n\n\n\nArticle: :/n/a/2007/06/13/financial/f072221D64.DTL SFGate HomeBusiness  Sports Entertainment  Travel | Classifieds  Jobs  Real Estate  Cars SFGate  Web by Oil Prices Fall Ahead of Inventory Data del.icio.us Digg Technorati Reddit Slashdot Fark Newsvine Google Bookmarks Georgia (default) Verdana Times New Roman Arial Get Quote: Main Business &amp; Finance Page: Stock quotes, portfolio, funds and ...\n\n\nJun 13, 2007 San Francisco Chronicle\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}