{"category": "spam", "to_address": "Smiles <smiles@flax9.uwaterloo.ca>", "from_address": "Violet Odom <istmenya@goswamifamily.com>", "subject": "Unbelievable prices!", "body": "\n\nLooking for an effective and cheap solution to have sex like you had 10 years ago?\nVisit us\nViagra, Cialis, Levitra, Valium, Phentermine - they are all licensed and are the best quality!\nGo to the site\nPay less and get the licensed medications you are looking for. \nWith best regards,\nViolet Odom\n \n \nNe znaiu, chto ty tam sebe voobrazila, no Ia ne nameren zdes zastrevat, i ty eto prekrasno znaesh. Borodach privetlivo ulybnulsia, a na stole tut zhe voznikla ego kroshechnaia Kopiia vysotoj s palec. Prorochestvo vse Bolshe priobretalo pugaiushche realnye formy. Sudia po informacii emlota, sorodichi etogo inorasovika mogut okazatsia vesma Mstitelnymi tipami, no s problemami nado razbiratsia po mere ih postupleniia. \nS ulybkoj predvkusheniia na polnyh gubah Altares pridvinul k sebe bolshoj ovalnyj podnos s zhivopisno navalennoj grudoj Liazhek treskuna, tushennyh v sobstvennom soku i sdobrennyh sverhu ostrym, vkusno Pahnushchim zelenovatym rastitelnym sousom. Ia nevolno Poezhilsia pod zelenymi zvezdochkami ego zrachkov, slovno zagliadyvaiushchimi vnutr, I medlenno vstal. Dobaviv v poslednij moment k Sekatoru Molniiu, ia vognal Ee v briuho Kengsha ne huzhe, chem Nkot na tolkuchke vognal stalnoe lezvie, i Vse-taki probil moshchnyj korset iz gipertrofirovannyh myshc zhivota. Ia prosto ne imel prava upuskat takoj Moment. Zato ochen dejstvennyj, hmyknul korotyshka. V zerkalo obzora ia razgliadel ego dolgoviazuiu Spinu, maiachivshuiu nad zadnim sidenem, na kotoroe on dlia udobstva strelby Opustilsia na koleni. Ia zadal tebe vopros, chestnaia kordka. Odin malenkij vopros. \nI Chelovek, stoiavshij vo glave etogo obshchestva, dolzhen byt silnejshim iz vseh po Psi-sposobnostiam. Ubijca ushel, priniav Zakaz, a zakazchik ujti Ne smog, raspolosovannyj na krovavye lentochki. Ia priletel za toboj, podtverdil Velsajt s prezritelnoj usmeshkoj. Po krajnej mere, do sih por bylo imenno tak. ejisuminyon Ql9aWFBCckBEUFRWShpARlNHUUddXVwaVlA=\n \n\n\n"}