{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Amanda Tink <amanda@amandatink.net>", "subject": "Re: alsa questions?", "body": "Hi Spie,\n\nThanks for all your thoughts on this.  One of the things I love about \nlinux is there is always a solution, it just needs an idea to put you on \nthe right track.  There are specific responses to some of your suggestions \nbelow.\n\nSpie Sutherland wrote:\n> If you do lspci command does it show both sound cards?\n\nYes it does.\n\n> Have you tried getting each sound card working separately \n> before trying to get them both working at the same time?\n\nI personally haven't, but my friend who did the upgrade said they were \nboth working fine before he tried to set the SB Live as the default.  I \ncan play ogg files on the ensoniq card.\n\n> In the BIOS settings there is configuration for PCI slots,\n> you may be able to do manual setting the PCI slots that \n> have the cards installed rather choosing auto.\n\nSounds big, but I'm willing to try it if necessary.\n\n> It would be worthwhile to try to find out what the error\n> code -12 means on the following error message\n> EMU10K1X: probe of 0000:00:0f.0 failed with error -12\n\nOh, trust me, I have.  And I haven't found anything useful yet.  Though \nthat may well be because of my own lack of knowledge.\n\n> Perhaps looking at the alsaconf source code would help\n> determine what triggers the -12 error and what it means,\n\nAnother good thought.  I'll give it a go.\n\n> BTW I love your email signature, \n\nThank you.  The whole thing is beautiful.  I'm glad you quoted it.  I \nnever get tired of reading it.\n\nThank you again.\n\nAmanda\n\n--\nAmanda Tink: Email/MSN amanda@amandatink.net\nOur deepest fear is not that we are inadequate. Our deepest fear is that\nwe are powerful beyond measure. It is our light, not our darkness, that\nmost frightens us. We ask ourselves, who am I to be brilliant, gorgeous,\ntalented, fabulous? Actually, who are you not to be? You are a child of\nGod. Your playing small doesn't serve the world.  (Marianne Williamson)\n*Consider all www users: use, support and create text-friendly sites!*\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}