{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nTHIS WEEK AT EIA (Volume 9, Issue 26) (June 22 - June 28, 2007)\n\n\n\nEIA- Jun. 28, 2007 - THIS WEEK AT EIA is a list summarizing and providing URLs for every Energy Information Administration (EIA) product released during this week.\n\n\nJun 28, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 28, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 28, 2007\n\n\nJun 28, 2007 PowerMarketers Industry Publications\n\n\n\nFirst Enercast Featured Articles for June 28, 2007  \n\n\n\nFirst Enercast Featured Articles for June 28, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 28, 2007 PowerMarketers Industry Publications\n\n\n\nSDG&E Moves Ahead with MDM (UtiliPoint.com - Jun. 28, 2007) \n\n\n\nUtiliPoint.com - Jun. 28, 2007 - San Diego Gas and Electric (SDG&E), one of the three large investor-owned utilities in California making waves by moving forward with plans for advanced metering, has selected Capgemini for project management and integration for the back office portion of its AMI and MDM project.\n\n\nJun 28, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nPSNC rates rising, with state approval\n\n\n\nJun. 28--State regulators Wednesday approved an 11 percent rate increase for PSNC Energy, the natural gas utility that has 446,000 customers in North Carolina.  The increase covers the rising cost of natural gas and is PSNC's first such fuel-cost increase since November 2005. The N.C. Utilities Commission said that PSNC could raise residential rates from $1.18 per therm -- a unit of heat measure ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nMendota solar plant planned: Sun-produced energy could launch a new industry in Valley.\n\n\n\nJun. 28--A San Francisco company has chosen west Fresno County for a massive solar facility -- one that would be the largest in California and the leading edge of a potentially important new Valley industry.  The project, if approved by Fresno County officials, would feature photovoltaic panels covering about 40 acres near Pacific Gas & Electric Co.'s Mendota substation, said Bill Barnes, chief ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nUtility, wind farmer reach deal: No $60 million upgrade required for wind farm\n\n\n\nJun. 28--HAGERMAN -- After nine months of back and forth, Idaho Power Co. and a Magic Valley wind farmer have reached an agreement both say could launch a fledgling wind industry in southern Idaho.  The deal involves a case dating back to September. Hagerman wind farmer Jared Grover wanted to sell Idaho Power energy produced on his wind farm, but the power company wanted Grover to spend $60 ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nSolar farm future bright in S.J.: One system can power about 1,500 homes\n\n\n\nJun. 28--Two new solar farms will be built to serve San Joaquin County, one producing power for PG&E and another for a south-county irrigation district that provides irrigation and domestic water.  A 2-megawatt solar-power system will be built on eight acres near Tracy by San Francisco-based GreenVolts Inc. That site, when operational during the day, will be able to produce enough electricity to ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nLandfill electricity to expand\n\n\n\nJun. 28--Waste Management Inc. will double production of electricity from two of its Wisconsin landfills, as part of a $400 million initiative across North America to step up power production from methane gas.  The nation's largest garbage hauler and landfill operator, Waste Management plans to build facilities at 60 landfills to convert methane gas to electricity.\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nPSC reviews plant proposal\n\n\n\nJun. 27--A proposal to build a $1.4 billion coal power plant in South Dakota could affect what North Dakotans pay for electricity.  The project, dubbed Big Stone II, is being planned by a partnership of seven utilities, including Montana-Dakota Utilities Co. It was reviewed in a Tuesday hearing before the North Dakota Public Service Commission, a state-elected body that's charged with utility ...\n\n\nJun 27, 2007 Knight Ridder Tribune Business News\n\n\n\n$4.6 million to OMSI ignites protest\n\n\n\nJun. 27--SALEM -- In a last-minute deal, influential state lawmakers agreed to divert $4.6 million paid by Portland General Electric customers for energy efficiency to help the Oregon Museum of Science and Industry pay off a 15-year-old state loan.  Environmentalists and ratepayer advocates say they are outraged that the program, run by the nonprofit Energy Trust to help individuals and ...\n\n\nJun 27, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy workers to decide on union\n\n\n\nJun. 27--For a long time, Ralph Whitman said he was anti-union, associating the organizations with the overbearing ways of his father-in-law, an auto worker who would jump down his throat for driving a Toyota.  But now Whitman is among the rank-and-file at Progress Energy's Southport nuclear plant who are pushing for collective representation. On Thursday, he and 700 other workers at Progress' ...\n\n\nJun 27, 2007 Knight Ridder Tribune Business News\n\n\n\nEcolite finds a place in the sun: Spokane Valley firm to build equipment for solar power plant\n\n\n\nJun. 28--Spokane Valley-based Ecolite Manufacturing Co. is slated to fabricate equipment for a new two-megawatt solar power plant destined for a California utility.  The product of an undisclosed arrangement between startup GreenVolts Inc. and Pacific Gas and Electric Co., both of San Francisco, the plant will sit on eight acres in Tracy, Calif., according to a PG&E news release.\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nHigher tower proposal nixed: While Crowders Mountain is out, where transmitter might go remains unanswered\n\n\n\nJun. 28--The trail appears safe for now. Where the transmitter goes is anyone's guess.  During recent debate over the proposed extension of a communications tower on Crowders Mountain, two key questions emerged at the Gastonia City Council: 1. What would happen to a state park trail that crosses part of the tower property, especially if the landowners' extension request was rejected? 2.\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nNuclear funding: Company says it has funding to build power plant near Bruneau\n\n\n\nJun. 27--BRUNEAU -- A company with plans to build a nuclear power plant in Owyhee County says it has cleared its first major hurdle.  Alternate Energy Holdings, which intends to build Idaho's first commercial nuclear power plant, has announced a New York company representing investors intends to fund the project in full. \"This is revolutionary news,\" said AEH President Don Gillispie.\n\n\nJun 27, 2007 Knight Ridder Tribune Business News\n\n\n\nMower County mulls fifth request for wind farm\n\n\n\nJun. 27--A Mower County resident is seeking to build what he calls the first farmer-owned wind farm in the region.  James Hartson, a farmer in Waltham Township, along with his wife, Jane, got support for an initial step Tuesday night from the county's Planning Commission. The commission voted unanimously to recommend the Mower County Board approve a conditional-use permit for the Hartsons to ...\n\n\nJun 27, 2007 Knight Ridder Tribune Business News\n\n\n\nHouse Democrats push energy debate: Dingell ready with less-stringent plan\n\n\n\nJun. 28--WASHINGTON -- Backers of tougher fuel economy standards in the U.S. House pledged Wednesday to push their proposals ahead over the next several weeks, while U.S. Rep. John Dingell said his committee will wait until later this year before tackling any such plan.  But if the debate reaches the House floor next month, Dingell and the industry's supporters will be ready with their own fuel ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nCape Vincent lists its requirements for wind turbines\n\n\n\nJun. 28--CAPE VINCENT -- The Town Planning Board on Wednesday gave the St. Lawrence Wind Farm several hoops to jump through before completing the environmental review for its proposed project.  The wind farm, proposed by AES Acciona Wind Power NY, would bring up to 96 turbines to the town. A second project, Cape Vincent Wind Farm, proposed by BP Alternative Energy, would bring 60 to 80 turbines ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\n2 settle with feds in gas-trade case\n\n\n\nThe U.S. Commodity Futures Trading Commission reached a settlement this week with two Tulsa-area men who were accused of attempting to manipulate natural gas prices in violation of the Commodity Exchange Act. The former CMS Field Services Inc. employees -- Jeffrey A. Bradley of Bixby and Robert L. Martin of Tulsa -- were accused in a 2005 civil complaint of conspiring to 'make up some numbers and ...\n\n\nJun 27, 2007 Tulsa World\n\n\n\nSAN FRANCISCO - PG&E lets customers buy carbon offsets\n\n\n\nPacific Gas and Electric Co. is holding an event today to launch a program that lets customers offset their household energy use by voluntarily paying extra for environmentally beneficial projects that reduce greenhouse gas emissions. Customers can enroll in the utility's ClimateSmart program, which helps figure the annual tonnage of carbon dioxide emissions related to the electricity use of a ...\n\n\nJun 28, 2007 San Francisco Chronicle\n\n\n\nEmpire District Electric buys wind energy\n\n\n\nEmpire District Electric Co. is increasing its ownership in wind energy. The Joplin-based utility announced today a 20-year purchased power agreement with Cloud County Wind Farm, owned by Houston-based Horizon Wind Energy. Empire will purchase about 100 megawatts from what will now be called the Meridian Way Wind Farm in Cloud County, Kan. Empire anticipates that it will purchase about 350,000 ...\n\n\nJun 27, 2007 Springfield Business Journal\n\n\n\nFour Green Benefits Of Nanotechnology\n\n\n\n-- A recent report entitled 'Nanotechnologies for Sustainable Energy: Reducing Carbon Emissions through Clean Technologies and Renewable Energy Sources' from researchandmarkets.com examines the impact of nanotechnology on the road to sustainability. Its analysis of technologies both currently available and under development concludes that:  The major near-term benefit of nanotechnologies will be ...\n\n\nJun 27, 2007 Industry Week\n\n\n\nLI power use up but not close to max\n\n\n\nPower use on Long Island surged yesterday as temperatures climbed into the 90s, officials said, but the supply of electricity was hardly taxed by the spike. The Long Island Power Authority's 1.1-million customers demanded a peak of about 4,800 megawatts of juice to power those air conditioners and fans at one of the busiest hours, between 3 and 4 p.m. But officials said that figure was nowhere ...\n\n\nJun 28, 2007 Newsday\n\n\n\nSun's rays pay off\n\n\n\nCatching rays in Long Beach Program waives building permit fees in exchange for solar energy installation BY WILLIAM MURPHY The side-by-side electric meters at the back of Lester Ginsberg's Long Beach home run in opposite directions when the sun's out. His tenant's meter spins in the standard left-to-right manner. But since Ginsberg installed solar panels on his roof last week, his meter runs ...\n\n\nJun 27, 2007 Newsday\n\n\n\nLIPA turns on new electric cable\n\n\n\nThe Long Island Power Authority Thursday threw the ceremonial switch on the Neptune power cable, opening the line for 660 megawatts to flow onto the regional grid. At a newly humming converter station in New Cassel, LIPA chief executive Richard Kessel said the cross-Atlantic cable gives access to cheaper power from 13 nearby states. The authority hasn't signed any long-term contracts to supply ...\n\n\nJun 28, 2007 Newsday\n\n\n\nElectricity Credit Program Launched\n\n\n\nHouseholds and businesses strapped by high energy costs can receive a credit on a fall electric bill by cutting their consumption during the summer months, under a program announced today by state regulators. The 'Summer Saver Rewards Program' was part of the energy bill passed by lawmakers and signed by Gov. M. Jodi Rell recently. Ratepayers will receive a credit on their November bill equal to ...\n\n\nJun 28, 2007 Hartford Courant\n\n\n\nEnergy, fuel prices pinch food distributors\n\n\n\nEnergy, fuel prices pinch food distributors By Sandy ClarkSpringfield Business Journal Contributor6/25/2007 Wholesale food distribution business in Springfield is facing new challenges in a tight energy market. The broader issue, however, is maintaining margins and dealing with rising costs, according to Steve Potter, vice president of industry relations with the International Foodservice ...\n\n\nJun 27, 2007 Springfield Business Journal\n\n\n\nKentucky has already committed $2.4 million to coal plants\n\n\n\nto Peabody Energy to conduct a feasibility study on a $3 billion coal-to-liquid fuel plant near Sturgis, in Union County, and a $2 million to help EnviRes LLC develop technology in the Ashland area to gasify coal, biomass and other carbon-bearing materials. Fletcher has said repeatedly that Kentucky would not even be considered for such projects without tax incentives that he is proposing for a ...\n\n\nJun 28, 2007 Evansville Courier\n\n\n\nKeySpan connected to toxic site study\n\n\n\nNew questions are being raised about the objectivity of a report on a toxic utility gas-plant site in Hempstead amid revelations that its author is a little-known subsidiary of KeySpan. State officials and KeySpan will meet with residents tonight. The firm, hired by KeySpan to perform the remedial investigative report for the site, is a Warren, N.J. company listed as Paulus, Sokolowski and Sartor ...\n\n\nJun 28, 2007 Newsday\n\n\n\nConflict charges surround KeySpan subsidiary\n\n\n\nAs state officials and KeySpan prepare to meet with residents Thursday night about a toxic utility gas-plant site in Hempstead, new questions are being raised about the objectivity of a report about the site amid revelations that its author is a little-known subsidiary of KeySpan. The firm contracted to perform the remedial investigative report for the site is a Warren, N.J.\n\n\nJun 27, 2007 Newsday\n\n\n\nNYC power outage snarls traffic, trains\n\n\n\nA power outage darkened a large swath of Manhattan and the Bronx on Wednesday, knocking out traffic lights, cutting subway service and forcing the evacuation of the Metropolitan Museum of Art on one of the hottest days of the year. 'The entire neighborhood is out,' said Phil Quintana, a building superintendent on the Upper East Side. Con Edison said the blackout affected 136,700 customers in all, ...\n\n\nJun 27, 2007 Buffalo News\n\n\n\n\n\nProgress Energy Florida Kicks Off Customer Education Program\n\n\n\nCampaign encourages easy ways for customers to improve energy efficiency, save money     ST. PETERSBURG, Fla., June 28 /PRNewswire-FirstCall/ -- Progress Energy Florida today launched a comprehensive awareness campaign designed to educate customers about the importance and benefits of energy efficiency.\n\n\nJun 28, 2007 PR Newswire\n\n\n\nSouthern Company, Georgia Tech Wind Power Study Finds Potentially Favorable Conditions for Offshore Generation Pending Resolution of Economic, Regulatory Issues\n\n\n\nATLANTA, June 27 /PRNewswire-FirstCall/ -- Southern Company said today that a thorough two-year study conducted with the Georgia Institute of Technology has identified several conditions potentially favorable for wind power generation off the coast of Georgia, but that high costs and regulatory issues still need to be resolved.\n\n\nJun 27, 2007 PR Newswire\n\n\n\nFitch Rates MidAmerican Energy's $650MM Senior Notes 'A'\n\n\n\nCHICAGO--(BUSINESS WIRE)--Fitch Ratings has assigned an 'A' rating to the following note issues for MidAmerican Energy Company (MEC): --$250 million issuance of 5.95% senior notes due 2017; --$400 million of 5.65% senior notes due 2012. Proceeds from the sale will be used to fund capital expenditures for new generation facilities, repay short-term debt and for general corporate purposes.\n\n\nJun 28, 2007 Business Wire\n\n\n\nDiversified Energy Corporation Expands Engineering Services Capabilities to Include Bioenergy Projects Such as Biodiesel, Ethanol, and Biomass Combustion/Digestion\n\n\n\n- Company is responding to a rapid acceleration of new bioenergy projects in the U.S. and a shortage of resources that can provide accurate, objective and responsive engineering   - Developers are seeking customized support for projects that are often     unique in nature, require large initial investments, and can contain  substantive risks   - Diversified Energy(R) is ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nONEOK Completes Stock Repurchase Program\n\n\n\nTULSA, Okla., June 28 /PRNewswire-FirstCall/ -- ONEOK, Inc. (NYSE: OKE) today announced that it has repurchased 7.5 million shares of outstanding common stock under an accelerated share repurchase agreement with Bank of America, N.A. at an initial price of $49.33 per share for a total of $370 million. The company funded the repurchase with cash on hand. The company's outstanding shares used to ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nEnergy Savings Announces 27th Distribution Rate Increase $0.05 Increase to $1.165 Per Annum Effective July Distribution\n\n\n\nAt its Annual Meeting of Unitholders, Energy Savings Income Fund (TSX: SIF.UN) announced that the Fund's Board of Directors approved an increase in the annual distribution rate on the Fund's units to $1.165 per unit or $0.097/unit per month. The increase will be effective the distribution payable on July 31, 2007 to Unitholders of record at the close of business on July 15, 2007.\n\n\nJun 28, 2007 Internet Wire\n\n\n\nFitch: Dominion's Stock Repurchase Plan Won't Affect Ratings\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings said Thursday that Dominion Resources, Inc.'s (Dominion) modified 'Dutch Auction' to repurchase common shares will not affect the company's ratings. The share repurchases will be financed with a portion of the proceeds from Dominion's ongoing exploration and production divestiture program. Dominion had previously announced its intent to use a portion of ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nNYC Power Outage Gives Stark Evidence of Need for Energy Independence Strategy; Legislature Urged to Pass Vital Bills by July 4, Ignoring the Electric Utility Interests Swarming Capitol to Deny Consumers Lower Energy Bills, Cleaner Energy\n\n\n\nHARRISBURG, Pa.--(BUSINESS WIRE)--Todays power outage in Manhattan and the Bronx affecting vital subway travel and incapacitating more than 100,000 businesses and households on one of the hottest days of the year provides stark evidence of the need for the Pennsylvania legislature to pass the Energy Independence Strategy immediately, according to Citizens for Pennsylvania's Future (PennFuture). ...\n\n\nJun 27, 2007 Business Wire\n\n\n\nPlant Vogtle to Seek License Renewal\n\n\n\nBIRMINGHAM, Ala., June 28 /PRNewswire-FirstCall/ -- Southern Nuclear Operating Company, a subsidiary of Atlanta-based Southern Company, today announced its plan to ask the Nuclear Regulatory Commission (NRC) -- on behalf of the Alvin W. Vogtle Electric Generating Plant co-owners -- to renew the plant's operating license for an additional 20 years.     If the company's application for renewal is ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nAn Audio Interview Featuring David Saltman, President and CEO of Open Energy Corp., is Available at SmallCapVoice.com\n\n\n\nAUSTIN, Texas--(BUSINESS WIRE)--SmallCapVoice.com, Inc. today announced that an audio interview featuring, David Saltman, President and CEO of Open Energy Corp. (OTCBB: OEGY), is still available at SmallCapVoice.com. The interview can be heard here at http://www.smallcapvoice.com/oegy/oegy-6-21-07.html. SmallCapVoice.com is a recognized corporate consulting firm, with clients nationwide, known ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nNoble Environmental Announces Closing of Construction and Term Financing for 3 NY State Windparks\n\n\n\nNoble Environmental Power (Noble) announced today the closing of the construction and term financing for 282 MW of windpower projects located in Western and Northern New York. The Borrower, Noble Environmental Power 2006 Hold Co., will utilize the funds to construct the 100.5 MW Noble Clinton Windpark, the 81 MW Noble Ellenburg Windpark, and the 100.5 MW Noble Bliss Windpark.\n\n\nJun 27, 2007 PR Newswire\n\n\n\nOGE Energy Corp. Announces Filing of Registration Statement for Initial Public Offering by OGE Enogex Partners L.P.\n\n\n\nOKLAHOMA CITY, June 27 /PRNewswire-FirstCall/ - OGE Energy Corp. (NYSE: OGE) today announced that its wholly owned subsidiary, OGE Enogex Partners L.P., has filed a registration statement on Form S-1 with the U.S. Securities and Exchange Commission relating to a proposed initial public offering of its common units. Application will be made to list the common units on the New York Stock Exchange ...\n\n\nJun 27, 2007 PR Newswire\n\n\n\nInvenergy Completes Construction of $100 Million Power Project in Colorado, an Industrial Info News Alert\n\n\n\nResearched by Industrial Info Resources  Researched by Industrial Info Resources (Sugar Land, Texas). Invenergy LLC has completed construction and is in start-up testing of the $100 million, 300-megawatt Spindle Hill Energy Center located in Longmont, Colorado.  For details, view the entire article by subscribing to Industrial Info's Premium Industry News at ...\n\n\nJun 28, 2007 Internet Wire\n\n\n\nCon Edison Responding to Power Outages in Westchester County\n\n\n\nCon Edison crews are responding to power  Con Edison crews are responding to power outages caused by thunderstorms and tree damage to power lines as severe weather continues to move across Westchester County.  The utility is assessing damage and estimates that up to 10,000 customers are currently without power. Mamaroneck, New Rochelle, White Plains, Larchmont, Harrison, Rye, Rye Brook, ...\n\n\nJun 27, 2007 Internet Wire\n\n\n\nEntergy Publishes 2006 Sustainability Report\n\n\n\nNEW ORLEANS, June 28 /PRNewswire-FirstCall/ -- Entergy Corporation (NYSE: ETR) has released the company's 2006 sustainability report, Imagine, Aspire, Achieve, highlighting environmental, social and economic initiatives for the year. Outlining Entergy's performance in areas such as safety, community involvement, environment and financial responsibility, the report cites goals achieved in 2006. ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nCNX Gas Promotes William \"Gill\" Gillenwater\n\n\n\nPITTSBURGH, June 28 /PRNewswire-FirstCall/ -- CNX Gas Corporation (NYSE: CXG) announced that William 'Gill' Gillenwater has been promoted to Vice President - Land Resources.     (Logo: http://www.newscom.com/cgi-bin/prnh/20051213/CNXLOGO )     Stephen W. Johnson, senior vice president and general counsel, said, 'Under Gill's leadership during the past year, the land function has been instrumental ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nPG&E Corporation Supports Proposed Lieberman-Warner Climate Change Initiative\n\n\n\nSAN FRANCISCO, June 27 /PRNewswire-FirstCall/ -- PG&E Corporation (NYSE: PCG) issued the following statement in support of the efforts by Senator Joseph Lieberman, I-D Connecticut, and Senator John Warner, R-Virginia, to draft a comprehensive climate change bill. 'PG&E welcomes Senator Lieberman and Senator Warner's announcement to bring a comprehensive climate change bill before their ...\n\n\nJun 27, 2007 PR Newswire\n\n\n\nAllegheny Announces Virginia Rate Case Decision\n\n\n\nGREENSBURG, Pa.--(BUSINESS WIRE)--Allegheny Power, the electric delivery subsidiary of Allegheny Energy, Inc. (NYSE:AYE), announced that the State Corporation Commission of Virginia issued an order regarding the companys April 2007 rate request. In its April 2007 filing with the commission, Allegheny had requested the implementation of a rate stabilization plan to moderate the impact of ...\n\n\nJun 28, 2007 Business Wire\n\n\n\n\n\nWestar Energy realigns executive team\n\n\n\nWestar Energy Inc.'s new chief executive officer has put together his leadership team. Five officers will report directly to Bill Moore, who takes over as Westar (NYSE: WR) president and CEO on July 1: 'The changes announced today will increase Westar's focus on three areas going forward -- continued high quality customer service, construction of new transmission and generation facilities to meet ...\n\n\nJun 27, 2007 Wichita Business Journal\n\n\n\nU.S. assesses fossil fuel costs\n\n\n\nThe cost of building a carbon capture plant is nearly twice that of a traditional plant, suggests a recent report by the U.S. Department of Energy. 'Cost and Performance Baseline of Fossil Energy Plants,' by the Office of Fossil Energy's National Energy Technology Laboratory offers estimates of the cost and performance of pulverized coal, natural gas and integrated gasification combined cycle. ...\n\n\nJun 28, 2007 UPI\n\n\n\nGroups File Appeal Against Michigan Nuclear Power Plant\n\n\n\n- 3:25 p.m. COVERT TOWNSHIP, Mich. (AP) - Two nuclear energy watchdog groups have filed an appeal with a federal appeals court in Washington that says the high-level radioactive waste dry cask storage pads at the Palisades Nuclear Plant violate earthquake-safety regulations established by the Nuclear Regulatory Commission. The 3-foot-thick concrete pads rest upon loose sand amid the dunes of the ...\n\n\nJun 28, 2007 Canadian Business Magazine\n\n\n\nS.F. solar power companies sign 7MW deal with PG&amp;amp;E\n\n\n\nSan Francisco-based solar power companies GreenVolts Inc. and Cleantech America LLC have signed deals with Pacific Gas and Electric Co. to deliver up to 7 megawatts of utility-scale renewable solar energy for PG&E customers in Northern and Central California. GreenVolts' GV1 project, on eight acres in Tracy, will be the largest concentrator photovoltaic project in the world when completed, said ...\n\n\nJun 28, 2007 San Francisco Business Times\n\n\n\nNuclear Regulatory Commission Updating Plant Licenses With Post 9 - 11 Safety Requirements\n\n\n\nJune 27, 2007 - 7:00 p.m. WASHINGTON (AP) - Federal regulators on Wednesday took the first step in updating the operating licenses of the nation's nuclear plants to ensure they incorporate safety rules issued after the Sept. 11 attacks. The Nuclear Regulatory Commission issued letters to FirstEnergy Corp.'s Beaver Valley plant in Pennsylvania, Exelon Corp.'s Braidwood and Byron generating ...\n\n\nJun 27, 2007 Canadian Business Magazine\n\n\n\nEnergy Department to Provide Up to Nearly $52M for Power Grid Technology Demonstrations\n\n\n\nJune 27, 2007 - 6:56 p.m. WASHINGTON (AP) - The Energy Department said Wednesday it would provide nearly $52 million in funding for research into power grid technologies, including superconductors designed to conduct electricity better than traditional copper wires. Five projects were approved for funding on the projects, expected to last two to five years, the Energy Department said.\n\n\nJun 27, 2007 Canadian Business Magazine\n\n\n\nVirginia SCC rejects Allegheny Power's request to raise rates 20%\n\n\n\nVirginia regulators Thursday rejected Allegheny Power's request to raise rates by 20% beginning July 1, saying the utility continues to be bound by an agreement it signed in 2000 to abolish a mechanism that allowed it to recover increases in its fuel costs. The State Corporation Commission said that under the 2000 agreement, Allegheny voluntarily transferred its generation units to an affiliate ...\n\n\nJun 28, 2007 Platts\n\n\n\n>> Waste Management expands gas-to-energy sites, including 6 landfills in Canada\n\n\n\nHOUSTON (CP) - Waste Management Inc., North America's largest garbage hauler and landfill operator, plans to spend roughly US $400 million at 60 landfills over the next five years to convert methane gas to electricity, its most ambitious renewable energy project to date. The program includes four landfills in Ontario and two in Quebec. Landfills are the largest source of methane emissions in the ...\n\n\nJun 27, 2007 Canadian Business Magazine\n\n\n\nTrident CEO denies hedge fund has liquidated NYMEX gas positions\n\n\n\nHouston (Platts)--27Jun2007  Houston-based hedge fund Trident Asset Management Wednesday dismissed natural gas-market rumors that it had been forced to liquidate a NYMEX gas futures position and had sold portions of its book to Centaurus Energy, another Houston-based hedge fund.      Trident CEO Jeff Shankman denied the rumors, telling Platts that Trident continues to hold positions in NYMEX gas ...\n\n\nJun 28, 2007 Platts\n\n\n\nNew Technology Could Lead To More Energy-Efficient Ethanol Production\n\n\n\n, , , , , - Ethanol to fuel cars, trucks and other vehicles might tomorrow take less energy to produce, thanks to a device invented by Agricultural Research Service (ARS) scientists in California. Bioethanol is taken out of an incoming fermentation broth using this spiral-wound liquid membrane module. The broth flows across the surface of specially designed permeable plastic membranes that are ...\n\n\nJun 27, 2007 Science Daily\n\n\n\nConservancy to research wind farm proposal\n\n\n\nGREENFIELD - The Nature Conservancy's $110 million deal to purchase and preserve 161,000 acres of former Finch Pruyn timberland includes the proposed site of a power-generating wind farm near Lake Desolation in Greenfield. The Conservancy supports wind power as a matter of principle as long as the wind farm is built in an environmentally responsible manner that doesn't destroy habitat, said Dirk ...\n\n\nJun 28, 2007 The Saratogian\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nNew Report Identifies Future Trends in the Energy Market in Germany\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c60896) has announced the addition of Germany Energy Market Flow by Fuel Report to their offering. The Germany overview report can help you to quickly understand the countrys energy market from a commercial perspective. This report provides detailed information, charts and tables on various types of ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nAF Gruppen ASA to build combined heat and power plant in Mongstad\n\n\n\n- Norwegian construction group AF Gruppen ASA said that its unit AF Anlegg has received a contract to build a combined heat and power plant in Mongstad, Norway. The NOK90m ($15.1m) contract was awarded by DONG Energy AS, a Norwegian subsidiary of the Danish energy group DONG Energy. The contract covers all foundation and concrete work, as well as infrastructure such as road, pipe and paving work. ...\n\n\nJun 28, 2007 Power Engineering\n\n\n\nNew Report Gives a Concise Overview of the Turkish Energy Market\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c60954) has announced the addition of 'Turkey Energy Market Supply and Demand Outlook Report' to their offering. The 'Turkey Energy Market Supply and Demand Outlook Report' allows a quick understanding of the key factors in the countrys energy market. This report provides an historical perspective on ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nCypress Provides Solar Panels to Power MIT's Coral Rehabilitation Project at the Sagay Marine Reserve, Philippines\n\n\n\nSAN JOSE, Calif.--(BUSINESS WIRE)--Cypress Semiconductor Corp. (NYSE: CY) today announced that it has donated six 90-watt solar panels supplied by its subsidiary, SunPower Corp. (NASDAQ: SPWR), to power MITs First-Step Coral reef rehabilitation project in the Sagay Marine Reserve in the Philippines. The solar panels are powering an innovative coral reef rehabilitation process called BioRock\" ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nExamine the Future Outlook of the Renewable Energy Sector in India\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61005) has announced the addition of Renewable Energy to their offering. Emission of greenhouse gases leading to climate changes is a major concern globally. India is among the top six contributors to greenhouse gas emission, though per capita emission is substantially low compared with other ...\n\n\nJun 27, 2007 Business Wire\n\n\n\nCanAlaska forms new Advisory Board and appoints new Board Director and V.P. Exploration\n\n\n\nVANCOUVER, June 28 /PRNewswire-FirstCall/ - CanAlaska Uranium Ltd. (TSX-V: CVV) - CanAlaska is pleased to announce the formation of a new Advisory Board, the appointment of a new member to its Board of Directors, and a new officer appointment to the Company. As the Company moves forward towards the realization of its objective of discovering a world-class uranium mine in Canada's Athabasca Basin, ...\n\n\nJun 28, 2007 PR Newswire\n\n\n\nAmpal-American Israel Corporation and Israel Infrastructure Fund Announced the Increase in the Joint Venture with Institutional Investors in Israel to Hold Shares in EMG\n\n\n\nTEL AVIV, Israel--(BUSINESS WIRE)--Ampal-American Israel Corporation (Nasdaq:AMPL) and Israel Infrastructure Fund (IIF), leading the group of institutional investors announced today that additional Israeli institutional investors have agreed to join Ampal, Israel Infrastructure Fund and other institutional investors in the joint venture to invest in East Mediterranean Gas. Co.\n\n\nJun 28, 2007 Business Wire\n\n\n\nENDESA's CEO Inaugurates New Subsidiary in Greece, Endesa Hellas.\n\n\n\nNEW YORK--(BUSINESS WIRE)--ENDESA (NYSE: ELE) Endesa Hellas will oversee the assets contributed by Mytilineos pursuant to the agreement signed in March, and will spearhead the development of new businesses. With approximately 2,000MW of installed capacity between coal, combined-cycle and renewable plants, it will be Greeces largest independent utility, with potential to expand into other markets ...\n\n\nJun 28, 2007 Business Wire\n\n\n\nAcciona Acquires 1300 MW of Development Assets in Midwest\n\n\n\nCHICAGO--(BUSINESS WIRE)--Acciona, the worlds largest wind power developer, announced it has acquired exclusive rights to develop 1300 megawatts (MW) worth of wind assets in the states of Illinois, Iowa and Wisconsin. The development will take place through an acquisition of projects from EcoEnergy, LLC, an alternative energy solutions developer and a unit of The Morse Group.\n\n\nJun 28, 2007 Business Wire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}