{"category": "ham", "to_address": "Achim Zeileis <Achim.Zeileis@wu-wien.ac.at>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] When to use quasipoisson instead of poisson family", "body": "On Tue, 10 Apr 2007, Achim Zeileis wrote:\n\n> On Tue, 10 Apr 2007, ronggui wrote:\n>\n>> It seems that MASS suggest to judge on the basis of\n>> sum(residuals(mode,type=\"pearson\"))/df.residual(mode).\n\nNot really; that is the conventional moment estimator of overdispersion\nand it does not suffer from the severe biases the unreferenced estimate \nbelow has (and are illustrated in MASS).\n\n>> My question: Is\n>> there any rule of thumb of the cutpoiont value?\n>>\n>> The paper \"On the Use of Corrections for Overdispersion\"\n\nWhose paper?  It is churlish not to give credit, and unhelpful to your \nreaders not to give a proper citation.\n\n>> suggests overdispersion exists if the deviance is at least twice the \n>> number of degrees of freedom.\n\nOverdispersion _exists_:  'all models are wrong but some are useful' \n(G.E.P. Box).  The question is if it is important in your problem, not it \nif is detectable.\n\n> There are also formal tests for over-dispersion. I've implemented one for\n> a package which is not yet on CRAN (code/docs attached), another one is\n> implemented in odTest() in package \"pscl\". The latter also contains\n> further count data regression models which can deal with both\n> over-dispersion and excess zeros in count data. A vignette explaining the\n> tools is about to be released.\n\nThere are, but like formal tests for outliers I would not advise using \nthem, as you may get misleading inferences before they are significant, \nand they can reject when the inferences from the small model are perfectly \nadequate.\n\nIn general, it is a much better idea to expand your models to take account \nof the sorts of departures your anticipate rather than post-hoc test for \nthose departures and then if those tests do not fail hope that there is \nlittle effect on your inferences.\n\nThe moment estimator \\phi of over-dispersion gives you an indication of \nthe likely effects on your inferences: e.g. estimated standard errors are \nproportional to \\sqrt(\\phi).  Having standard errors which need inflating \nby 40% seems to indicate that the rule you quote is too optimistic (even \nwhen its estimator is reliable).\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}