{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "BBC Sport Newsletter <sport.online@ebs.bbc.co.uk>", "subject": "Welcome Inside Sport", "body": "\n\n\nBBC SPORT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBBC Daily E-mail\nOther e-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGABBY LOGAN, HOST OF INSIDE SPORT\nHello everyone,\n\nIt's an exciting day for me as tonight is the first edition of the new sports news magazine I'm presenting called INSIDE SPORT.  It's on BBC ONE at 2305 BST.\n\n\nOn tonight's show, I meet the Chelsea and England captain, John Terry. We both have twins and I was amazed as he told me about the moment his girlfriend gave birth - all I can say is \"Respect\" to that woman!  He also revealed his love of Lionel Richie and, more seriously, what his ambitions are once his playing days are over.\n\n\nAlso tonight, remember the three blondes in a boat who won Olympic Gold in Athens?  Well now they are rivals and competing against each other for the one place in the British sailing team for Beijing. We go to meet them and witness the battle on the high seas. \n\n\nAnd we've also got exclusive behind-the-scenes access to the king of world football, Fifa boss, Sepp Blatter, and the latest on South Africa's race to be ready for the 2010 World Cup.\n\n\nI'll be joined by our regular panellists Steve Bunce and Des Kelly - these boys are not known for being shy and retiring - to debate the week's talking points. And the BBC's Sports Editor, Mihir Bose, will be with us to give us his inside track on sporting stories.\n\n\nThere's also a competition - would you like to go to the first FA Cup final at Wembley? Two tickets could be yours.\n\n\nSo I hope you can join me tonight - don't forget I'm also back on BBC TWO next Sunday at 1230 BST - you can see the big interview again and lots more new stuff.\n\n\nGabby.\n\n\n\nGabby hosts Inside Sport on Monday 30 April, 2305 BST on BBC ONE, and second edition, 6 May, 1230 BST on BBC TWO.\n\nIf you miss the show, you can catch up on the best bits on the website, bbc.co.uk/insidesport\n\n\n\nCOMING UP THIS WEEK ON BBC SPORT...\n\n\nWORLD SNOOKER\n\nbbc.co.uk/snooker\n\nCoverage from the Crucible every day this week on BBC TWO (Monday and Tuesday 1330-1755, Wednesday 1400-1800, Thursday 1300-1800, Friday 1330-1800). \n\nYou can also watch coverage from both tables on BBCi via the red button and on the BBC Sport website from 1000-2300 throughout the tournament.\n\n\nSCRUM V\n\nbbc.co.uk/scrumv\n\nFri 1900-2100, BBC TWO Wales, BBCi and website\n\nNewport-Gwent Dragons v Connacht. Service available throughout the UK. Not available on Freeview.\n\n\n\n\n\n\n\n\nTHIS WEEKEND ON BBC SPORT\n All the TV and radio times\n\n\n\n\n\n\n\n\n\nFOOTBALL ON THE BBC\n bbc.co.uk/football \nSaturday\nFootball Focus (1210, BBC ONE); Premiership commentary (1245, Radio Five Live/online); Score (1430, BBCi & BBC Sport website); Premiership commentary (Radio Five Live/online); Final Score (1630, BBC ONE); Match of the Day (2230, BBC ONE).\nSunday\nMatch of the Day repeat (0735, BBC ONE); Score (1300-1500, BBCi); Match of the Day 2 (2230, BBC TWO).\n\n\n\n\n\n\nWORLD SNOOKER\n bbc.co.uk/snooker\nSaturday\n1000-2300, BBCi and website; 1300-1630, BBC ONE and website; 1630-1725, BBC TWO and website; 1900-2200, BBC TWO and website.\nSunday\nWorld Final 1500-1730, BBC TWO and website; 2000-2300, BBC TWO and website.\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tChoose which match to watch on BBCi via the red button, and the BBC Sport website throughout Saturday from 1000-2300.\n\t\t\t\t\t\n\n\n\n\n\nMORE SPORT ON THE BBC\n bbc.co.uk/tvandradio\nSaturday\nBadminton Horse Trials 1230-1630, BBC TWO and website; 1100-1415, BBCi. \nSunday\nMoto GP Live (0735-0900, BBC ONE); Inside Sport (1230-1315, BBC TWO); Moto GP (1500-1630, BBCi); Rugby Union: Premiership highlights (1315-1400, BBC TWO); Badminton Horse Trials, highlights and show jump live (1400-1500, BBC TWO and website).\n\n\n\n\n\n\n\n\n\n...AND ON THE WEBSITE THIS WEEK\n bbc.co.uk/sport\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\n\t\t\t\t\t\tbbc.co.uk/football\n Expert opinion ahead of all the big games\n\t\t\t\t\t\n\t\t\t\t\t\tInside Sport\n Competition details and exclusive online content\n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/sport_newsletter\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:sport.online@bbc.co.uk?subject=newsletter\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}