{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "accede: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Saturday, April 14, 2007\naccede \\ak-SEED\\, intransitive verb:\n1. To agree or assent; to give in to a request or demand.\n2. To become a party to an agreement, treaty, convention, etc.\n3. To attain an office or rank; to enter upon the duties of an office.\nWell, after much blustering and standing and sitting, he acceded to my demand. -- Alfred Alcorn, Murder in the Museum of Man\nJiang Zemin, the Chinese president, announced that China would accede to the Information Technology Agreement signed last winter, which will eliminate China's steep tariffs on imported computer and telecommunications equipment. -- John M. Broder, \"U.S. and China Reach Trade Pacts but Clash on Rights\", New York Times, October 30, 1997\nShe is looking down at him with a tender smile, as if he were a prince, Harry thinks, and she a servant, grateful to accede to his every whim. -- Millicent Dillon, Harry Gold\nAccede derives from Latin accedere, \"to approach, to accede,\" from ad-, \"toward, to\" + cedere, \"to move, to yield.\"\nDictionary.com Entry and Pronunciation for accede\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9291622-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}