{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "\"Ralph W. Reid\" <rreid@sunset.net>", "subject": "Re: Trying out Slackware", "body": "Slackware does have fewer 'pre-installed' packages than some other\ndistributions, but for some of us, just about everything actually\nneeded is there.  On the rare occasion when I have decided to add\nsomething to my system, I have compiled the new program from the\noriginal source.  At the moment, the only program I recall installing\nthis way was mplayer.  Everything else I needed seems to have already\nbeen included--I just needed to write an occasional script or small C\nor Ada program to use what was already available on the system.  I did\ncompile some adventure games from source some time ago, but whether I\n'needed' to add those to the system is somewhat debatable ;) .  Your\nrequirements may differ from mine--reviewing the distributions to find\nout which one seems to fulfill most of your needs out of the box is a\ngood idea.  Don't forget to look through the 'extras' directory in\nyour favorite Slackware distribution--you might find a package already\nset up there to handle your requirements.\n\nAs for making packages in Slackware, you can do this if you like so\nthat your packages can be installed, updated, or removed with the\nstandard Slackware package tools.  You will still have to get the\nsource code and compile it to create a complete package to be\ninstalled with installpkg, or perhaps you could just put your newly\ncompiled program in a place like /usr/local/bin without using any of\nthe package management tools.\n\nHTH, and have a great day.\n\nOn Sun, Jun 24, 2007 at 07:43:24PM -0700, Zachary Kline wrote:\n> Hiya,\n>     Since I don't technically have an actual computer running Linux to speak of, in some ways I have an advantage.  I'm able to try out new Linux distributions on the fly and as I become interested in them.  Today I tried out Slackware 11.0, and I really like it so far.  The only thing I have to get used to is the amount that comes preinstalled and the amount that isn't available.  There are far fewer packages in the Slackware repositories than in, say, the Gentoo Portage system or Debian's package databases.  But I don't know if this is a bad thing or not.\n>     That being said, could any of you Slackware veterans give me a tip or two?  What is the method for installing stuff that isn't in the Slackware package lists?  Do you compile from source, or make a Slackware package with makepkg?\n> Thanks,\n> Zack.\n> PS: I love BSD init.\n\n-- \nRalph.  N6BNO.  Wisdom comes from central processing, not from I/O.\nrreid@sunset.net  http://personalweb.sunset.net/~rreid\n...passing through The City of Internet at the speed of light...\nCIRCLE AREA = _pi * r ^ 2\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}