{"category": "ham", "to_address": "\"Charilaos Skiadas\" <skiadas@hanover.edu>", "from_address": "\"Greg Snow\" <Greg.Snow@intermountainmail.org>", "subject": "Re: [R] Reasons to Use R", "body": "For a previous version of SAS we had parts installed on each computer\nwhere it was used, but there were key pieces located on a network drive\n(not internet, but local network) such that if you tried to start SAS\nwhile someone else was using it you would get an error message.\n\nWe had troubles with the network, so now we have a full version\ninstalled on each computer, but the person in the company that is the\ncontact between us and SAS (my group has 1 licence, but the company as a\nwhole has several) checks up on us from time to time to make sure that\nwe stick within the 1 at a time guidelines (not hard, we mostly use\nother things) or pay for additional licences.\n\nS-PLUS has also had similar types of licences, I was teaching in a\ncomputer lab where all the computers could run S-PLUS, but once 5 people\nhad started S-PLUS, noone else could until someone else quite out of it\n(So we used R for that Class).  For S-PLUS 7 when I upgraded my computer\nand installed my licenced copy on the new computer, it disabled the copy\non my old computer.  This may have changed somewhat, because I remember\nthere being some complaints from people who legitimately installed it on\ntheir laptop, but it would not work when the laptop was not connected to\nthe internet.\n\nThere are a lot of different ways to try to enforce licence conditions\non software (and doing so is important for companies that want to make a\nprofit these days), unfortunately the current pendulum swing is making\nthing more inconvienient for the common user (at home I have some\nsoftware that we use to program my wife's sewing machines that can be\ninstalled on any computer, but only works if a hardware key is plugged\ninto a usb port).\n\n-- \nGregory (Greg) L. Snow Ph.D.\nStatistical Data Center\nIntermountain Healthcare\ngreg.snow@intermountainmail.org\n(801) 408-8111\n \n \n\n> -----Original Message-----\n> From: Charilaos Skiadas [mailto:skiadas@hanover.edu] \n> Sent: Monday, April 09, 2007 3:24 PM\n> To: Greg Snow\n> Cc: Gabor Grothendieck; Lorenzo Isella; R-Help list\n> Subject: Re: [R] Reasons to Use R\n> \n> On Apr 9, 2007, at 1:45 PM, Greg Snow wrote:\n> \n> > The licences keep changing, some have in the past but don't \n> now, some \n> > you can get an additional licence for home at a discounted \n> price. Some \n> > it depends on the type of licence you have at work \n> (currently our SAS \n> > licence is such that the 3 people in my group can all have it \n> > installed, but at most 1 can be using it at any 1 time, how \n> does that \n> > affect installing/using it at home).\n> \n> Hm, this intrigues me, it would seem to me that the only way \n> for SAS to check that only one of your colleagues uses it at \n> any given time would be to contact some sort of online \n> server. Does that mean that SAS can only be run when you have \n> internet access?\n> \n> Or is it simply a clause on the license, without any \"runtime checks\"?\n> \n> Haris Skiadas\n> Department of Mathematics and Computer Science Hanover College\n> \n> \n> \n> \n>\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}