{"category": "ham", "to_address": "debian-vote@lists.debian.org, debian-legal@lists.debian.org", "from_address": "Nathanael Nerode <neroden@fastmail.fm>", "subject": "Request for GR: clarifying the license text licensing / freeness issue", "body": "This is a proposed text for a GR.  I can't actually propose a GR (not a \nDD), so I request that someone else who cares propose it or a similar \nproposal.\n\n---begin proposed GR---\nResolved:\nThat the DFSG shall be amended, by inserting at the end of clause 3, in italics:\n\n(There is a special exception for the license texts and similar legal \ndocuments associated with works in Debian; modifications and derived \nworks of these legal texts do not need to be allowed.  This is a \ncompromise: the Debian group encourages authors of legal texts to \nallow derived works.)\n\nRationale:\nDebian is not in the business of shipping license texts; Debian does\nso only because this is necessary in order to ship other material.  Many\nof these license texts do not have licenses allowing the \ncreation of derivative license texts; the GPL is a prominent example.  \nWithout this exception, if the DFSG were followed literally, most \nlicense texts could not be shipped in Debian and would have to be \nshipped alongside Debian instead, which would be very annoying.\n\nHistorically, this exception has been an unwritten assumption; in most \ndiscussions, this exception has been agreed on by everyone involved.  \nHowever, unwritten exceptions are not really a good idea.\nIt is more honest and straightforward to Debian's users to state the\nexception outright.  Also, it prevents people from using this exception \nas an excuse to argue for other unwritten exceptions.  It is better to \nhave all exceptions upfront, so that Debian's users know exactly what\nthey are getting.\n\nHowever, Debian should encourage the licensing of license texts \nso that derivative license texts are allowed.  A license text which is a \nslight modification of an existing license text is substantially easier \nto analyse and deal with than a brand new license text.\n---end proposed GR---\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}