{"category": "spam", "to_address": "Wisdom <wisdom@flax24.uwaterloo.ca>", "from_address": "Amanda Cochran <anfukush@graybeaver.com>", "subject": "Can't find must-have meds at your local drug store?", "body": "\n\nGoing to have sex with two ladies at the same time? You need a strong erection, or they will have to satisfy each other. You really need Viagra!\nVisit us\nErectile Dysfunction is one of the most serious problems that a man can get in his life. The best cure nowadays are Viagra and Cialis.\nClick here\nCompletely conidential and secure purchase.\nWith best regards,\nAmanda Cochran\n \n \nEshche neskolko toroplivyh, lipnushchih namertvo: shelta, Gorod, pandemiia, Mutaciia, galty, galty, galty. Neponiatnaia sila vdrug szhala mne gorlo, i ia zadohnulsia, ne v silah Vygovorit ni slova. Chetyre desiatka voinov bezmolvno povtorili ego zhest, obediniaia svoi razumy v Obshchuiu mentalnuiu set. Ia ne proch uslyshat tvoiu istoriiu s samogo nachala, mne Prigodilas by liubaia dopolnitelnaia informaciia o shefire. \nPozzhe tak pozzhe. I tolko sejchas vyiasnilos, chto Chuzhak popal v mir Habusa soznatelno, presleduia kakuiu-to svoiu cel. Sovershenno protivoestestvennaia. On ne vidit dalshe sobstvennogo nosa, a mne Kak budto bolshe nechego delat, kak ispravliat chuzhie oshibki. Imenno ot boli ia nachal prihodit v sebia bystree. Esli ne bylo znamenij, esli Krug Prichastiia ne Zval tebia v svoe lono lichno, posylaia veshchie sny, da eshche otsutstvovali Priznaki To i nechego bylo tuda sovatsia v nadezhde na to, chto on vdrug priznaet tebia svoim Zabludshim synom. Zlo by ego zadralo, kakimi zdes eshche Delami mozhno zanimatsia? Ia razdrazhenno podhvatil emkost s sidenia i glotnul Napitka. A teper bystro otsiuda. \nU menia byl shans s nim Spravitsia, pust dazhe on schitaet inache. Tot lezhal na spine i nenavidiashchim vzgliadom sledil za Ego priblizheniem. Dazhe zimoj. Na etot raz v ego slovah ne chuvstvovalos falshi. ejisuminyon Q1FUW1pVckRcUFBGHUFCUEZWRlleXR1XVA==\n \n\n\n"}