{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "\"CBS Space News\" <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "4/11 1145a Update: CBS SPACE NEWS EMAIL ADVISORY", "body": "\n\n\n\n\n4/11 1145a Update: CBS SPACE NEWS EMAIL ADVISORY\n\n\n\n=================================\n\nDear CBS Space News Subscriber:\n\nHi. Please take a moment to read this note.\n\nWe are still trying to troubleshoot problems with our new email system. If you received a CBS News space update 4/10 on NASA's decision to move the shuttle Discovery's launch to June 8, tank repairs permitting, please disregard this message and do NOT reply! Thanks!\n\nIf you did NOT receive the 4/10 update from the new system, please read on...\n\nCBS News recently switched to a new email system. Some space news subscribers reported they had been dropped from the new system and were no longer receiving updates. I sent out an advisory earlier this year using the old email system - the same one used to send this note - and asked readers who were NOT getting updates to let me know so we could troubleshoot the problem.\n\nThe results were not as clear cut as I had hoped. Some readers clearly had been dropped from the list. But I only filed a few updates in January, February and March and some other readers apparently confused the lower-than-normal number of updates with an email problem. I no doubt added to the confusion when, by accident, I filed an update or two using the old system. That may have led some readers to believe they were back on the list when, in fact, they were not.\n\nIn any case, the old system is being phased out and I would like to make one more attempt to identify readers who have clearly been dropped from the list so we can fix it. So...\n\n1. If you received the 4/10 shuttle update, you are on the new email list and no action is required. Please don't reply to this note!\n\n2. If you did NOT receive the 4/10 update, please send me a note and we'll make another attempt to straighten things out.\n\nMy sincere apologies for the confusion. I truly appreciate everyone's patience. Again, please DO NOT REPLY if you received the 4/10 update!\n\nRegards,\n\nBill Harwood\nCBS News Space Analyst\n\nbharwood@earthlink.net\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}