{"category": "ham", "to_address": "speakup@braille.uwo.ca", "from_address": "Shane <shane-keyword-speakup.aca783@cm.nu>", "subject": "[ot] accessible htpc for sale", "body": "Hi,\n\nSelling my Media PC and thought it might be of interest to\nfolks here due to the accessibility features.  The system\nis an HTPC, meaning it is meant to live in with the TV,\nStereo etc.  It's quite small and will fit nicely into a\nstereo stand measuring 14.6w x 2.1h x 12.1d inches.  It\nruns fanless so can be operated completely silent depending\non whether the hard drive sleeps.  I can't hear the drive\nbehind the glass of my cabinet though so isn't really an\nissue.  The system has good a/v connectivity, connects to\nthe television or AV receiver via s-video cable and rca\nanalogue or spdif audio for 5.1 output.  The remote\nreceiver connects via usb and also has little transmitter\nhookups for lirc control of other AV components.  For\nexample: I had the machine learn my AV receiver's remote\nand when the system boots up, it'll automatically switch\nthe amp to the appropriate AV source.  It has a 40GB hard\ndrive installed which can be upgraded.  I've never really\nseen the need though as Media can be easily mounted and\nstreamed via NFS.  The onboard network is 10/100 mbit which\nis enough to stream DVD images over the lan.  More info on\nthe hardware can be found here.\nhttp://cgi.ebay.ca/ws/eBayISAPI.dll?ViewItem&item=200106215753\n\nIt was configured with the Via Epia sp 13000 1.3ghz option. \nDefault memory was upgraded to 512mb and the cdrom was\nremoved altogether.  Meaning if you wipe the hard drive,\nyou need to do a fresh install via usb flash or my personal\nchoice, networked PXE.\n\nOn the software side, the system is usable by both sited\nand blind people.  On bootup, it goes into the Freevo media\ncentre where one can play music, watch movies, listen to\nweb radio etc.  I've modified freevo to speak the menus\nthough as navigated by the remote so most things will talk,\nactual menus, directory listings etc.  Dialogues do not\nthough but they are rarely used.  The shutdown dialogue is\none example but it isn't used, just walk up to the machine\nand hit the button and it'll do a controled shutdown. \nDistribution used is Debian with access via ssh remotely.\n\nPaid over $900cdn new, asking $550usd or $600 cdn includes\nshipping for Canada or the US.  Subtract $50 if you can\npick it up in the Vancouver area.\n\nBest,\nShane\n\n-- \nhttp://www.cm.nu/~shane/\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}