{"category": "ham", "to_address": "\"avcavc\" <ktwarwic@speedy.uwaterloo.ca>", "from_address": "\"AccuWeather.com Alert\" <inbox@messaging.accuweather.com>", "subject": "AccuWeather.com Alert(tm) Advisory  (avcavc)", "body": "\n\nAccuWeather.com Alert[TM]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\t\t\t\t\t\t\tSevere Watches and Warnings for BEVERLY HILLS \n\n\n\n\n\n\n\n\n\n\n\n\n\nLOXCFWLOX\r\nWHUS46 KLOX 120425\r\nCFWLOX\r\n\nCOASTAL HAZARD MESSAGE\r\nNATIONAL WEATHER SERVICE LOS ANGELES/OXNARD CA\r\n925 PM PDT WED APR 11 2007\r\n\n..HIGH SURF CONTINUES ON SOUTHWEST FACING BEACHES OF SOUTHERN\r\nCALIFORNIA...\r\n\nSTRONG WEST TO NORTHWEST FLOW OVER THE COASTAL WATERS WILL GENERATE\r\nA SOMEWHAT LARGE WESTERLY SWELL. IN ADDITION...A MODERATE SOUTHERLY\r\nSWELL FROM A PREVIOUS STORM IN THE SOUTHERN HEMISPHERE CONTINUES TO\r\nIMPACT THE AREA. THIS COMBINATION OF WESTERLY AND SOUTHERLY SWELLS\r\nWILL PRODUCE HIGH SURF ALONG THE EXPOSED SOUTHWEST FACING BEACHES OF\r\nSOUTHERN CALIFORNIA THROUGH THURSDAY NIGHT.\r\n\nCAZ040-041-121100-\r\n/O.CON.KLOX.SU.Y.0006.000000T0000Z-070413T0600Z/\r\nVENTURA COUNTY COAST-\r\nLOS ANGELES COUNTY COAST INCLUDING DOWNTOWN LOS ANGELES-\r\n925 PM PDT WED APR 11 2007\r\n\n..HIGH SURF ADVISORY REMAINS IN EFFECT UNTIL 11 PM PDT THURSDAY...\r\n\nTHE NATIONAL WEATHER SERVICE IN LOS ANGELES/OXNARD HAS CONTINUED A\r\nHIGH SURF ADVISORY FOR THE BEACHES OF LOS ANGELES AND VENTURA\r\nCOUNTY. THIS ADVISORY REMAINS IN EFFECT UNTIL 11 PM PDT THURSDAY.\r\n\nFIVE TO SEVEN FOOT BREAKERS ARE EXPECTED TO CONTINUE AT THE\r\nBEACHES OF LOS ANGELES AND VENTURA COUNTY...ESPECIALLY AT FAVORABLY\r\nEXPOSED SOUTHWEST FACING BEACHES THROUGH THURSDAY NIGHT. MAX SETS\r\nUP TO EIGHT FEET POSSIBLE. SURF WILL PEAK AGAIN THURSDAY AFTERNOON\r\nAND EVENING AS A WIND DRIVEN SWELL IS COMBINED WITH GUSTY WINDS\r\nNEAR AND ALONG THE SHORELINE. THE COMBINATION OF HIGH SURF WITH\r\nTHE NORTHWEST AND SOUTHWEST SWELLS WILL ALSO PRODUCE DANGEROUS\r\nRIP CURRENTS ALONG THE BEACHES OF LOS ANGELES AND VENTURA\r\nCOUNTIES. SURF WILL BEGIN TO SUBSIDE THURSDAY NIGHT.\r\n\n$$\r\n\nHALL\n\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose another forecast:\n\t\t\t\t\t\t\t\t\t\tEnter a zipcode, or a city, state\n  \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n©2007\n\t\t\t\t\t\t\tAccuWeather, Inc. All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}