{"category": "ham", "to_address": "avcooper@speedy.uwaterloo.ca", "from_address": "Timothy Lutts <TimothyLutts@cabotwealth.com>", "subject": "Cabot Wealth Advisory 4/19/07 - Future's So Bright I've Got to Wear Shades", "body": "April 19, 2007\n\nSalem, Massachusetts\n\nBy Timothy Lutts\n\n-----\n\nFeaturing Lutts' Logic:\n\nStill High on Solar Power Stocks\n\nNumbers, Words and Charts Working Together\n\nA Very Big, Very Expensive Tunnel\n\n-----\n\nThe Dow hit an all-time high yesterday.  The Nasdaq is just a stone's\nthrow from topping its February highs, though still far below its 2000\npeaks.  All our Cabot trend-following market-timing indicators are\npositive.  And all our measures of the market's internal strength reveal a\nbroad strong bull market.  In short, it's a great time to be invested. \nAnd the market's strongest sector is . . . solar power stocks.\n\nBut this is not an easy fact to learn from the traditional media.   \nThe problem is that the solar sector is so young and small that it's\nlumped in with the broad \"alternative energy\" sector. Or, as our\ninstitutional software program terms it, \"Energy - Other.\"  And the fact\nis, some of the stocks in that broad sector stink.  The companies they\nrepresent are under-funded, or their technologies are just not in demand\nby the market, so they drag down the group.\n\nSo the traditional media don't tell you that solar power is hot. They tell\nthat the Dow is at new highs, that Bristol-Myers' blood pressure drug may\nbe approved for wider use, and that J.C. Penney is going to open a store\nin New York.  Useless information?  Probably.   \n\nSo you go to CNN and click on \"hot stocks\" and the first four headlines\nare about IBM, Intel, JP Morgan Chase and Motorola.  Those aren't hot\nstocks!\n\nNo, if you want to make really big money, you've got to buy stocks that\nmost investors aren't following.  And you've got to focus on the\nfastest-growing stocks in the market today, like those in the solar power\nindustry.\n\nMost of our Cabot publications are already recommending stocks in this\nsector, and early investors are off to a great start.  But some newer\nreaders have asked me in recent days if there is a mutual fund or ETF they\ncan invest in instead, so that they can get the benefit of the sector's\nstrength but avoid the risk that comes from investing in just one or two\nstocks.\n\nSome, in fact, have found the one find most likely to do so - it's\nPowerShares WilderHill Clean Energy (symbol PBW) - and asked what I think\nabout it.\n\nSo here you go.  WilderHill Clean Energy holds 43 stocks.  These include a\nbunch of solar stocks, some fuel cell stocks, wind-power stocks,\nchipmakers that make the brains for these machines, and more.  It's still\na small fund, and many of its holding are small companies - low priced -\nbecause this is such a young industry.  The fund is just two years old and\noverall, it's done a little better than the S&P 500.  Last year it\nunderperformed by 8% and this year it's ahead by 8%.\n\nLooking at Morningstar, however, to get a picture of actual investor\nreturns (calculated by weighing the impact of cash flows in and out of the\nfund), we see that while the fund gained 7.5% in 2006, the \"average\"\ninvestor in the fund lost 14%.\n\nTrouble is, the average investor puts money into the market after the\nmarket is already up, and takes it out after the market is down.   \n\nIt's human nature, and it not only means that it's hard for the individual\ninvestor to make money in the fund, it also means it makes it harder for\nthe fund manager to make money with his fund.  Ideally, he'd love you to\ngive him money at market bottoms, when bargains abound, and then take it\naway at tops, when stocks are expensive.   \n\nBetter yet, he'd like you to simply leave it there year after year.   \nBut investors don't do that, especially when they're dabbling in hot funds\nlike this.\n\nBottom line.  If you're going to invest in a mutual fund, take care to buy\nearly in the uptrend, and sell when the trend is over, because these funds\ncan quickly take away your money when the trend turns down.\n\nBut better than mutual funds, in my opinion, is a concentrated basket of\nstocks, chosen for their strength and their fundamental prospects, and\nmonitored carefully on a daily basis.\n\nI've written about a number of the most attractive solar power companies\nin recent issues, and the ones we're following most closely are First\nSolar (FSLR) and Trina Solar (TSL).  These are not stocks for widows and\norphans; they can give fast and they can take away fast.  But their\nlong-term prospects are excellent given the enormous market opportunity\nposed by the world's growing desire to curb fossil-fuel emissions, so we\nthink they're worth an investment . . . at the right time.  And sometimes,\ntiming is everything!\n\n----- ADVERTISEMENT -----\n\nTop 5 Alternative Energy Picks for 2007: Free Special Report\n\nHigh oil prices and global demand for clean energy are driving up stock\nprices for alternative energy firms. Get the top 5 picks in the free\nspecial report from Rising Star Stocks. One of these firms is up 80% since\nFebruary 1st and the others are on the move. Click here for your copy\ntoday and tap into this mega-trend.\n\nhttp://cabotmail.net/t/161241/13148861/87/0/\n-----\n\nOn a lighter note, I spent the past weekend playing 15 games of Scrabble\nat a hotel in Westford, Massachusetts, at the 23rd annual Boston Area\nTournament (BAT), with 211 other like-minded souls, including many\nnational and world champions.\n\nThis is not your typical living room Scrabble game; it features timers\nlike chess, and we all have national rankings, just like chess players. \nBut where chess is a universal game, Scrabble (obviously) is a\nlanguage-dependent game.  I play because it's fun, because I love words,\nbecause I'm competitive, and because in this group I can play against\npeople of similar abilities.\n\nThis time, I won 9 games and lost 6, and here are my best plays: PETULANT\nfor 72 points, GEEZERS (dumping three Es) for 51 points, DECORATE for 65\npoints, BONNIER for 66 points, QANAT (a wonderful U-less Q word) for 34\npoints, RELATERS for 59 points, ARMBAND for 78 points, ERADIATE for 63\npoints, OUTRIDE for 77 points, LEISURE for 65 points, ISOBAR for 27\npoints, DESCENT for 76 points, TOURIST for 75 points and RERAISE for 63\npoints . . . a woman who wasn't a poker player challenged that one!\n\nAnd how is this related to investing?\n\nWell, over years, I've observed that there are word people, chart people\nand number people.  Sure, most of us speak all three languages, but we all\nhave our strengths and weaknesses.  My strength, noted above, is words.  I\nlike charts a lot, too.  And my weakest suit is numbers.\n\nMy father's strength is charts.  I remember him poring over the chart\nbooks published by Securities Research for hours at a time, finding\npromising new stocks by hunting for strong RP (relative performance)\nlines.  RP is at the heart of our Cabot Top Ten system, and that's a great\nplace to find new investment ideas.  But my father doesn't pore over chart\nbooks any more; he now uses TeleChart and WONDA; these online products are\nalways up to date, while his old chart books - published monthly - were\nout of date before they arrived in the mail!\n\nRoy Ward, editor of Cabot Benjamin Graham Value Report, is a numbers guy. \nHe doesn't love any individual stocks; he loves the numbers that guide his\ndecision-making process.  (I love the great results this cold, calculated\nmethod brings.)  Roy recommended American International Group, for\nexample, back in December, when it was 70, writing, \"AIG shares have\ndeclined by 30% from their all-time high and now sell at only 11.5 times\nforward (next 12 months) earnings.   \nWe highly recommend you purchase AG at current price levels in\nanticipation of achieving our Min Sell Price of $116.32 within two to\nthree years.\"\n\nI remember that I liked reading that, and not just because of the numbers.\n I liked the fact that AIG, which is America's largest insurance company\nand has a great long-term growth record, was being shunned by investors\nfor two temporary factors.  The first was hurricane-related losses.  The\nsecond, touching a far more emotional chord in investors, was the misdeeds\nof long-time president Hank Greenberg, who didn't play by the rules, got\ncaught by the SEC and the Attorney General of New York, and was forced out\nas president in February 2005.  The final chapter in that story came in\nFebruary 9, 2006, when AIG paid a fine of $1.6 billion.\n\nPeople still loathe Greenberg today, and, by extension, his old company. \nBut AIG is clean as a whistle, and working hard to stay that way.\n\nWhich brings us to the final piece of the puzzle, the chart.  A long-term\nview reveals that AIG has been building a long base since 1999 hovering\naround the 70 level.  That base has become tighter in recent years, and\nthis year I've been encouraged to see the stock find support at its 50-day\nmoving average, which is now at 66 and rising slowly.  In fact, I've just\nseen five big days of buying, coincident with the Dow's recent strength.\n\nConclusion: AIG not a hot stock yet, and may never be, but I think it can\nbe a very good stock.  Roy says it's a great value, contrary opinion says\nthere's great room for investor opinion to improve, and the chart shows\nsigns that the smart money is already buying.\n\nNumbers, words and charts, all adding up to what I think is a good buy on\nan important American company.\n\n-----\n\nEditor's Note\n\nIf you're attracted to a sensible, number-based, low-risk system of\ninvesting in undervalued stocks, you need a trial subscription to Cabot\nBenjamin Graham Value Letter.  Using the same system that was developed by\nBenjamin Graham and refined by Warren Buffet, the Letter is perfect for\ninvestors who don't want to be glued to the market day after day, who want\ninvestments that can mature steadily and safely.   \nTo get started, simply click the link below.\n\nhttp://cabotmail.net/t/161241/13148861/79/0/\n\n-----\nFinally, a very big idea, with some very big numbers.  An arm of the\nRussian government yesterday unveiled a plan to build a tunnel between\nSiberia and Alaska under the Bering Strait, explaining that it could carry\nRussian oil, natural gas and electricity to the U.S.   \nThe cost . . . $65 billion!  Interestingly, the tunnel itself would cost\nonly $10 to $12 billion; the bulk of the money would go towards building\nrailways between both ends of the tunnel and existing transportation\nfacilities.\n\nThe idea is not new; but while earlier motives have been political, the\nmotive this time is economic, and that means it has a chance of going\nthrough.\n\nI remember when the \"Chunnel\" under the English Channel was built, a\nprocess that lasted from 1984 to 1994.  In fact, I was attracted the stock\nof Eurotunnel when it came public, reasoning the tunnel would accelerate\ncommerce between England and France, and thus make a lot of money for\nshareholders.  But I was wrong.  What happened were delays, cash\nshortfalls and mismanagement.  In the end, the cost of the tunnel was six\ntimes original projections (no surprise to those of us in Massachusetts\nwho watched the cost overruns of Boston's Big Dig).  But traffic today is\njust one-third original projections.\n\nEurotunnel has already been through restructuring once and is now in\ndanger of falling into bankruptcy again.\n\nBottom line: If you get a chance to invest in this new Russian venture, I\nsuggest you decline.\n\n\nYours in pursuit of wisdom and wealth,\n\nTimothy Lutts\nPublisher\nCabot Wealth Advisory\n\n-----\n\nCabot Wealth Advisory, a free thrice-weekly e-mail service brought to you\nby the Cabot family of investment newsletters. To learn more or subscribe,\nsee: http://www.cabotwealth.com\n\nAre you having trouble receiving your Cabot Wealth Advisory?  You can\nensure its arrival in your mailbox here:\nhttp://www.cabotwealth.com/whitelist\n\nTo learn more about Tim Lutts, visit our site:\nhttp://www.cabotwealth.com/lutts\n\nWe appreciate your feedback. Follow the link below to fill out our survey:\nhttp://mail.cabot-online.com/subscribe/survey?f=448\n\nOur writers and contributors welcome your questions and comments. If you\nhave a particular area of expertise you'd like to share insight on, we'd\nlove to hear it. Simply reply to this e-mail with the word 'Question' or \n'Comment' in the subject of your reply. \n\nThe reply address is not for issues regarding customer service...you may\nor may not receive a reply. If we include any of your comments, we'll\ncredit you, of course. If you wish to remain anonymous, we'll protect your\nprivacy.\n\nFor customer service issues, you can email us at customerservice@cabotwealth.com\n\n---\n\nPlease note: We sent this e-mail to: avcooper@speedy.uwaterloo.ca because you subscribed\nto this service.\n\nTo end your Cabot Wealth Advisory e-mail subscription, visit this address:\n\n http://mail.cabot-online.com/u?id=13148861R&o=161241&l=cwa-eletter\n\nTo cancel by mail or for any other subscription issues, write us at:\n   \nCabot Heritage Corporation\nP.O. Box 2049\n176 North Street \nSalem, MA 01970\n\n---\n\nALL CONTENTS OF THIS E-MAIL ARE COPYRIGHT 2007 BY CABOT HERITAGE\nCORPORATION. ALL RIGHTS RESERVED: REPRODUCING ANY PART OF THIS DOCUMENT IS\nPROHIBITED WITHOUT THE EXPRESS WRITTEN CONSENT OF CABOT HERITAGE\nCORPORATION.\n\nProtected by U.S. Copyright Law {Title 17 U.S.C. Section 101 et seq.,\nTitle 18 U.S.C. Section 2319}: Infringements can be punishable by up to\nfive years in prison and $250,000 in fines.\n\nLEGAL DISCLAIMER:  Neither Cabot Heritage Corporation nor its\nemployees are compensated in any way by the companies whose stocks we\nrecommend.  We may or may not buy and sell securities mentioned.\nSources of information are believed to be reliable, but they are in no\nway guaranteed to be complete or without error. Recommendations,\nopinions or suggestions are given with the understanding that readers\nacting on information assume all risks involved.\n\n"}