{"category": "ham", "to_address": "Zombie Warwick <ktwarwic@speedy.uwaterloo.ca>", "from_address": "Doctor Dictionary <doctor@dictionary.com>", "subject": "apostasy: Dictionary.com Word of the Day", "body": "\n\n\nWord of the Day\n\n\n\n\n\n\n101 Questions Answered!\n\nWhat is Hezbollah? What are stem cells?\nHow'd those swimsuits get so skimpy?\n\nClick here for the KnowledgeNews answers\nADVERTISEMENT\nWord of the Day for Saturday, April 21, 2007\napostasy \\uh-POS-tuh-see\\, noun:\nTotal desertion or departure from one's faith, principles, or party.\nParty loyalty was fierce, political apostasy despised, and breakaway movements and third parties rarely exercised more than temporary influence. -- Edward Ranson, \"Electing a president 1896\", History Today, October 1, 1996\nThe French were advancing the holy cause of liberty; any American who criticized them was guilty of \"apostasy\" and \"heresies.\" -- Richard Brookhiser, \"In Love With Revolution\", New York Times, November 17, 1996\nNo sooner did it become clear that this was how I really felt, and that I fully intended to carry on with the war I had started against those ideas, than the exculpatory explanation for my apostasy was dropped, and in its place came shock and a deep sense of betrayal. -- Norman Podhoretz, Ex-Friends\nApostasy is derived from Greek apostasis, \"a standing away from, a defection, a revolt,\" from aphistanai, \"to stand off or away from, to revolt,\" from apo-, \"from, away from\" + histanai, \"to stand.\"\nDictionary.com Entry and Pronunciation for apostasy\nYesterday's Word - Previous Words - Help\n\nFocused Career Training. Train for a new career at a campus near you. Request free information.\n\nADVERTISEMENT\n\n\n\nDictionary.com Word of the Dayhttp://www.dictionary.com/wordoftheday/\nYou are currently subscribed toDictionary.com Word of the Dayas: ktwarwic@speedy.uwaterloo.ca\n\nTo unsubscribe via email,send a blank message to:leave-9374696-5491332K@lists.lexico.com\nTo subscribe to Word of the Day by email,please send a blank message to:join-wordoftheday@lists.lexico.com\n\n©2006 by Lexico Publishing Group, LLC.65 Pine Ave, #319Long Beach, CA 90802\nSubscriptions to The Word of the Daycan be turned on and off via the Web athttp://www.dictionary.com/wordoftheday/list/\n\n\nTell a friend about The Word of the Day!\n\n\n\n"}