{"category": "spam", "to_address": "cruiseca@speedy.uwaterloo.ca", "from_address": "\"Important Ulcer Info\" <return@samstandingsoon.com>", "subject": "Important Info about Ulcerative Colitis", "body": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHelp gain control of your condition\n \n\t\t\t\t\twith more information\n\nDid you know that approximately 500,000 Americans are currently diagnosed with ulcerative colitis? \n\t\t\t\t\tLiving with this condition can, without a doubt, be physically and emotionally taxing. The recurring \n\t\t\t\t\tabdominal pain, diarrhea and rectal bleeding are certainly challenging. By \n\t\t\t\t\tbecoming more informed you \n\t\t\t\t\tcan take steps to help gain more control of your condition. Also, knowing more about ulcerative colitis \n\t\t\t\t\tmay help make conversations with your doctor easier. A good place to start is \n\t\t\t\t\tthe relationship between your emotions and your condition.\n\nLearn more at \n\t\t\t\t\tManaging UC\nManaging UC was created to help you get the facts that you need to partner with your doctor and/or healthcare teams. \n\t\t\t\t\tWhen you visit Managing UC, you will receive information about:\n\t\t\t\t\t\nThe relationship between stress and the condition\n\t\t\t\t\tWhat you can do to help you stay in control\n\t\t\t\t\tWhere to go to get more help\n\t\t\t\t\t\nIf you are living with ulcerative colitis, go to Managing UC today to start taking an active role in gaining control of \n\t\t\t\t\tyour condition. Visit This Site for information at \n\t\t\t\t\tManaging UC!\n\n\n\n\n\n\n\n\n\n\nIf you prefer not to receive future Managing UC e-mails, To stop receiving announcements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site is strictly intended for U.S. residents and is governed solely by U.S. laws and governmental \n\t\tregulations. Please see our online privacy policy for more                                 information.\nWhile Shire US Inc. makes reasonable efforts to include accurate, up-to-date information on the site, \n\t\tShire US Inc. makes no warranties or representations as to its accuracy. Shire US Inc. assumes no liability for any errors or \n\t\tomissions in the content of the site.\n\n\n\n\n\n\n\n\n\n\n© 2006 Shire US Inc. Wayne, PA 19087 (800) 828-2088. All rights reserved. GI158  06/06\n\n\n\n\n\n\n\n\n\n\n\n\n\n______________________________________________________\n\n\n\n"}