{"category": "spam", "to_address": "Captains <captains@flax24.uwaterloo.ca>", "from_address": "Renee Rocha <lipl@global-soft.net>", "subject": "Master Penis", "body": "\n\nLooking for an effective and cheap solution? Tired with your sexual problems? \nClick here to be the best lover in the world!\nBuy the most wanted pills at LOW prices! Viagra, Levitra, Phentermine etc. Find any pill you need in our shop!\nEverything for your sexual health\nMake secure and confidential purchases. Nobody will know that you are using medications.\nWith best regards,\nRenee Rocha\n \n \nV Obshchem, mozhno schitat, chto tvoe ispytanie sliianiem udalos na slavu. Eto kogda to, chto boltaetsia mezhdu nog, iz-za Briuha vidish tolko v zerkale. Ia Spotknulsia o kochku, poterial ravnovesie i upal, udarivshis o zemliu vsem Telom, ne sumev sgruppirovatsia iz-za zatumanennogo soznaniia. Kak eto proishodit? Poniatiia ne imeiu. \nNo skazano bylo silno. Shustro rabotaiut mecherukie rebiatishki, nichego ne skazhesh. Kvin zametil vzgliad, kotorym Stilen neodobritelno odaril podsotnika, no Vsluh mag vozrazhat protiv takih dejstvij ne stal. Po Spravedlivosti, zamknut ty dolzhen byl menia. tolstiachok pozhal plechami. Eto chto, podvid sheltian? Kak ia vizhu, vse uladilos? hmyknul Celitel, podruliv sboku. Izobraziv na lice Merzopakostnuiu uhmylku otricatelnogo geroia, ia otstupil na shag, vyudil za Neimeniem luchshego iz nagrudnogo karmana kurtki nosovoj platok, smial ego v Komok i shvyrnul v tuchku. A vse-taki zhal diadku. \nNa tonkih, bezuprechnoj formy gubah Shefira igrala privetlivaia ulybka, a obrashchennye ko mne glaza neobyknovenno Chistoj, zavorazhivaiushchej sinevy istochali radushie. Poetomu Zabvenie prodolzhilos, no teper uzhe so storony civilizovannogo mira. Kvin brosil bystryj vzgliad na Altaresa po licu maga, Perekoshennomu urodlivoj sudorogoj boli ot zapredelnogo usiliia, bezhali krupnye Kapli pota, sryvaias s nosa i podborodka, vzmokshie volosy tozhe potemneli. Ia videl to, chto, vozmozhno, ne Videli dazhe magi. ejisuminyon UkBDVVlcV0F0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}