{"category": "ham", "to_address": "beginners@perl.org", "from_address": "Paul Lalli <mritty@gmail.com>", "subject": "Re: Why must I chomp a variable set in a script?", "body": "On Jun 18, 8:48 am, numberw...@gmail.com (Jefferson Kirkland) wrote:\n\n>     my $emailBody = $prefix . \"emailbody\";\n\n> The problem is when I get down to the part after the emailbody files are\n> populated ( they are only populated if files exist) that checks to see if\n> the files are of zero size.  If they are of zero size, it is supposed to put\n> a message into the log file saying there are no files for that directory.\n> If they have size (which means they have a message for the distribution\n> list, it is supposed to trigger the email program to notify the users.  Here\n> is the code that wasn't working:\n>\n>     if(-z $emailBody)\n>     {\n>         print LOGFILE (\"No files found in $dir \\n\");\n>     }\n>     else\n>     {\n>         print LOGFILE (\"Files found in $dir.  Sending email to distribution\n> list. \\n\");\n>\n>         $subject = \"Files To Retrieve In Directory: $dir \\n\";\n>         $recipients = $prefix . \"Emails.txt\";\n>\n>         `email program trigger`;\n>     }\n>\n> I know that I said \"wasn't\" in my last statement.  One of my colleagues\n> discovered that if he puts a \"chomp($emailBody);\" right before this\n> statement that it seems to work just fine instead of failing.   Now, as I\n> mentioned the code before this that checks if the file exists, using THE\n> SAME variable works fine.  Why would I now, at this point, only a dozen\n> lines later, have to \"chomp\" the variable to get this to work?  It isn't\n> like the value was supplied from the command line, it is set in the script.\n> Granted, it is inside of a foreach loop that is cycling through the\n> different directories and setting the variable per the directory, but it is\n> all done in the script.\n>\n> Does anyone have any idea why this would have to be chomped at this stage of\n> the script?\n\nThere's no reason, from what you've told us.  chomp() would have no\neffect on that variable, as it doesn't end in a newline.  My guess is\nthat either you're leaving out an important detail for the sake of\nbrevity, or your coworker changed something else too, but mistakenly\nbelieved it was the chomp() that solved the problem.\n\nCan you create a short-but-complete script that demonstrates the\noriginal failure, and then a version that has only the additional\nchomp() line inserted but suddenly works correctly?\n\nAlso, what is meant by \"it doesn't work\" in your question?  What did\nnot work?  How did it not work?  What errors did you receive?\n\nPaul Lalli\n\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}