{"category": "ham", "to_address": "\"Paul Johnson\" <paul@pjcj.net>", "from_address": "\"Chas Owens\" <chas.owens@gmail.com>", "subject": "Re: Nested loop", "body": "On 4/20/07, Paul Johnson  wrote:\nsnip\n> > The grep clearly states that I am looking for something and its block\n> > tells me what the criteria are.\n>\n> There are times where this list needs webctams.  I'd love to have been\n> able to have seen you as you wrote that since I find it hard to believe\n> that anyone could have done so whilst keeping a straight face ;-)\n\nNo, I really do think it is better code that expresses the intent;\nhowever, I don't like the goal behind code in the first place.  How\noften do you take each third element of list?  If you are doing that\nthen you are most likely doing something else wrong farther up in your\ncode.\n\n>\n> I presume that in your second example you should really be comparing\n> against\n>\n>   for (my $i = 0; $i < 10; $i += 3) {\n>       func($i);\n>   }\n>\n> which just seems so much clearer to me.\n\nif your goal is to produce 0, 3, 6, and 9 then yes, it is somewhat\nclearer, but the very fact the you have a 10 there instead of a 9\npoints to the off-by-one errors that tend to plague the C-style for\nloop.  Unfortunately we will have to wait until Perl 6 for the better\nsolution:\n\nfor 0 .. 9 : by 3 -> $i {}\n\n> Fortunately, TIMTOWTDI, but with any luck I won't be maintaining your\n> code ;-)\n\nI probably wouldn't write that code.  I would fix whatever was causing\nme to have to take every third element of a list.\n\n>\n> Anyway, there seems to be a little confusion about whether for or\n> foreach were going to be removed from the language.  The main point I\n> wanted to make was that foreach is not going away.  Neither is for.  At\n> least, not in Perl5, which will still be around for a long time.  They\n> are still synonyms, and any code written now and using either of these\n> constructs will continue to work under all Perl5 releases.\n\nThe trend going forward is to do away with foreach in favor of for, so\nthe question becomes \"is there any good reason to type four more\nletters?\"\n\n>\n> --\n> Paul Johnson - paul@pjcj.net\n> http://www.pjcj.net\n>\n\n-- \nTo unsubscribe, e-mail: beginners-unsubscribe@perl.org\nFor additional commands, e-mail: beginners-help@perl.org\nhttp://learn.perl.org/\n\n\n"}