{"category": "ham", "to_address": "Joe Smith <unknown_kev_cat@hotmail.com>", "from_address": "\"Suraj N. Kurapati\" <skurapat@ucsc.edu>", "subject": "Re: Redistribution with multiple licenses", "body": "Joe Smith wrote:\n> \"Suraj N. Kurapati\" wrote:\n>> So when I appended bsd.c to mit.c, did the entire mit.c become \n>> licensed under both licenses?  That is, did the originally-MIT \n>> portions of mit.c inherit the extra condition from the BSD\n>> license?\n> \n> That is an easy way to view it. Technically, what you had said\n> before is perfectly correct, but thinking of the file as being\n> licenced under the combination of the conditions is also\n> perfectly valid (as long as you realize that if the parts are\n> seperated, the original lices still apply, of course).\n> \n> In summary, just make sure you meet all the terms of both, and\n> you are fine.\n\nThanks for the clarification. So far I have learned that:\n\n1. A container is governed by all the licenses of its contained items.\n\nThis is easy to see when the container is a tarball and the\ncontained items are disjoint files (mit.c and bsd.c).\n\nHowever, the same rule also applies when the container is a file and\nthe contained items are disjoint portions of that file.\n\n\n2. Unlike a container, a contained item is only governed by its\nrespective license. Thus, when you extract a contained item, you\nonly have to obey its respective license.\n\n\n3. When you modify a contained item, your modifications become\nlicensed under the contained item's license.\n\nFor example, when I modify mit.c, my modifications become pulled\nunder the MIT license. Since the MIT license allows me to add more\nrestrictions, I can take the {original MIT code + my modifications}\nand release it under BSD or GPL.\n\nAnother example: I have a combined.c file which contains disjoint\nMIT and BSD portions. When I modify the MIT portions, the same\nsituation in the previous example applies here, correct?\n\n\nPlease correct me accordingly.\n\nThanks for your consideration.\n\n\n-- \nTo UNSUBSCRIBE, email to debian-legal-REQUEST@lists.debian.org\nwith a subject of \"unsubscribe\". Trouble? Contact listmaster@lists.debian.org\n\n"}