{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"PowerMarketers.com\"<PowerMarketers.com@calcium.netcontentinc.net>", "subject": "Daily Power Report", "body": "\n\n\n\n  \nHome  - JobSite\n\n\n\n\n\nThe Power Marketing Association OnLine\nE-mail Us - Submit News Release   \n\n\n\n The POWER REPORT...\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpcoming \nConferences\n\n\n\nManaging Physical \n\t\t\t& Financial Uncertainty in the Power Industry\n\n\t\t\tNew York, \n\t\t\tNY\n\nJune 19-20, 2007\n\nValue \n\t\t\tand Risk in Energy Markets - Introduction & Principles (Program 8)\n\n\t\t\tSan Diego, CA\n\nJune 19-21, 2007\n\n\nAlternative \n\t\t\tRegulation for Electric and Gas Utilities\n\n\t\t\tBoston, MA\n\nJune 25-26, 2007\n\n\nIn Depth \n\t\t\tIntroduction to Electricity Markets\n\n\t\t\tAlexandria, \n\t\t\tVA\n\nJune 25-26, 2007\n\n\nCarbon \n\t\t\tEmissions: Understanding and Managing Carbon Risk\n\n\t\t\tAlexandria, VA\n\nJune 25-26, 2007\n\n\n\nCustomer \n\t\t\tCommunications for Utilities\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nPublic \n\t\t\tParticipation in Utility Siting\nBoston, \n\t\t\tMA\n\nJune 27-28, 2007\n\n\nEEI's 2007 \n\t\t\tTransmission and Wholesale Market School\n\n\t\t\tMadison, WI\n\nJuly 9-13, 2007\n\n\nCarbon \n\t\t\tSequestration Development & Finance Summit\nHouston, \n\t\t\tTX\n\nJuly 11-13, 2007\n\n\nCoal Combustion \n\t\t\tProducts\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nT & D Asset \n\t\t\tManagement\n\n\t\t\tCharlotte, NC\n\nJuly 16-17, 2007\n\n\nWind Power \n\t\t\tDevelopment Tutorial\nDenver, \n\t\t\tCO\n\nJuly 16-18, 2007\n\n\nFERC Electric \n\t\t\t101\nDenver, \n\t\t\tCO\n\nJuly 17-18, 2007\n\n\nElectric Power \n\t\t\tPlanning\nSan \n\t\t\tFrancisco, CA\n\nJuly 23-24, 2007\n\n\nProject Finance \n\t\t\tTutorial\nNew York, \n\t\t\tNY\n\nJuly 23-25, 2007\n\n\nDiversity and \n\t\t\tInclusion- Best Practices\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-25, 2007\n\n\nEnergy \n\t\t\tEfficiency, Demand Response and Load Management\nSan \n\t\t\tFrancisco, CA\n\nJuly 24-27, 2007\n\n\nRevenue \n\t\t\tManagement\nSan \n\t\t\tFrancisco, CA\n\nJuly 26-27, 2007\n\n\nNew FERC Filing \n\t\t\tand FASB Fair Valuation Standards\nChicago, \n\t\t\tIL\n\nJuly 30-31, 2007\n\n\nPower Delivery \n\t\t\tPlanning: Managing the Distribution Planning Process to Maximize \n\t\t\tValue\nChicago, \n\t\t\tIL\n\nAug 1-2, 2007\n\n\nElectric Safety \n\t\t\tin Utilities\n\n\t\t\tWashington, DC\n\nAug 15-16, 2007\n\n\nProtective \n\t\t\tRelaying\n\n\t\t\tWashington, DC\n\nAug 16-17, 2007\n\n\n\n          Click here for online registration form\n\n\n\n\n\n\n\n\n\n\nCarbon Sequestration Development & Finance Summit  \n    July 11-13, 2007\n    Houston, TX\nFor Conference Brochure  click here\n \n\n\n\n\n\n - click on headline to view story -\n\n\n\n\n\n\n\n\nINDUSTRY PUBLICATIONS\n\n\n\n\n\n\nFirst Enercast Featured Articles for June 29, 2007  \n\n\n\nFirst Enercast Featured Articles for June 29, 2007   Forecast & Analysis - Top Stories - Financial - Releases - Weather Stories\n\n\nJun 29, 2007 PowerMarketers Industry Publications\n\n\n\nRestructuring and Deregulation in the United States: Reflections On A Paced, But Still Maturing, Market (UtiliPoint.com - Jun. 29, 2007)\n\n\n\nUtiliPoint.com - Jun. 29, 2007 - From within the sector, it would be difficult to find a professional that does not know that the electric power industry is evolving from a highly regulated, monopolistic regime to a less regulated system and competitive market.\n\n\nJun 29, 2007 PowerMarketers Industry Publications\n\n\n\nNatural Gas Intelligence (Jun. 29, 2007)\n\n\n\nNatural Gas Intelligence summudles for Jun. 29, 2007\n\n\nJun 29, 2007 PowerMarketers Industry Publications\n\n\n\nGreen Energy Fuels Utilities (EnergyBiz Insider - Jun. 29, 2007) \n\n\n\nEnergyBiz Insider - Jun. 29, 2007 - Utilities like green energy. They also like the tax benefits that come with providing them.\n\n\nJun 29, 2007 PowerMarketers Industry Publications\n\n\n\n\n\n\n\n\nNATIONAL NEWS\n\n\n\n\n\n\nConsultant challenges MEA's plant projections\n\n\n\nJun. 29--PALMER -- Matanuska Electric Association cites the unpredictable future of natural gas prices in the Cook Inlet as one reason coal is an attractive fuel for a 100-megawatt power plant it plans to bring online in 2015.  Utility and pipeline consultant Mark Foster, at a recent public meeting about the cost of coal, warned attendees that by choosing coal, MEA could kill a project to ship ...\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nPa. salt cavern will store gas: Dominion tries new way to contain fuel, costing $500 million-$700 million\n\n\n\nJun. 29--Dominion Resources Inc. is looking to store natural gas in a new spot -- salt caverns.  The Richmond-based energy company will spend between $500 and $700 million to create salt caverns and build a salt refinery in Tioga County, Pa. The project will expand Dominion's natural gas storage capacity by as much as 50 billion cubic feet, enough to power about 500,000 homes for a year.\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy bill OK'd by state Senate\n\n\n\nJun. 29--RALEIGH -- North Carolina could be the first state in the Southeast to require its power companies to generate a substantial amount of electricity from renewable sources, under a measure overwhelmingly endorsed Thursday by the Senate.  The legislation -- which has been pushed for years by environmental groups -- would require that solar energy, animal waste and other renewable sources ...\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nCentral Illinois 'hotbed' for wind energy\n\n\n\nJun. 29--BLOOMINGTON -- The wind-energy industry is fast expanding in Central Illinois, but one absentee on the bandwagon is the main company that supplies the area with power.  With electric rates in legislative limbo, Ameren Corp. has yet to purchase wind energy for its Illinois subsidiaries, AmerenIP, AmerenCILCO and AmerenCIPS. Still, the St. Louis-based utility applied with energy regulators ...\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nAmendment may aid Toledo's quest for energy\n\n\n\nJun. 29--COLUMBUS -- Toledo residents may have moved closer to benefiting from steam power generated by the proposed $800 million FDS Coke Plant.  Under an amendment added to Ohio's just-passed state budget, the project could qualify for federal tax-exempt financing if it sells energy generated by the plant to a tax-exempt municipal utility rather than to FirstEnergy Corp.\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nFirm seeks new electric lines\n\n\n\nJun. 29--A Michigan company that builds electric transmission lines and attained utility status in Kansas this month has its sights on Oklahoma, and may create competition for utilities.  ITC Great Plains President Carl Huslig and other company representatives met this week with Oklahoma Deputy Secretary of Energy Bobby Wagner to express interest in building transmission lines in Oklahoma, Wagner ...\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nEnergy bill cited as national model\n\n\n\nJun. 29--The Council of State Governments has selected a measure by state Rep. Tom Sloan, R-Lawrence, as model legislation that other states should consider. House Bill 2169, which was signed into law in April, authorizes the Kansas Development Finance Authority to partner with federal agencies, including the military, to install energy conservation equipment and acquire renewable energy.\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nWasden plans energy conference: Energy experts to meet state attorneys general\n\n\n\nJun. 29--BOISE -- From global warming to alternative energy sources to increasing gas prices, states are facing serious energy issues, and state attorneys general need to be prepared, Idaho Attorney General Lawrence Wasden says.  Newly elected as president of the National Association of Attorneys General, Wasden has selected energy as the initiative he'll focus on during his one-year term.\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nCL&P seeks 4.6% rate increase\n\n\n\nJun. 29--A day after electric utilities and state regulators touted a program that would give customers credit on energy bills this fall, the Connecticut Light & Power Co. said it intends to ask for a 4.6 percent rate increase, beginning in 2008.  CL&P said today it will file a letter of intent asking the state Department of Public Utility Control to allow it to raise an additional $189 million ..\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nOGE Enogex expected to rake in capital\n\n\n\nJun. 28--Investment capital is expected to pour into Oklahoma once again later this year with the completion of an initial public offering for OGE Enogex Partners Limited Partnership.  Parent company OGE Energy Corp. Wednesday announced an IPO registration was filed with the Securities and Exchange Commission, proposing to sell 7.5 million common units that represent 34 percent of the ownership ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\nElectricity relief deal closes in on $1 billion\n\n\n\nJun. 29--SPRINGFIELD -- After weeks of bruising negotiations, state lawmakers have squeezed a rate-relief package for electricity customers worth $950 million from major utilities, Senate Majority Leader Debbie Halvorson said Thursday. But lawmakers want to push the relief to $1 billion overall, and top legislative leaders will meet once again with utility executives from Commonwealth Edison, ...\n\n\nJun 29, 2007 Knight Ridder Tribune Business News\n\n\n\nPelosi supports Senate mileage bill, unveils energy independence bills\n\n\n\nJun. 28--WASHINGTON -- House Speaker Nancy Pelosi said today that she supports a Senate bill raising fuel economy standards to 35 miles per gallon by 2020, and declined to say whether she would block a similar proposal from coming to the House floor next month.  The California Democrat spoke at the unveiling of a package of energy bills that Democrats plan to take to the House floor next month, ...\n\n\nJun 28, 2007 Knight Ridder Tribune Business News\n\n\n\n\n\nPSE&G To Install More Energy-Efficient Equipment\n\n\n\nThe Digital Utility  Vegetation Management  Public Service Electric and Gas Company (New Jersey) will invest in more efficient electric delivery equipment, a move expected to reduce energy use and cut carbon emissions by some 60,000 tons by the year 2020. Energy efficiency is considered the most cost-effective carbon reduction method available, reducing greenhouse gas emissions by reducing the ...\n\n\nJun 29, 2007 Transmission & Distribution World\n\n\n\nIdaho nuke plant lures unlikely lender\n\n\n\nCobblestone Financial Group, in the Erie Canal town of Fairport, N.Y., has given Alternate Energy Holdings a letter of intent 'to fund 100 percent of its proposed Idaho Energy Complex' on 4,000 acres in Owyhee County near the Snake River, an official with the Idaho project said this week. According to Cobblestone's Web site, the company focuses 'on complex and troublesome commercial real estate ...\n\n\nJun 29, 2007 Idaho Statesman\n\n\n\nNiSource to appeal $270 million punitive award after Roane decision\n\n\n\nClick here for Part 2 of the judge's order NiSource Inc. says it will ask the state Supreme Court to overturn a $270 million punitive damages award in a natural gas royalties case after a circuit judge upheld the jury's decision. Roane Circuit Judge Tom Evans ruled Thursday that the evidence and the law did not warrant overturning either the jury's finding of fraud or the size of the award.\n\n\nJun 29, 2007 Charleston Daily Mail\n\n\n\nPacificorp Granted Easement to Connect New Substation\n\n\n\nThe Digital Utility  Vegetation Management  Unico, Inc., a natural resource company in the precious metals mining sector, has granted PacifiCorp an easement for a right of way to establish a connection between the existing substation adjacent to the Deer Trail Mine property and the new substation that will supply power to the Deer Trail Mine. According to the terms of the agreement, the easement ...\n\n\nJun 29, 2007 Transmission & Distribution World\n\n\n\nElectric Bill Relief Could Be Fleeting\n\n\n\nCL&amp;P To Ask State For Rate Increase Remember that promised electric rate decrease? Don't worry - it's coming this Sunday, just as Connecticut Light &amp; Power said it would. But don't get used to the lower rates. A new increase is already in the works, one that might largely negate the brand-new decrease. Connecticut Light &amp; Power will ask regulators in a filing today to increase what ...\n\n\nJun 29, 2007 Hartford Courant\n\n\n\nPols wary of energy-cost plan\n\n\n\nPols wary of energy-cost plan By Jay FitzgeraldBoston Herald General Economics Reporter Friday, June 29, 2007 House Democrats yesterday said they have serious concerns about Gov. Deval Patricks proposal to have ratepayers subsidize utilities for lost profits and revenue due to stepped-up conservation measures. Both House Speaker Sal DiMasi and Rep. Brian Dempsey, chairman of the ...\n\n\nJun 29, 2007 Boston Herald\n\n\n\n\n\nChevron Pipe Line Company Announces Keystone Expansion\n\n\n\nChevron Pipe Line Company announced today that it plans to expand its Keystone Gas Storage facility in West Texas by an additional 2 billion cubic feet (Bcf) for a total working gas capacity of 7 Bcf. The facility's withdrawal capability is 400 million cubic feet per day (mmcf/d) and injection capability is 160 mmcf/d. The expansion is expected to increase injection capability to 200 mmcf/d.\n\n\nJun 29, 2007 PR Newswire\n\n\n\nNevada Power Issues RFP for Power Products\n\n\n\nLAS VEGAS--(BUSINESS WIRE)--Nevada Power Company, a wholly-owned subsidiary of Sierra Pacific Resources (NYSE:SRP), announced today that it has issued a request for proposals for energy supply, including firm energy and various tolling and other power products. The deadline to submit a proposal is on or before 9 a.m. Pacific time on Thursday, August 9, 2007.\n\n\nJun 29, 2007 Business Wire\n\n\n\nSierra Pacific Power Files Integrated Resource Plan With the Public Utilities Commission of Nevada\n\n\n\nRENO, Nev., June 29 /PRNewswire-FirstCall/ -- Sierra Pacific Power, a wholly owned subsidiary of Sierra Pacific Resources (NYSE: SRP), today submitted to the Public Utilities Commission of Nevada an updated blueprint for serving the long-term energy needs of its electricity and natural gas customers in northern Nevada. The utility's Integrated Resource Plan (IRP) is filed every three years.\n\n\nJun 29, 2007 PR Newswire\n\n\n\nCities Aggregation Power Project Celebrates 100th Member\n\n\n\nCities Aggregation Power Project (CAPP) announced that the City of Dickinson voted Tuesday to join, becoming the 100th city in Texas to pool its demand for electricity with other CAPP member cities around Texas. After aggregating cities' electricity needs, CAPP negotiates for discounted rates that are contracted over long periods, helping municipalities achieve budget certainty -- often with ...\n\n\nJun 29, 2007 PR Newswire\n\n\n\nSCE Proposes Final Leg of California's Largest Renewable Transmission Project\n\n\n\nROSEMEAD, Calif.--(BUSINESS WIRE)--Southern California Edison (SCE) today applied to the California Public Utilities Commission (CPUC) and the U.S. Forest Service for authorization to construct Segments 4-11 of the Tehachapi Renewable Transmission Project, a series of new and upgraded high-voltage electric transmission lines to deliver electricity from proposed new wind farms in the Tehachapi ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nFitch: OGE Energy Plans for Master Limited Partnership Won't Affect Ratings\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch Ratings said Friday that OGE Energy Corp.'s (OGE Energy) plans to form a master limited partnership (MLP) will not have an immediate impact on the ratings of OGE Energy or its subsidiaries. OGE Energy, currently rated 'A' by Fitch with a Stable Rating Outlook, filed a registration statement relating to a proposed initial public offering (IPO) of common units of a ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nFirst Midwest Bancorp Announces Election of New Independent Director\n\n\n\nThe Board of Directors of First Midwest Bancorp,  The Board of Directors of First Midwest Bancorp, Inc. (NASDAQ: FMBI) today announced the election of John F. Chlebowski, Jr. as an independent director of the corporation. With the addition of Mr. Chlebowski, the First Midwest Bancorp Board has 13 directors, eleven of whom are independent.  \"Our shareholders will be fortunate to have Mr. ...\n\n\nJun 28, 2007 Internet Wire\n\n\n\nGeorgia Power Requests Recovery for Environmental and Customer Investments\n\n\n\nGeorgia Power today asked the Georgia Public Service Commission (PSC) for permission to increase its base rates to recover costs for environmental programs, new generation and electric infrastructure to meet growing customer demand for electricity. If the request is approved, the average residential customer bill would increase by about 7.06 percent, or $6.67 per month.\n\n\nJun 29, 2007 PR Newswire\n\n\n\nNamaste Solar Installs SunPower Solar Power System on Colorado Governor's Residence\n\n\n\nDENVER, June 29 /PRNewswire-FirstCall/ -- Namaste Solar Electric and SunPower Corporation (Nasdaq: SPWR), a Silicon Valley-based manufacturer of high-efficiency solar cells, solar panels and solar systems, today announced the completed installation of a 7.4-kilowatt solar power system at the Colorado Governor's Residence in Denver using SunPower's high-efficiency solar electric panels.\n\n\nJun 29, 2007 PR Newswire\n\n\n\nFitch Rates Entergy Gulf States Reconstruction Funding I, LLC, Series A\n\n\n\nNEW YORK--(BUSINESS WIRE)--Fitch rates Entergy Gulf States Reconstruction Funding I, LLC, Series A as follows: --$93,500,000 5.51% tranche A-1 'AAA'; --$121,600,000 5.79% tranche A-2 'AAA'; --$114,400,000 5.93% tranche A-3 'AAA'; The collateral securing the transition bonds consists primarily of transition property, which represents the right to collect a tariff (transition charge, or TC) from ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nPepco Completes New 230-KV Lines, Improves Reliability for DC\n\n\n\nWASHINGTON--(BUSINESS WIRE)--Pepco has placed into service two newly constructed high-voltage transmission lines that will enhance the reliability of electric service for downtown Washington and the federal government. The lines, each carrying 230,000 volts, were constructed over an 18-month period with completion in time to meet this summers peak demand period.\n\n\nJun 29, 2007 Business Wire\n\n\n\nCapital Advice Engineers Solar Acquisition by Nevada-Based Private Equity Group\n\n\n\nSCOTTSDALE, Ariz.--(BUSINESS WIRE)--Arizona-based Capital Advice llc served as advisor to Sierra Nevada Partners, Incline Village, Nev., in its acquisition of HelioPower Inc., a California-based solar energy company. Terms of the transaction were not disclosed. Capital Advice, a regional investment banking firm, will continue to spearhead Sierra Nevada Partners ongoing search for additional ...\n\n\nJun 28, 2007 Business Wire\n\n\n\n\n\nDTE Energy Completes Sale of a Subsidiary to Atlas Energy Inc. for $1.26 Billion\n\n\n\nDETROIT (AP) - DTE Energy Co. said Friday it closed the sale of some exploration and production properties to Atlas Energy Resources for $1.26 billion. Atlas Energy Resources, a business unit of Philadelphia-based Atlas America Inc., bought DTE's Michigan Antrim Shale which owns interests in about 2,150 natural gas wells located in Michigan's northern lower peninsula.\n\n\nJun 29, 2007 Canadian Business Magazine\n\n\n\nEnbridge files terms for Clipper pipeline\n\n\n\nEnbridge Inc. (ENB/TSX) announced Thursday it has filed commercial terms to its application to the National Energy Board regarding the Alberta Clipper mainline expansion project. The filing sets out tolling principles and risk sharing parameters agreed to by shippers regarding Enbridge's $2-billion Canadian section of the expansion. The terms of the tolling principles include a 45 per cent ...\n\n\nJun 29, 2007 National Post\n\n\n\nIndustry, Environmentalists Square Off Again on Power Plant Emission Upgrades\n\n\n\nWASHINGTON (AP) - Environmentalists and electric utilities face off Friday at a hearing on an industry-favored proposal to change how the government decides when pollution controls are needed at older power plants. The proposal, released by the Environmental Protection Agency in April, is the latest twist in a long debate about requirements that utilities install expensive pollution control ...\n\n\nJun 29, 2007 Canadian Business Magazine\n\n\n\nPG&E customers go carbon neutral\n\n\n\nPacific Gas and Electric Co. announced the launch of ClimateSmart, a voluntary emissions neutralizing program for its customers. The program will give customers the option to neutralize greenhouse gas emissions associated with their energy use by funding environmental projects and PG&E has signed up as the first participant. 'The launch of ClimateSmart represents a major milestone in educating ...\n\n\nJun 29, 2007 UPI\n\n\n\nMaryland Gov. O'Malley Says He's Not Finished Looking Into Energy Costs\n\n\n\n- 3:54 p.m. ANNAPOLIS, Md. (AP) - Gov. Martin O'Malley pledged Friday to keep looking for ways to address rising energy costs, saying state officials will explore how prices are influenced by the relationship between Baltimore Gas and Electric Co. and its parent company, Constellation Energy Group Inc. 'I intend to do everything I possibly can to get us out of the horrible situation that all ...\n\n\nJun 29, 2007 Canadian Business Magazine\n\n\n\nJudge orders Westar to pay $3.1M for Lake&#39;s legal fees\n\n\n\nWestar Energy Inc., will have to pay about $3.1 million in legal fees to attorneys who represented a former company executive in a criminal trial for fraud and conspiracy, a federal judge ruled Thursday. That amount is half of the $6.2 million East Coast firms billed for legal services to represent Spielas Lake, former executive vice president for Topeka-based Westar (NSYE: WR).\n\n\nJun 29, 2007 Wichita Business Journal\n\n\n\nColo. governor uses solar power\n\n\n\nNamaste Solar Electric and SunPower Corp. announced the completed installation of a 7.4-kilowatt solar power system at the Colorado governor's home in Denver. The system, which is installed at the Carriage House at the historic Boettcher Mansion, is expected to generate 8,441 kilowatt-hours of electricity annually. In combination with a smaller 2.4 kilowatt system installed on the Pump House on ...\n\n\nJun 29, 2007 UPI\n\n\n\nMajor US Power Company Plans To Use Industrial Nanotech Product To Protect Public\n\n\n\nNaples, FL - Industrial Nanotech, Inc., a global leader in nanotechnology, announced recently that a major US Power Company plans to use Industrial Nanotech's Nansulate nanotechnology based coating to provide both corrosion protection and thermal insulation of its infrastructure. The total value of the project has not yet been determined and the project is expected to be ongoing.\n\n\nJun 29, 2007 Power Online\n\n\n\nSolar power may bring new jobs to Texas\n\n\n\nA study says increased used of solar power could bring 123,000 new jobs to Texas during the next few decades. The report by the IC2 Institute at the University of Texas at Austin said the creation of a vibrant solar power industry could stimulate the state's economy, reduce the cost of power for consumers and minimize green-house gas emissions, the university said Friday in a news release.\n\n\nJun 29, 2007 UPI\n\n\n\n\nClick Here For More National News\n\n\n\n\nINTERNATIONAL NEWS\n\n\n\n\n\n\n\nResearch and Markets : Mexico Energy Market Supply and Demand Outlook Report\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Dublin - Research and Markets (http://www.researchandmarkets.com/reports/c61305) has announced the addition of Mexico Energy Market Supply and Demand Outlook Report to their offering. The Mexico Energy Market Supply and Demand Outlook Report allows a quick understanding of the key factors in the countrys energy market. This report provides an historical ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nResearch and Markets: Italy Energy Market Supply and Demand Outlook Report\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61243) has announced the addition of Italy Energy Market Supply and Demand Outlook Report to their offering. The Italy Energy Market Supply and Demand Outlook Report allows a quick understanding of the key factors in the countrys energy market. This report provides an historical perspective on a ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nResearch and Markets: India Energy Market Supply and Demand Outlook Report\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61093) has announced the addition of India Energy Market Supply and Demand Outlook Report to their offering. The India Energy Market Supply and Demand Outlook Report allows a quick understanding of the key factors in the countrys energy market. This report provides an historical perspective on a ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nUN inspectors tour North Korean nuclear facility\n\n\n\nStalled disarmament moves forward after IAEA inspectors 'satisfied' with North Korea's progress. By  After months of a diplomatic stalemate, North Korea is showing signs that it's ready to dismantle its nuclear program and has allowed United Nations International Atomic Energy Agency (IAEA) inspectors into the country for the first time in five years. On Thursday IAEA officials reported that they ...\n\n\nJun 29, 2007 Christian Science Monitor\n\n\n\nWorld's Largest Wind Power Developer Gets U.S. Assets\n\n\n\n-- Spanish construction firm Acciona, the world's largest wind power developer, said June 27 it has won exclusive rights to develop 1300 megawatts (MW) of wind assets in Illinois, Iowa and Wisconsin. Acciona acquired projects from EcoEnergy, LLC, an alternative energy solutions developer and unit of The Morse Group and sees the Spanish firm shore-up expansion in North America as a long-term owner ...\n\n\nJun 29, 2007 Industry Week\n\n\n\nPetrochemical Production in Iran Set to Soar to 20 Million Tons by March 2008\n\n\n\nDUBLIN, Ireland--(BUSINESS WIRE)--Research and Markets (http://www.researchandmarkets.com/reports/c61036) has announced the addition of Petrochemical Industry of Iran 2007 to their offering. In a matter of few years, Iran has elevated itself to 60th in the world and 2nd largest producer and exporter of petrochemicals in the Middle East. The country produces 12 percent of the total petrochemical ...\n\n\nJun 29, 2007 Business Wire\n\n\n\nAmerenUE Power Plant's Concrete Packaging Plant Wins Waste Management Award\n\n\n\nThe Missouri Waste Control Coalition today presented AmerenUE with an Outstanding Achievement Award for the AmerenUE/Charah(R), Inc. concrete packaging facility at Labadie Power Plant.     The Missouri Waste Control Coalition is a 400-member not-for-profit organization for citizens, businesses and organizations concerned about the environment and the proper management and disposal of generated ...\n\n\nJun 29, 2007 PR Newswire\n\n\n\nClick Here For More International News\n\n\n\n\n\n\n\nPOWER REPORT Energy News Sections:National - International - Employment - Weather \n\n\n\n\n\n\nCopyright 2002 PowerMarketers.com. All rights reserved.Questions or Comments Legal NoticesPowerMarketers.com · PO Box 2303 · Falls Church · VA · 22042 This email was sent to ktwarwic@speedy.uwaterloo.ca by PowerMarketers.com.Unsubscribe | Privacy Policy\n"}