{"category": "ham", "to_address": "ktwarwic@flax9.UWATERLOO.CA", "from_address": "Tonight on CNN <mailings@mail.cnn.com>", "subject": "TB Patient tells his side of the controversy tonight!", "body": "\n\n\n\nTonight On CNN Email\n\n\n\n\n\n\n\nJune  6, 2007\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n9 p.m. ET\n\n\n \n\nLarry King Live: TB Patient Exclusive\n\n\nThe TB-infected groom, his bride and his family speak out in their first prime-time interview. Hear their side of the international scare they say has made their lives hell.  Tonight at 9 ET!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelated:• E-mail your questions for Andrew Speaker and his family\n\n\n\n\n\n\n\n \n \n\n\n\n\n\n \n\n\n\n\n6:00 a.m. ET\n\n\n \n\nAmerican Morning\n\n\nThe crash site of Flight 93 is again a scene of strife. Its owner reportedly demanding millions, and victims' families are outraged.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n6:00 p.m. ET\n\n\n \n\nLou Dobbs Tonight\n\n\nDoes President Bush hurts himself every time he says the Senate immigration plan is not amnesty?  An outspoken Oklahoma senator says yes!  He'll tell us why.\n\n\n\n\n\n\n\n\n7:00 p.m. ET\n\n\n \n\nThe Situation Room\n\n\nBreaking ranks with President Bush - Surprising candor from GOP heavy hitters at the CNN debate. Where will the race to '08 lead next?\n\n\n\n\n\n\n\n9:00 p.m. ET\n\n\n \n\nLarry King Live\n\n\nThe TB-infected groom, his bride and his family. Their side of the international scare they say has made their lives hell... in their first prime-time interview.\n\n\n\n\n\n\n\n10:00 p.m. ET\n\n\n \n\nAnderson Cooper 360\n\n\nRecord drought in the west, record hurricanes on the horizon and the kind of heat that kills by the thousands. What's behind the extreme weather?\n\n\n\n\n\n\n\n\n\n\n\n\n \n \n\nSend us your feedback >  |  CNN's full program schedule >  |  E–mail sign up >\n\n\n\n\n \n \n\nCable News Network LP, LLLP. One CNN Center, Atlanta, Georgia 30303\n© 2007 Cable News Network LP, LLLP.\nA Time Warner Company. All Rights Reserved.\nTerms under which this service is provided to you.\nRead our privacy guidelines. Contact us. \n\nYou have agreed to receive this email from CNN.com as a result of your CNN.com preference settings.\nTo manage your settings click here.\nTo unsubscribe from the Tonight on CNN list, click here. \n\n\n\n\n\n\n\n"}