{"category": "ham", "to_address": "a2k@lists.essential.org, ip-health@lists.essential.org", "from_address": "Thiru Balasubramaniam <thiru@keionline.org>", "subject": "[Ip-health] Wall Street Journal: Patent Holders' Grip Weakens", "body": "Patent Holders' Grip Weakens\nHigh Court Curtails Power\nAmid Innovation Debate;\nMore Disputes May Arise\nBy JESS BRAVIN\nMay 1, 2007; Page A3\n\nWASHINGTON -- The Supreme Court made it harder to get new patents and\nto defend existing ones, giving new force to the law that denies\npatents to inventions deemed \"obvious.\"\n\nIn a unanimous decision, the justices yesterday sided with critics who\nargue that lower-court rulings have given patent holders more power\nthan Congress intended, potentially stifling innovation.\n\nThe ruling, the latest to roll back patent holders' clout, comes amid a\nsharp debate over how to maintain the nation's competitive edge while\nprotecting those who labor to design cutting-edge inventions. Many of\nthe developments that drive the economy are governed by patent law, an\narcane field that has become a battleground in the larger debate about\nU.S. industrial strength.\n\nThe opinion could have especially big implications for technology\ncompanies, whose software programs typically are built through small\nimprovements in prior designs. Also affected will be the growing and\nmuch-disputed field of \"business method\" patents, which are granted for\nabstract processes rather than specific devices.\n\nIn a separate, and less sweeping, decision also delivered yesterday,\nwhich involved AT&T Inc. and Microsoft Corp., the court limited the\nenforceability of U.S. patents for software installed overseas.\n\nYesterday's rulings are sure to influence pending patent cases while\nopening an unknown number of existing patents to challenges. Weaker\npatents that survived under lower-court precedents are more likely to\nbe invalidated, putting their inventions in the public domain.\n\nWith challengers emboldened to resist infringement claims, more\ndisputes could head to court. But patent holders, assessing their\nweakened position, could be inclined to settle disputes on more\ngenerous terms rather than risk a court judgment that could invalidate\ntheir patents outright. Investors that buy up patents with the aim of\nobtaining royalties from alleged infringers -- known as patent trolls\n-- are sure to find slimmer pickings.\n\nIn its ruling, the court said the U.S. Court of Appeals for the Federal\nCircuit, a specialized court overseeing patent law, had been too\ngenerous toward patent holders, allowing them to claim a patent\nmonopoly for incremental advances. The decision swept aside the test\nused by the court to determine whether an invention was \"obvious\" --\nand therefore ineligible for a patent.\n\nPatent law aims to strike a balance that provides an incentive to\ninventors by guaranteeing a limited-time monopoly, currently 20 years,\non an invention's use, while ensuring that intellectual-property rights\nare flexible enough to allow research and innovation based on prior\ndiscoveries.\n\nWhile any federal district court can hear a patent suit, all patent\nappeals are funneled to the Federal Circuit, set up in 1982 to\ncentralize legal doctrine in several specialized fields. In the first\ntwo decades that followed the Federal Circuit's creation, the Supreme\nCourt took few patent cases.\n\nIn recent years, the high court has repeatedly stepped in to correct\nFederal Circuit rulings it found skewed the balance toward patent\nholders by failing to take into account the fluid nature of the modern\neconomy.\n\n\"What they're starting to put together here is a model for a\n21st-century patent system,\" said David Kappos, who oversees\nintellectual-property law at International Business Machines Corp.,\nArmonk, N.Y. \"Closed proprietary innovation remains important,\" he\nsaid, but the court seems to be saying that patent law \"can also\naccommodate 21st-century models that are more open, more\ncollaborative.\"\n\nHigh-technology companies have been particularly aggressive in seeking\nto reduce what they regard as abuse of the patent system, which makes\nit more costly to design and sell new products. \"What we have is a\npatent system that has evolved from a focus on protecting innovation to\nbecoming a litigation lottery,\" said Mark Chandler, senior vice\npresident and general counsel of Cisco Systems Inc., the San Jose,\nCalif., maker of networking equipment.\n\nPatent laws came under widespread criticism following the huge windfall\nwon by little-known patent-holding company NTP Inc. in March 2006 from\nResearch in Motion Ltd., maker of the popular BlackBerry wireless email\ndevice. Faced with a court-ordered shutdown of its services in the\nU.S., RIM, of Waterloo, Ontario, agreed to pay $612 million to NTP,\nwhose patents had never been applied to an actual product.\n\nThe most important of yesterday's cases involved an almost textbook\nexample of old industry -- the design of an accelerator pedal built for\nGeneral Motors Corp. trucks. KSR International Corp., Ridgetown,\nOntario, designed the pedals by adding an electronic sensor to a\npreviously developed system. Rival Teleflex Corp., Limerick, Pa., had\nmade a similar device for Ford Motor Co. trucks and claimed that KSR\ninfringed its patent. A federal district court dismissed Teleflex's\nsuit on obviousness grounds, but the Federal Circuit reversed the\ndecision.\n\nIn its cases, the Federal Circuit worried that in hindsight, any\ninvention might seem obvious, particularly when combining previously\nexisting designs. To guard against that, it fashioned a test in which\nsomething could be deemed obvious if it was foreshadowed by some prior\n\"teaching, suggestion or motivation.\" Critics complained that some\ncombinations were so obvious that no one would have thought, for\ninstance, to publish an article on the topic.\n\nWriting for the court and ruling for KSR, Justice Anthony Kennedy said\ncombining a digital sensor with a mechanical pedal would have been\nobvious to a skilled engineer. The Federal Circuit was too narrow in\nits definition of \"obvious,\" he wrote, saying it should be measured\nagainst such factors as changing marketplace pressures and the\nprogressive increase in overall knowledge. \"Granting patent protection\nto advances that would occur in the ordinary course without real\ninnovation retards progress,\" he wrote.\n\nThe other case concerned the classification of U.S.-designed software\ninstalled on computers assembled overseas. AT&T contended that\nMicrosoft had infringed its patent for voice-compression software when\nit sold its Windows operating system to foreign computer makers. The\nFederal Circuit agreed, only to be overturned by the Supreme Court on\nnarrow grounds relating to the difference between \"supplying\" and\n\"copying, replicating or reproducing.\"\n\nThe same legal theory used by AT&T has been used by nearly all of the\n45 patents suits pending against his company, said Brad Smith,\nMicrosoft's general counsel.\n\n\"Simply by winning this decision today, we reduce the liability\nexposure in these various lawsuits by something close to 60%,\" Mr.\nSmith estimated.\n\n--Don Clark and Christopher Rhoads contributed to this article.\n\n\n---------------------------------\nThiru Balasubramaniam\nGeneva Representative\nKnowledge Ecology International (KEI)\nvoice +41.22.791.6727\nfax +41.22.723.2988\nmobile +41 76 508 0997\nthiru@keionline.org\n\n_______________________________________________\nIp-health mailing list\nIp-health@lists.essential.org\nhttp://lists.essential.org/mailman/listinfo/ip-health\n\n"}