{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "CBS Space News <space_shuttle-ktwarwic=speedy.uwaterloo.ca@cbsig.com>", "subject": "1010a 6/8 Update: Shuttle fueling begins; weather update; ascent timeline", "body": "\n\n\n\n\n1010a 6/8 Update: Shuttle fueling begins; weather update; ascent timeline\n\n\n\n=================================\n\nCBS NEWS STS-117 STATUS REPORT: 24\nPosted: 10:10 AM, 6/8/07\n\nBy William Harwood\nCBS News Space Analyst\n\nChanges and additions:\n\n   SR-22 (06/06/07): Shuttle dodges severe storms\n   SR-23 (06/07/07): Weather improves to 80 percent 'go'\n   SR-24 (06/08/07): Shuttle Atlantis fueled for launch; weather 80 percent 'go'\n\n=================================\n\n10:10 AM, 6/8/07, Update: Shuttle fueling begins; weather remains 80 percent 'go'\n\nEngineers at the Kennedy Space Center began pumping a half-million gallons of supercold liquid oxygen and liquid hydrogen rocket fuel into the shuttle Atlantis' repaired external tank today at 9:55 a.m., setting the stage for launch at 7:38 p.m. on a space assembly mission. This will be NASA's first shuttle flight of 2007, thanks to a three-month delay to fix hail damage.\n\nThe three-hour fueling process, carried out by remote control from the firing room 3.2 miles from launch pad 39A, should be complete around 1 p.m. NASA television coverage is scheduled to begin at 1:30 p.m. followed by a traditional dining room photo opportunity with the crew.\n\nWearing bright orange pressure suits, commander Rick Sturckow, pilot Lee Archambault, flight engineer Steve Swanson, Patrick Forrester, Danny Olivas, Jim Reilly and space station astronaut Clay Anderson are scheduled to depart crew quarters at 3:47 p.m. and head for the pad.\n\nSturckow will strap into the front left seat on Atlantis' flight deck with Archambault to his right. Swanson will sit behind and between the two pilots with Forrester to his immediate right. On the shuttle's lower deck, Olivas will strap in just in front of the ship's side hatch. Reilly and Anderson will take seats just behind and to the right of Olivas.\n\nLaunch is targeted for roughly the moment Earth's rotation carries the launch pad into the plane of the space station's orbit. As of this writing, the \"in-plane\" launch time is 7:38:04 p.m. That might be adjusted by a few seconds during a final hold at the T-minus nine-minute mark based on a final analysis of the station's orbit. Today's launch window will close at 7:43:04 p.m.\n\nThere are no technical problems at pad 39A and officials say the forecast remains unchanged, with a strong sea breeze expected to push afternoon thundershowers well inshore. Shuttle weather officers in Florida are predicting an 80 percent chance of acceptable conditions today and they upgraded the forecast for Saturday to 80 percent \"go\" as well.\n\n\"An upper level low off the east coast of Florida is creating a broad shield of mid clouds and rain showers along the Space Coast,\" the weather office said in its morning forecast. \"This low and the associated showers should gradually move southwest allowing drier mid-level air to move in by launch time. At the surface, easterly winds will allow the sea breeze and its associated weather to push inland by early afternoon.\n\n\"Upper level winds are forecast to be from the east today, so anvils from any inland thunderstorms that develop should remain inland by launch time. By Saturday afternoon the upper level low is forecast to be over southern Florida, creating favorable conditions for launch; therefore, the 24-hour forecast probability of KSC weather prohibiting launch is decreased to 20%. Our primary concern for launch day is cumulus clouds.\"\n\nThe forecast from the Spaceflight Meteorology Group at the Johnson Space Center in Houston, which focuses on landing weather in case of an emergency that might force a quick return to Earth, calls for scattered clouds at 3,000, 10,000 and 25,000 feet with winds out of 100 degrees at 8 knots gusting to 12. The crosswind component at the shuttle's emergency runway is just 9 knots well within NASA's launch guidelines. Likewise, the weather at emergency landing sites in California, New Mexico, Spain and France is forecast \"go.\"\n\nHere is the remainder of today's countdown, along with the ascent timeline (in EDT):\n\nEDT...........EVENT\n\n12:42:00 PM...Begin 3-hour built-in hold (T-minus 3 hours)\n12:42:00 PM...Closeout crew to white room\n12:57:00 PM...Astronaut support personnel comm checks\n01:30:00 PM...NASA TV coverage begins\n01:45:00 PM...Astronaut photo opportunity\n03:07:00 PM...Final crew weather briefing\n03:17:00 PM...Astronauts don pressure suits\n03:42:00 PM...Resume countdown (T-minus 3 hours)\n\n03:47:00 PM...Crew departs O&C building\n04:17:00 PM...Crew ingress\n05:07:00 PM...Astronaut comm checks\n05:22:00 PM...Hatch closure\n06:07:00 PM...White room closeout\n\n06:22:00 PM...Begin 10-minute built-in hold (T-minus 20m)\n06:32:00 PM...NASA test director countdown briefing\n06:32:00 PM...Resume countdown (T-minus 20m)\n\n06:33:00 PM...Backup flight computer to OPS 1\n06:37:00 PM...KSC area clear to launch\n\n06:43:00 PM...Begin final built-in hold (T-minus 9m)\n06:54:04 PM...NASA test director launch status verification\n07:29:04 PM...Resume countdown (T-minus 9m)\n\n07:30:34 PM...Orbiter access arm retraction\n07:33:04 PM...Hydraulic power system (APU) start\n07:33:09 PM...Terminate LO2 replenish\n07:34:04 PM...Purge sequence 4 hydraulic test\n07:34:04 PM...IMUs to inertial\n07:34:09 PM...Aerosurface movement check\n07:34:34 PM...Main engine steering test\n07:35:09 PM...LO2 tank pressurization\n07:35:29 PM...Fuel cells to internal reactants\n07:35:34 PM...Clear caution-and-warning memory\n07:36:04 PM...Crew closes visors\n07:36:07 PM...LH2 tank pressurization\n07:37:14 PM...SRB joint heater deactivation\n07:37:33 PM...Shuttle computers take control of countdown\n07:37:43 PM...SRB steering test\n07:37:57 PM...Main engine start (T-6.6 seconds)\n\n07:38:04 PM...SRB ignition (LAUNCH)\n\n07:38:14 PM...Shuttle roll maneuver begins (alt: 796 feet)\n07:38:22 PM...Roll maneuver ends (alt: 3,294 feet)\n07:38:37 PM...Engine throttle down to 72 percent (alt: 11,405 feet)\n07:38:47 PM...Maximum aerodynamic pressure (684 psf; alt: 20,122 feet)\n07:38:53 PM...Main engine throttle up to 104.5% (alt: 25,601 feet)\n07:40:09 PM...Booster separation (alt: 30.2 statute miles; velocity: 2,982 mph)\n07:40:19 PM...Starts OMS rocket assist         \n07:40:51 PM...Trans-Atlantic abort window opens (alt: 44.6 sm; vel: 3,533 mph)\n07:42:01 PM...Return to launch site abort window closes\n07:43:21 PM...Abort to orbit window opens (alt: 67.5 sm; vel: 7,245 mph)\n07:43:51 PM...Shuttle rolls to heads up orientation\n07:44:21 PM...Press to MECO (alt: 67 sm; vel: 9,536 mph)\n07:45:05 PM...Single-engine press to main engine cutoff\n07:45:26 PM...3G limiting (alt: 64.3 sm; vel: 13,009 mph)\n07:46:22 PM...Trans-Atlantic abort window closes\n07:46:28 PM...Main engine cutoff command (alt: 64.7 sm; vel: 16,942 mph)\n07:46:34 PM...Zero thrust\n\nA detailed trajectory timeline is available as a SpaceCalc screenshoot on the Current Mission page, along with a full list of ascent abort boundaries.\n\n=================================\n\nQuick-Launch Web Links:\n\nCBS News STS-117 Status Reports:\nhttp://www.cbsnews.com/network/news/space/current.html\n\nCBS News STS-117 Quick-Look Page:\nhttp://www.cbsnews.com/network/news/space/currentglance.html\n\nNASA Shuttle Web: http://spaceflight.nasa.gov/shuttle/index.html\nNASA Station Web: http://spaceflight.nasa.gov/station/index.html\nSpaceflight Now: http://spaceflightnow.com/index.html\n\n=================================\n\n\n\n\n\n\nYou are currently subscribed to the CBS Space  News mailing list. \r\nTo unsubscribe, go to\r\nhttp://www.cbsnews.com/htdocs/registration/unsubscribe.php\r\n"}