{"category": "ham", "to_address": "\"Speakup is a screen review system for Linux.\" <speakup@braille.uwo.ca>", "from_address": "Travis Siegel <tsiegel@softcon.com>", "subject": "Re: gentoo dropping speakup support", "body": "I have to strongly disagree here as relates to bootable messages.\nSpeakup makes linux the *only* os where blind users can see the boot  \nup as it happens.  Even dos can't do that, and I have more than once  \nmanaged to fix a machine with linux because of the speakup capability  \nto speak *all* bootup messages.  Dumping them to a logfile, booting  \nwith a live cd, then reading the log may work for users who are  \nadvanced enough to figure it out, (or are lucky enough to have simple  \nenough configurations this can be done) but by doing so, you're  \nbasically saying that those who want to troubleshoot their own boxes  \nw/o sighted assistance are sol.\nAnd, if the hd is bad, then your logging isn't going to work anyhow.   \nNot to mention, this isn't a process that can be done w/o sighted  \nassistance.\nWhile I'm more of a slackware user than anything else, having speakup  \nwork out of the box is something I've enjoyed almost since speakup  \nwas released, and I for one would be extremely sorry (not to mention  \nirritated at the lack of access it would mean) to have it removed  \ninto user space.  There's already programs for user space access  \n(yasr anyone) and while those work for normal usage, they aren't  \nusable for troubleshooting and/or fixing a broken machine.  I've been  \ndoing my own technical support since 1990 (or thereabouts) and having  \nthis capability now removed would be the equivalent of moving to  \nvista before any screen readers were specifically targeted to it.   \nSure, you could use the system, but you're not going to get anywhere  \nnear the full use out of your system you'd otherwise get.\n\nI don't have a 64-bit machine, so can't help fix this problem, nor  \nare my C skills up to the task (likely) but I'd strongly urge those  \nwith the capability, to *not* abandon speakup working as it does now.\nI will of course help where I can, but yanking it entirely out of the  \nboot sequence is just asking for additional problems.\nDon't do it.\n\n\n_______________________________________________\nSpeakup mailing list\nSpeakup@braille.uwo.ca\nhttp://speech.braille.uwo.ca/mailman/listinfo/speakup\n\n"}