{"category": "spam", "to_address": "<simpsons@flax24.uwaterloo.ca>", "from_address": "\"Applied Informatics and Communications, Signal Proc\" <info@wseas.org>", "subject": "Dear Prof.Dr.Tudhope,", "body": "Dear Prof.Dr.Tudhope,\n\nWe would like to inform you, that the organizing committee will not\ngive extension in the deadline May 15, 2007 for the following\nconferences where the proceedings\nwill appear in a CD-ROM plus a in a book by WSEAS Press. See:\nhttp://www.worldses.org/books/index.html\n(The Books of the WSEAS Press participate in ISI, Elsevier, INSPEC\n(IET), EI, CSA, Ulrich, etc...)  \n\nSo, you can upload your paper until May 15\nfor the:\n\n* 7th WSEAS Int. Conf. on APPLIED INFORMATICS AND COMMUNICATIONS\n(AIC'07)\nhttp://www.wseas.org/conferences/2007/athens/aic\n\n\n* 7th WSEAS Int. Conf. on SIGNAL PROCESSING, COMPUTATIONAL GEOMETRY\nand  ARTIFICIAL VISION (ISCGAV'07)\nhttp://www.wseas.org/conferences/2007/athens/iscgav\n\n\n*7th WSEAS Int. Conf. on SYSTEMS THEORY AND SCIENTIFIC\nCOMPUTATION(ISTASC'07) \nhttp://www.wseas.org/conferences/2007/athens/istasc\n\nVouliagmeni Beach, Athens, Greece, August 24-26, 2007 \n\nwe would like to announce you several Plenary Speakers,\nInvited Sessions, Tutorial Sessions and Post-Conference Publications\n\nPlease, visit: www.wseas.org and upload your paper now\nuntil May 15.\n              www.wseas.org\n\t\t\t  \nNone extension in the deadline (May 15, 2007) will be given.\n\n\nAnother really important conference, with several Plenary and Invited\nSpeakers, Special Sessions, etc... is the\nEUROPEAN COMPUTING CONFERENCE that is co-organized by IARAS and WSEAS\nwith the Co-Sponsorship of Several European Universities\nhttp://www.iaras.org/ecc2007/\n\nFor the European Computing Conference the last day that you can upload\nyour paper is also: MAY 15, 2006.\nNone other extension will be given.\n(Several European Projects will be presented by IARAS Staff)\n\n\nFor all the other WSEAS Conferences of 2007, the deadlines exist on\nthe web and NONE extension will be given. \nFor example, the WSEAS Conferences of October 2007 in Arcachon, France\nhave deadline: June 15 and none extension will be given.\n\n\n\nADDITIONAL FEATURES FOR THE WSEAS CONFERENCES OF AUGUST 2007\nwww.wseas.org\n\n\n1) Publication of the Proceedings in 3 media: hard-copy, CD, E-Library\n----------------------------------------------------------------------\n(A) Hard-Copy Proceedings (Book) with ISBN and ISSN indexed by the\nmajor Citation Indexes: www.worldses.org/indexes\n\n(B) CD-ROM Proceedings with pages' numbers with ISBN and ISSN \n    indexed  by the major Citation Indexes: www.worldses.org/indexes\n\n(C) E-Library:  http://www.wseas.org/online\n\nand possible:\n\n  (D) JOURNAL PUBLICATION: Authors of high - quality papers of\narchival value are invited to send extended versions of their papers\nto the international WSEAS Journals after the conference. Necessary\nCondition is the presentation of the paper in the congress\n\n\n2) A very strong and important feature is that the WSEAS is going to\ngive you a new username and password WITHOUT EXPIRY DATE for on-line\naccess in the WSEAS Conference proceedings FOR EVER.\n\n       \n3) We have already arranged and each of you will receive in the CD-ROM\nProceedings, not only the Proceedings of these WSEAS conferences of\n2007 , but also the Proceedings of the same conferences in 2006 in\nGreece. Except the CD-ROM proceedings you will also receive Books\n(Hard-Copy) Proceedings with all the papers of the Multiconference \n  *** (MORE than 600 pages per volume!!!) ***\n\n4) Because we will maintain the same policy in 2008, your paper will\nbe available and readable in the CD-ROM that we will distribute in\nGermany in August of 2008 where we will have the same conferences.\n \n\n5) After the presentation of your paper we are going to consider it\nfor possible publication in the WSEAS Journals that, as you know,\nparticipate in all the International Scientific Indices (Elsevier,\nScopus, EI, Compendex, INSPEC, CSA .... see: www.worldses.org/indexes \n  )\n\n\n6) Rich cultural and social part as usual in WSEAS events.\nThe importance of these conferences can be proved by the impact\nof these conferences in 2006: See, please\nhttp://www.wseas.us/reports\nSee other reports at:  http://www.wseas.us/reports\n\n\n7) The conference Books (Hard-Copy Proceedings), CD-ROM proceedings\nand (Journals with selected papers) published by WSEAS Press continue\nto sell for a long time after the meeting has taken place. This is\nanother demonstration of the prestige the scientific community\nattribute to the meetings organised by the WSEAS.\n\n\n8) WSEAS has arranged collaboration with Hindawi Publishing Corp\nhttp://www.hindawi.com and Springer Verlag,\nso, several papers will appear in Volumes of Hindawi Publishing\nand Springer Verlag. The authors can select between WSEAS Journals,\nSpringer Verlag Volumes and Hindawi Publishing Company, however, this\nrequires presentation of your paper in the conference, submission\nof extended version after the conference and additional review and\nrevision. As you can see we have already started a collaboration with\nthe Springer verlag and enhanced and revised versions of these\npresented papers might appear in Springer Verlag volumes after the\nConference.\n\n\nAll the best\n\n\n>From the WSEAS Working Group\nComputer Science and Computing\n\n\n\n\nATTENTION\n-------------------------------------------------------------------\nIf you do not want to receive messages from the \"WSEAS Working Group\non Computer Science\" any longer, send an email to:\nomikron@worldses.org  where the Subject Line must contain the command: \n\n      STOP COMPUTERS simpsons@wheat.uwaterloo.ca WSEAS\n \n (Do not include this command in the main part of your email, only in\nthe subject please)\n\n"}