{"category": "spam", "to_address": "<gnitpick@flax9.uwaterloo.ca>", "from_address": "\"Senate Action\"<Fern.Goldsteinleadgenngroup.com@flax9.uwaterloo.ca>", "subject": "US Senate takes Action on Coal to Liquids Amendments", "body": "\n\n\n\nUS Senate takes Action on Coal to Liquids Amendments\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \nUNITED STATES SENATE  TAKES ACTION ON \n                              COAL TO LIQUIDS AMENDMENTS\n\n\n\n\n \n\n\n\n \n\n Tuesday, June 19,  the United States Senate voted on two separate Coal-to-Liquid amendments to the  Senate version of the Clean Energy Act of 2007.  The amendments were  offered by Senator Jim Bunning (R-KY) and Senator Jon Tester (D-MT). The Bunning amendment  was designed to reduce our Nation's dependency on  foreign oil by investing in clean, renewable, and alternative energy resources,  promoting new emerging energy technologies, developing greater efficiency, and  creating a Strategic Energy Efficiency and Renewables Reserve to invest in  alternative energy.\n\n\n\n \n\n\n\n\n \nLikewise,  the Tester amendment supported coal-to-liquid technology and also addressed America's  dependency on foreign oil by investing in clean, renewable, and alternative  energy resources, promoting new emerging energy technologies, developing  greater efficiency, and creating a Strategic Energy Efficiency and Renewables  Reserve to invest in alternative energy. \nThe  two amendments failed to pass the Senate by a vote of 39 to 55 and 33 to 61  respectively.   \"On the surface, this may seem like a blow to the  coal-to-liquids technology and industry,\" commented Silverado Green Fuel  Inc. CEO Garry L. Anselmo.  \"While  we would have preferred the Senate to deal with the issue during the debate on  the Clean Energy Act of 2007, our Capitol Hill sources have told us that the  leadership in both the Senate and House do not want to bring up the  coal-to-liquids issue as an attachment to the legislation.   Several  Congressmen and Senators have assured the American public that the issue of  coal-to-liquids will be brought up as a separate issue and receive the full and  fair debate it deserves.\" \n\n  As  an assurance to those supporters of the Low-Rank Coal-Water Fuel project,  Anselmo continued, \"We are actually encouraged by the two votes that took  place in the Senate yesterday.  First, if you look carefully at which Senators  voted for or against each amendment, you will see that overall, a healthy  majority (69 Senators) cast their vote FOR one or the other amendments.   That means that 69 out of 100 members of the United States Senate  actually voted in favor of the coal-to-liquids technology!  The second  encouraging fact is that the Hydrothermal Treatment process we use on  sub-bituminous coal and lignite is different than the processes used on  bituminous coal.  Our process does not require the tremendous capital  investment needed for the gasification process, the Shift-gas reaction, and the  Fischer-Tropsch reactions.   Hydrothermal Treatment is a much simpler and  less capital intensive process to create a non-hazardous, environmentally  friendly oil substitute for use in oil fired systems. It converts a dusty,  solid fuel that is prone to spontaneous combustion into a safe, non-hazardous,  low-cost liquid fuel for commercial, industrial, and utility boilers.  It  is a very suitable feedstock for gasification using General Electric technology  to produce synthesis gas, the start point for the Fischer Tropsch production of  clean burning synthetic transportation fuel.  We continue to work with  both Congress and the Federal Agencies as we move forward with our Mississippi  LRCWF project.  We are involved in ongoing meetings with the Mississippi architects  and engineers as well as the political interests who have been supporting this  project.\" \n\n\n  In  a related development, a recent 3rd party article published by Small  Cap Media contained some inaccuracies regarding the current status of the  Mississippi Green Fuel Project. \"Unfortunately, statements were made that  indicated we had already received government funding and other forward-looking  comments were also made,\" said Mr. Anselmo.   He continued, \"A  corrected version of the article has been released and is now available on our  website. ( http://leadgenngroup.com/cgi-bin/clickthru/6517/2472/92258 ) We apologize for any miscommunication and continue to move forward with the  project in Mississippi.  We also are looking toward beginning construction of the new facility in Mississippi.\" \nSilverado Green Fuel Inc. is a  wholly owned subsidiary of its publicly traded parent, Silverado Gold Mines  Ltd. For more information about Silverado Green Fuel Inc., please visit http://leadgenngroup.com/cgi-bin/clickthru/6518/2472/92258 and the parent  public corporation, http://leadgenngroup.com/cgi-bin/clickthru/6519/2472/92258.\n\n \n \n\n\n \n\n\n\n\n\n\n\n\n\nWish to no longer get mail, rmove here\n\n\n\n"}