{"category": "spam", "to_address": "ftp@plg.uwaterloo.ca", "from_address": "\"Gonzalo Sands\" <pifchallengerforsalegew@challengerforsale.com>", "subject": "Make your fat friends envy you", "body": "\nSay goodbye to extra pounds\n\n\n\n\n\n\nAnatrim – The up-to-the-moment and most attracting product for corpulent people is made available now – As told on CNN.\n\n\nCan you retain all the times when you asked yourself to do any thing for being delivered from this fastly growing pounds of fat? Happily, now no great sacrifice is necessary. With Anatrim, the ground-breaking kilos-melting combination of elements, you can achieve naturally health life style and become really thinner. Have a look at what people state!\n\n\n\n\"It’s difficult to confess but I was a junk food addict. \n\n\nI greedily devoured all this garbige \n\n\nand could not stop. \n\n\n\n\nThis fatal passion stopped after I started course with Anatrim! \n\n\nGod,\n\n\n\n\n my inclination to eat constantly disappeared, \n\n\nmood increased and I’m the happiest person in the world 18 pounds in 2.9 months. \n\n\n\n\nSo, I can tell you now I turned to the happiest person in the world!\"\n\n\n\n\n\nVictoria K., Colorado\n\n\n\n\n\n\"Since the very childhood I was a bulky boy. \n\n\nYou can't imagine how I hated being mocked at school. \n\n\n\n\nI detested the weight and I hated myself. \n\n\nAfter trying many different remedies I heard about Anatrim. \n\n\n\n\nThis stuff literally dragged me out of this horrible nightmare! The very sincere thanks to you, guys.\"\n\n\n\n\n\nSteve Burbon, Texas\n\n\n\n\n\n\"You know what? Anatrim preserved my marriage! I went into the circle, depression – more eating – even more depression. My wife was thinking about the leaving me as I was turning in overweight psycho. \n\n\nOne my best friend pointed at your web page and I asked for Anatrim as soon as it was possible. \n\n\nThe results were great, my appetite came to acceptable level, I was often in a good mood, and, of course, I became able to tighten my belt on some holes. And you know, the bed became cool, too!\"\n\n\n\n\n\nRikky\n\n\n\n\n There are lots of sincere gratitudes left by happy people trying Anatrim. Don’t you gonna add yourself to the thousands and thousands of slim people and try this natural appetite-suppressing power increasing product now!\n\n\nDo not lose your opportunity!\n\n\n\n\n"}