{"category": "ham", "to_address": "ktwarwic@speedy.uwaterloo.ca", "from_address": "CNN Student News <CNNStudentNews@cnn.com>", "subject": "April 13, 2007", "body": "CNN.com Student News Newsletter\n\n\n\n\n\n\n \nFriday, April 13, 2007 \n\n\n\n Watch and Learn\nToday's show begins with a report on a bombing that targeted Iraq's parliament. We also look back at the week's top stories and break down how tax dollars are spent.\nTeachers, please preview our Week in Review segment, which includes the controversy surrounding radio host Don Imus.\nEarth Day is just around the corner, and we want to know what your school is doing to mark the day. Send us an I-Report about your conservation efforts at CNN.com/EDUCATION.\n\n Head of financial aid group talks about scandal\nEvery day at colleges across the country, financial aid administrators help students navigate the complicated maze of grants and loans they need to finance their educations. The administrators consider it noble work -- and many took exception when New York Attorney General Andrew Cuomo started an investigation into the field's practices. But over the last few weeks, the landscape has changed. \n\n April 16, 2007 - The War Within\nCNN Special Investigations Unit Classroom Edition: The War Within, the first CNN Special Investigations Unit documentary, examines the troubling home-grown Muslim extremism in the United Kingdom. Reported by CNN's Christiane Amanpour, The War Within examines the cultural conflicts within Britain's Muslim communities and the alienation felt by many young Muslims living inside Western societies.Warning to educators: Please preview this program as it contains content that might be inappropriate for some students.Record the commercial-free Classroom Edition of CNN Presents every Monday between 4:00 am and 5:00 am ET. Educational materials for the episodes are available at CNN.com/EDUCATION. Please note that CNN Presents: Classroom Edition may be pre-empted at any time for coverage of breaking news.\n\n Week of April 9\n1. Not Legit - British2. Not Legit - cold3. Legit4. Not Legit - Tricolor5. Not Legit - Maryland6. Legit7. Not Legit - immigration8. Legit9. Legit10. Not Legit - health or medical careAccess this week's Newsquiz here!\n\n\n\n\n \nCNN Student News is a 10-minute, commercial-free news program that airs on CNN Headline News at 3:12 a.m. EST as well as on CNN.com/EDUCATION. Created by a team of journalists and educators, the program provides the top stories of the day, segments that encourage student participation, and in-depth special reports. In addition, CNN Student News provides free curriculum at CNN.com/EDUCATION to accompany each program's content. CNN Student News, along with CNN Presents: Classroom Edition, is Turner Broadcasting's contribution to Cable in the Classroom.\n Forward this to a friend\nYou have received this email because you have signed up to receive the CNNStudent News newsletter. Click here to unsubscribeEdit your profile here  \n"}