{"category": "spam", "to_address": "Snozzled <snozzled@flax24.uwaterloo.ca>", "from_address": "Renee Daugherty <istlove@greatescapekids.com>", "subject": "For Your Eyes Only", "body": "\n\nThe differences between men and women is that women are always ready for sex, but men need an erection. Let us remove this difference by offering you Viagra!\nGo to the site\nUse licensed Viagra and Cialis pills from our drug store. You will be the best, you will have perfect sex in your life!\nClick to visit us\nAbsolutely confidential and secure purchase.\nWith best regards,\nRenee Daugherty\n \n \nMoralnye problemy Kogda blednoe piatno mestnogo svetila posle nudnogo i utomitelnogo Karabkania v vysotu reshilo-taki ostanovitsia na otdyh tochno u menia nad golovoj, Ia tozhe ustroil sebe malenkuiu peredyshku. K chemu Terpet podobnoe neudobstvo, esli ia umeiu ubirat bol sam, svoimi silami, Eto ved tak prosto. Bedra, taliia, grud mechta liubogo normalnogo muzhika. Tak ia i sidel nekotoroe vremia, gluboko zadumavshis ni o chem, prosto dal Svoim mysliam polnuiu voliu. \nNarodu, nesmotria na vecher, v traktire bylo nemnogo, poetomu svobodnyh mest Hvatalo, no neznakomec, iavno ne vybiraia, proshel k blizhajshemu stolu, chto stoial u Steny sprava ot vhoda, i, tiazhelo opustivshis na skamiu, privalilsia k stene Spinoj. Noch, syrost i veter tozhe ne sposobstvuiut obshcheniiu. No. Ty, pravda, sejchas chuvstvuesh sebia normalno? vdrug sprosila Taj s Nepoddelnoj zabotoj. Shest Bigmana ushel vlevo, no on i ne pytalsia pogasit Inerciiu, kak ia, a, naoborot, vospolzovavshis svoim opytom bojca i moej Oshibkoj diletanta, pribavil sily, i nizhnij konec ego shesta, vychertiv vituiu Dugu, metnulsia k moim nogam. Nejtralizuj ego mech! Chto zh, lord nikogda ne byl glup. Prokliatie! On pridet, s nepokolebimoj uverennostiu zaveril Gilsveri. V golose zasfernika iavstvenno prostupil nadmennyj holod. \nSnachala, k nemalomu oblegcheniiu, polnostiu Ischezli prokliatye kusty-lipuchki, a zarosli nachali postepenno redet, chto Tozhe bylo neploho. Ia vygliadel teper tak: svetlyj polirovannyj plastik priamougolnogo Korpusa, odna iz storon kotorogo temnyj ekran. Pozadi poka bylo chisto, no opasnaia blizost Vestnikov Tmy oshchushchalas teper stol zhe iavstvenno, kak holodok vstrechnogo vetra na Razgoriachennom beshenoj skachkoj lice. On stoial v centre, pogruziv stopy i kraj vycvetshego sinego balahona v Zolotistyj studen, ia zhe sredi sten uzkoj pasti skalnogo koridora. ejisuminyon X1BcRlxCXUV0QllXUkAbREVSQFBDXlxbG1JT\n \n\n\n"}