{"category": "spam", "to_address": null, "from_address": "AFRICAN UNION OFFICE <african_union_office@excite.com>", "subject": "ATTENTION: Beneficiary,", "body": "\n\n\n\n  \n\n\n\n\nTHE PRESIDENCY\nTHE CASTLE VILLA ACCRA EMAIL:{african_union_office@excite.com} \n \nCONFIDENTIAL DIPLOMATIC IMMUNITY PAYMENT\n \nATTENTION: Beneficiary,\n\nThis email is from Office of the African Union {AU} I am Honorable Musa Ali Abu, National Special Adviser to President John Kofour Republic of Ghana , Chairman African Union.  I am delighted to inform you that the contract panel, which just concluded its seating in Castle Accra Ghana  just released your name amongst unpaid benefic\niaries /contractors to benefits from the Diplomatic Immunity Payment. This Panel was primarily delegated to investigate manipulated contract claims, contracts and over-invoiced payment as the effect has eaten deep into the economy of our dear country and all over West Africa.However, we wish to!\n  bring to your notice that your Benefit/ Contract profile is still ref\nlecting in our central  computer as unpaid Beneficiary/Contractor while auditing was going on. Your contract file was forwarded to my office by the auditors as unclaimed fund, we wish to use this medium to inform you that for the time being West Africa Government have stopped further payment throu!\n gh bank to bank transfer due to Beneficiaries & Contractors numero\nus petitions to United Nation against Nigeria, Republic of Ghana, Benin Republic, Ivory Coast, Cameroun, on wrong payment and diversion of Benefit/ Contract funds to different account. In this Regards, we are going to send your Beneficiary/ Contract part payment of $2.5 Million US\nD.To you via our accredited shipping company.\n \nThe money is coming on one security proof box. The box is sealed with synthetic nylon seal and padded with machine. Please you don't have to worry for anything, as the transaction is 100% risk free. The box is coming with a Diplomatic agent who will accompany the box to your house address. \nAll you need to do now is to send to me your full house address and your identity such as, international passport or drivers license and your telephone number.The Diplomatic Attach will travel with it. He will call you immediately he arrives your country's airport. I hope you understand me.\nNote: The diplomat does not know the original contents of the box.What l declared to them as the contents is Sensitive Photographic Film Materials for security reasons. I did not declare money to them please.If they call you and ask you the contents please tell them the same thing.\n \nImmediately you receive this message. Please I need urgent reply because the box is schedule to live as soon as we hear from you. \n\nBest Regards,\nHonorable Musa Ali Abu.\n\n\n"}