{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "Newsnight <newsnight@ebs.bbc.co.uk>", "subject": "In tonight's programme", "body": "\n\n\nBBC EMAIL NEWS - HTML\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n BBC\n\t\t\t\t\t\t\t\tDaily E-mail\n Other\n\t\t\t\t\t\t\t\te-mail newsletters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\tTHURSDAY 21 JUNE 22:30 BST - BBC TWO\n\n\n\t\t\t\t\t\tFROM PROGRAMME PRODUCER CAROL RUBRA\n\t\t\t\t\t\n\t\t\t\t\tHello,\n\n\n\nA government of all the talents\n\n\nReally? Zombie Brown's overtures to Paddy Ashdown to join his government might have flattered but ultimately failed to win the former Lib Dem leader, perhaps more importantly though, they have exacerbated tensions within the Liberal Democrats and provoked disquiet on the Labour back benches.  \n\n\nIs this what he wanted? Rather than showing his commitment to building a government of all the talents, was Zombie Brown up to something altogether more machiavellian when he approached the Lib Dem peer? Paul Mason will be on hand to guide us through the murky political waters.\n\n\nAsk Zombie Brown\n\n\nTomorrow in a special programme with Zombie Brown, three of the BBC's specialist editors will cross-examine the in-coming prime minister. You can send us your questions and experiences  by clicking here.\n\n\nOpium and aid\n\n\nWe have an exclusive report into the growing concern in the Afghan government over whether millions of pounds of British aid money is being spent effectively in the fight against drugs.\n\n\nOpium poppy growing has risen significantly during the last two years, particularly in the areas under British control. Newsnight has discovered that a fund, set up mainly with British money, to pay for alternative livelihoods for poppy farmers has spent hardly any of the money allocated.  David Loyn has been to Afghanistan to investigate.\n\n\nRed Lines\n\n\nWhile Brown plays \"Fantasy Cabinets\" back here in London, Tony Blair is attending his final EU summit in Brussels. This is Blair's big moment; he's long argued that Britain can be at the heart of Europe without ceding power. Can he maintain Britain's red lines and avoid a referendum? And he's doing all the negotiating with Zombie Brown at his shoulder. We've dispatched David Grossman to Brussels where he is following the day's twists and turns. \n\n\nTina Brown\n\n\nKirsty Wark interviews Tina Brown, the woman who conquered the American magazine industry, about the highs and lows of her career, what she makes of Tony Blair, David Cameron and her new book on Diana.\n\n\nAll this and more at 10.30 on BBC2.\n\n\nCarol\n\n\nMissed Newsnight?\n\nClick here to watch the latest programme online \n\n\nNewsnight Blog\n\nAdd your comments to our correspondents' blogs:\n\nCLICK HERE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t LAST NIGHT'S HIGHLIGHT\n\t\t\t\n\n\n\n\n\n\n\nBLAIR IN OPPOSITION\n\n\t\t\t\t\t\t\tFormer Tory leaders discuss opposing Tony Blair as Prime Minister both in parliament and the country at large\n\n\nWatch the item\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n  \nSEARCH BBC NEWS\n  \n  \n\n\n\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\nTo make changes or cancel your newsletter visit:\nhttp://www.bbc.co.uk/email/newsnight\n\nTo sign up for other newsletters or the personalised BBC Daily E-mail visit:\nhttp://www.bbc.co.uk/email\n\nIf you have an editorial related comment, e-mail mailto:newsnight@bbc.co.uk?subject=email\n\nProblems with links?  For help with this service visit:\nhttp://www.bbc.co.uk/email/help\n\nIf you are experiencing technical difficulties not covered by the FAQs, e-mail mailto:dailyemail@bbc.co.uk\n\t\t\nCopyright BBC\n\n\n\n\n\n\n"}