{"category": "spam", "to_address": "<elaastic@speedy.uwaterloo.ca>", "from_address": "\"Velazquez O. Wilfrid\" <ecbv@eritter.net>", "subject": "While some shoppers say the Atkins craze is on its way out, these farmers aren't convinced SunLite's success will depend on the life span of the fad.", "body": "\n\n\n\n\n\n\n\nHowever, a survey performed during the week of \nJan.\nTheir results show that most diabetic cats on the \n\"Catkins\" diet can ditch daily insulin shots altogether.\n\"A diet enriched in PUFA has shown to help in brain \ndevelopment and decreases the excitability of nerve cells that can induce \nseizures.\nWhile some shoppers say the Atkins craze is on its \nway out, these farmers aren't convinced SunLite's success will depend on the life \nspan of the fad. \"That goes quickly considering serving sizes,\" she \nsaid.\nIt was preceded by Dr. \"Traditionally, Atkins is \nviewed as a weight loss and weight management program, but Dr.\nThat bodes well for more traditional diet plans \nsuch as Weight Watchers which features a diet plan that doesn't count carbs and also \noffers a modified carb-counting program. Cutting out fruits because they contain \ncarbohydrates can also cause serious nutritional deficiencies. we still have a solid \nmarket share,\" Wiant said yesterday. See more articles and news on diabetesTrack \nnews on diabetes at DiseaseWatch.\nThe Atkins diet fad is petering out in the UK as \nelsewhere, and although people are still concerned about carbohydrate intake, few \nare purchasing the Atkins products.\nMajor corporations started making low-carb versions \nof food products, and grocery stores devoted shelves to them. Store owners \neverywhere are seeing the low-carb trend fade, and many are left with lots of \ninventory and no customers. Harris was hoping to cash in on a growing lifestyle; \ninstead, she was ruined when it became a fad. , one of the co-authors of Atkins \nDiabetes Revolution.\nShe came out to Arizona in 1999 after getting a job \nwith Stevia, a Mesa company that manufactures an herbal dietary supplement that \nlow-carb devotees use as a sugar substitute.\nThat snack wouldn't help her lose weight or change \nher eating habits.\n\"\"The thing that convinced me that this was the \nright diet was the improved quality of life for these cats,\" Greco says. Deborah \nGreco and Mark Peterson, staff endocrinologists at The Animal Medical Center in New \nYork, have found that, in many cases, veterinarians and cat owners can control \ndiabetes with diet. \"I have Eat and Grow Thin, by Vance Thompson, published in 1916, \noutlining a low carbohydrate diet.\nMost are turning to Weight Watchers and other \nprograms that involve less carb counting and healthier eating. According to \naddiction expert DesMaisons,  many people, including those who are depressed, \nare.\n"}