{"category": "ham", "to_address": "ktwarwic@flax9.uwaterloo.ca", "from_address": "\"BBC daily email\" <dailyemail@bbc.co.uk>", "subject": "Your daily e-mail from the BBC", "body": "\n\n\n\n\n\n\n\nThursday, 17 May, 2007, 18:00 GMT 14:00 -04:00:Canada/Eastern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSearch BBC Sport \n\n\n\n\n\n\n\n\n\n\n\n\n\nFOOTBALL\n\n\n\n\nRanieri plays down Man City link\nClaudio Ranieri says he has not been contacted about the Man City job, despite bookmakers making him firm favourite.\n\n\n\n \nWhelan demands league chiefs quit\nWigan chairman Dave Whelan says Premier League chief executive Richard Scudamore should resign in the wake of the West Ham controversy.\n\n\n\n \nUnsworth and De Zeeuw leave Wigan\nWigan release former captain Arjan de Zeeuw and fellow defender David Unsworth.\n\n\n\n\n\n\n\n\nGOLF\n\n\n\n\nIrish Open leaderboard\nThe latest scores from the European Tour event at Adare Manor.\n\n\n\n \nIrish Open hit by lure of US Tour\nGraeme McDowell says events such as this week's Irish Open are suffering because of the US Tour's strength.\n\n\n\n \nBallesteros set for senior debut\nSeve Ballesteros will make his Champions Tour debut at the Regions Charity Classic in Birmingham, Alabama, on Friday.\n\n\n\n\n\n\n\n\nMOTORSPORT\n\n\n\n\nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n \nNieto replaces Jacque at Le Mans\nKawasaki's Olivier Jacque will miss this weekend's French Grand Prix at Le Mans with an arm injury.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n\n\n\n\n\nFORMULA ONE\n\n\n\n\nHamilton won't win title - Jordan\nFormer team boss Eddie Jordan says Lewis Hamilton is an \"extraordinary talent\" but will not be world champion this year.\n\n\n\n \nHamilton will set 'new standards'\nLewis Hamilton will \"create the new benchmark for Formula One\", according to three-time champion Jackie Stewart.\n\n\n\n \nAlonso plays down Hamilton threat\nFernando Alonso says he does not regard McLaren team-mate Lewis Hamilton as his biggest threat this season.\n\n\n\n\n\n\n\n\nATHLETICS\n\n\n\n\nKenya star denied Manchester visa\nWorld half-marathon record holder Sammy Wanjiru will miss Sunday's Great Manchester Run after failing to obtain a visa.\n\n\n\n \nSprint stars set for Loughborough\nThree of the British squad that won the Olympic 4x100m gold in 2004 will compete at the Loughborough International on Sunday.\n\n\n\n \nCheruiyot storms to Glasgow win\nVivian Cheruiyot wins the women's 10 kilometres road race in Glasgow.\n\n\n\n\n\n\n\n\nCYCLING\n\n\n\n\nFoerster races to Giro stage win\nRobert Foerster wins stage five of the Giro d'Italia but Danilo Di Luca retains the overall lead.\n\n\n\n \nCavendish outlines Tour ambition\nBritain's Mark Cavendish believes he is on course to one day challenge for sprint glory in the Tour de France.\n\n\n\n \nDi Luca claims Giro d'Italia lead\nDanilo Di Luca takes the overall lead in the Giro d'Italia after team-mate Enrico Gasparotto falls.\n\n\n\n\n\n\n\n\nFUN AND GAMES\n\n\n\n\nFA Cup final Ten to Tackle\nTest your knowledge of the competititon  with our special quiz\n\n\n\n \nChris Evans talks to Vaughan and Stewart\nMichael Vaughan arrives late for his Chris Evans interview then asks the DJ to bowl at him in the nets. Alec Stewart also gives his views on the Test series with West Indies. \n\nEvans and sidekick Jonny Saunders have a different sporting guest every evening on their Radio 2 show.\n\n\n\n \nKP's rough guide to Britain\nListen to Pietersen spoof on new Radio 4 show Look Away Now\n\n\n\n \nOPTIONS AND HELP\n\n \n \nYou are subscribed from the e-mail address:\nktwarwic@speedy.uwaterloo.ca\n\nChange\nTo change your e-mail address, the content or format of your daily e-mail, visit:\nhttp://www.bbc.co.uk/email\n\nUnsubscribe\nTo unsubscribe, visit:\nhttp://www.bbc.co.uk/email\n\nOther e-mails\nTo see the full range of e-mails available visit:\nhttp://www.bbc.co.uk/email\n\n\n\n \n \nHelp\nIf you are having problems with story links or for general help visit:\nhttp://www.bbc.co.uk/email/help\n\nFeedback\nPlease send feedback to:\nmailto:dailyemail@bbc.co.uk\n\n\n\n \n \nCopyright BBC 2005\n\n\n"}