{"category": "spam", "to_address": "smiles@flax9.uwaterloo.ca", "from_address": "\"Mr Gary\" <gary_love@Gwalla.com>", "subject": "CONTRACT", "body": "Hello, \n\nI am , Gary Kruger I live and work in the United Kingdom, \nwith an European shipping line. \nActaully there is a contract which I will like to introduce to you,\nonly if you are interested . \n\nThis contract is on a product called AQUA-CHIPS,it is a product \nused in operating ship, its a navigating crystal product which directs \nthe ship while in motion.Many ship here in UK have not been able to\n move out for work for some time due to scarcity and high cost of this\n product here.This particular product is produced in Brazil Australia, \nand just recently I got a contact where this AQUA-CHIPS is distributed\n in Malaysia at a cheap cost of 2050 Malaysian dollars per bottle,which\n is equivalent to GBP380 pounds,and you will be sell to the company at \nthe price of 5,700 Malaysian dollars per bottle,equivalent to GBP840 pounds.\n It consist of 30 bottles in one carton. \n\nEach company that comes to Malysia for this product will buy at least 3 cartons.\nMy proposition is to present you as the supplier of this product to the engineers \nthat will be coming from the shipping company here in UK to buy this product in\n Asia (Malaysia). I will be introducing you to the shipping company as the\n distributor of this product in Asia ,this contract will be continuous as long as you\n are capable enough to handle it properly. \n\nImmediately you signify your interest to execute this transaction, I intend to send\n you the scanned picture of the product and its function as it is in the ship. Kindly\n understand that as far as this contract is concerned,you will have to pose as the \nreal distributor in Malaysia to the Engineers.Hence, I will advice that you buy the\n product out from the distributor there as we make all arrangement with the company here. \n\nI thank God for joining both of us in this contract. \n\nRegards,\n\nMr Gary.\n\n\n\n"}