{"category": "ham", "to_address": "\"Arne Brutschy\" <abr-r-project@xylon.de>", "from_address": "\"hadley wickham\" <h.wickham@gmail.com>", "subject": "Re: [R] Visualize quartiles of plot line", "body": "On 6/17/07, Arne Brutschy  wrote:\n> Hi,\n>\n> thanks for your tips - all of them worked. After a bit of fiddling, I\n> managed to get what I wanted.\n\nGlad to hear it.\n\n> hadley wickham wrote:\n> h> You might want to read the introductory chapters in the ggplot book,\n> h> available from http://had.co.nz/ggplot2, which will give you more of a\n> h> background.  Please let me know places where you think the\n> h> documentation is inconsistent so I can try and make them better.\n> I already did. :) A general problem: the examples are nice and easy to\n> get, but it's often hard to apply them to my own specific problem.\n> It's more a problem of the general structure: what has to go where.\n> Most of the methods are using qplot, but what do I have to do if I'm\n> trying create a more complex plot. Hmm, it's hard to describe.\n>\n> Example: I know how I set the title when using qplot (qplot(....\n> main=\"asdf\"). Where do I have to put it when I'm using gplot? Stuff\n> like this is unclear...\n\np <- ggplot(...) + ...\np$title <- \"Title goes here\"\n\nIt is currently hard to figure this out in the current documentation though.\n\n> A more general problem is, that the manual pages are very, eh,\n> minimalistic documented. The overall reference page is good and nicely\n> structured. But the big idea is sort of missing. All components are\n> linked, but the basics like layout, ggplot, aes etc are harder to find\n> - and their help pages are the shortest. Especially the small details\n> are hard to figure out. Lists of attributes etc..\n\nYes, that's definitely something I'm working on for the book.\nUnfortunately, I don't have\n that much time and it is a lot of work.  Every comment helps though.\n\n> Hmm, I know this is not really helpful. I can't describe my problems\n> properly, I guess. Perhaps the documentation simply has to improve\n> based on users questions. :\\\n>\n> How old is this package? I think it's really, really great, but are\n> there many users? Is there an additional mailinglist or forum where I\n> can get more information?\n\nIt's pretty young still, although the precursor ggplot package has\nbeen around for about a year.  I really have no idea how many users\nthere are.  For questions, either email me or R-help.\n\n> Some more questions:\n>\n> Why doesn't ggplot2 work with layout()? I'm using viewport now, which\n> works fine for me, but there should be a note in the docs perhaps.\n\nBecause it works with the grid drawing package - see the last chapter\nin the ggplot book for some details on how to use the grid\nequivalents.\n\n> How do I change the legend. The auto-creation of it might be nice,\n> but I want a) to add a title b) change the order to ascending and c)\n> add a short description like:\n>\n>   DeltaConfig\n>   [ ] 0 best\n>   [ ]\n>   [ ] 5\n>   [ ]\n>   [ ]10 worst\n>\n> I don't know if this is possible, but it would be nice to explain what\n> the colors/values might mean if it's not clear from the beginning\n> (ligke diamonds.size). The only thing I found was the attribute\n> legend.justifcation in ggopt, which isn't fully documented.\n\nThe legends aren't very customisable at the moment - look at the\nexamples for the scale functions to see what you can do.  You can see\nthe name of the title easily, and you can change the labels by\nchanging the level of the factors, or setting the breaks argument.  I\nagree there could be more options.  If you could provide me with a\npicture of what you want, I'll add it to my to do list to think about.\n\n> Additionally, how can I change the order of the facets? I currently\n> have a plot with a smoother for each model (all in the same plot),\n> which sorts the models like this: dyn,dl4,dl3 Below that, I have a\n> facet with point-plots for each model which sorts them the other way\n> round, which is a bit confusing.\n\nAgain, change the order of the underlying factor.\n\n> BTW, what's the \"strip\" and the associated attributes?\n\nThe strip is the labelled associated with the facet.\n\n> Again, I think this package is great - nice work! All the above isn't\n> meant as general critisism, but is being said in order to improve the\n> documentation..\n\nI do appreciate your comments and they definitely help me to make a\nbetter product.\n\nThanks,\n\nHadley\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}