{"category": "ham", "to_address": "Paul Johnson <pauljohn32@gmail.com>", "from_address": "Prof Brian Ripley <ripley@stats.ox.ac.uk>", "subject": "Re: [R] ordered logistic regression with random effects. Howto?", "body": "On the definitional question, some texts do indeed consider multi-category \nlogistic regression as a glm.  But the original definition by Nelder does \nnot.  I've never seen polr considered to be a glm (but it way well have \nbeen done).\n\nAdding random effects is a whole different ball game: you need to \nintegrate over the random effects to find a likelihood.  That integration \nis tricky, and I am not sure we yet have reliable software for it in the \nbinary ('dichotomous dependent variable') case: SAS's NLMIXED certainly is \nnot reliable.  I've had students run real problems through a variety of \nsoftware, and get quite different results.  (It is possible that the shape \nof the likelihood is a problem but it is not the only one.)\n\nMCMC approaches to that integration are an alternative not mentioned \nbelow.\n\nOn Mon, 7 May 2007, Paul Johnson wrote:\n\n> I'd like to estimate an ordinal logistic regression with a random\n> effect for a grouping variable.   I do not find a pre-packaged\n> algorithm for this.  I've found methods glmmML (package: glmmML) and\n> lmer (package: lme4) both work fine with dichotomous dependent\n> variables. I'd like a model similar to polr (package: MASS) or lrm\n> (package: Design) that allows random effects.\n>\n> I was thinking there might be a trick that might allow me to use a\n> program written for a dichotomous dependent variable with a mixed\n> effect to estimate such a model.  The proportional odds logistic\n> regression is often written as a sequence of dichotomous comparisons.\n> But it seems to me that, if it would work, then somebody would have\n> proposed it already.\n\nYou need to combine all the binary comparisons to get the likelihood, and \nthe models have parameters in common.\n\n> I've found some commentary about methods of fitting ordinal logistic\n> regression with other procedures, however, and I would like to ask for\n> your advice and experience with this. In this article,\n>\n> Ching-Fan Sheu, \"Fitting mixed-effects models for repeated ordinal\n> outcomes with the NLMIXED procedure\" Behavior Research Methods,\n> Instruments, & Computers, 2002, 34(2): 151-157.\n>\n> the other gives an approach that works in SAS's NLMIXED procedure.  In\n> this approach, one explicitly writes down the probability that each\n> level will be achieved (using the linear predictor and constants for\n> each level).  I THINK I could find a way to translate this approach\n> into a model that can be fitted with either nlme or lmer.  Has someone\n> done it?\n>\n> What other strategies for fitting mixed ordinal models are there in R?\n>\n> Finally, a definitional question.  Is a multi-category logistic\n> regression (either ordered or not) a member of the glm family?  I had\n> thought the answer is no, mainly because glm and other R functions for\n> glms never mention multi-category qualitative dependent variables and\n> also because the distribution does not seem to fall into the\n> exponential family.  However, some textbooks do include the\n> multicategory models in the GLM treatment.\n>\n>\n>\n\n-- \nBrian D. Ripley,                  ripley@stats.ox.ac.uk\nProfessor of Applied Statistics,  http://www.stats.ox.ac.uk/~ripley/\nUniversity of Oxford,             Tel:  +44 1865 272861 (self)\n1 South Parks Road,                     +44 1865 272866 (PA)\nOxford OX1 3TG, UK                Fax:  +44 1865 272595\n\n______________________________________________\nR-help@stat.math.ethz.ch mailing list\nhttps://stat.ethz.ch/mailman/listinfo/r-help\nPLEASE do read the posting guide http://www.R-project.org/posting-guide.html\nand provide commented, minimal, self-contained, reproducible code.\n\n"}